[{"lang": "en", "startDate": "2019-04-05", "endDate": "2019-04-05", "location": "Bangalore, India", "speaker": "Kumar", "title": "ThoughtWorks Bangalore", "subject": "Kotlin Hiring Bootcamp", "url": "https://www.meetup.com/ThoughtWorks-Bangalore/events/259557625/", "description": "<p>This 2-day workshop would be a hands-on session to explore Kotlin using different programming paradigms such as functional, reactive etc. The idea is to come together, brainstorm and learn a new programming language!</p>"}, {"lang": "pl", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Rzeszów, Poland", "speaker": "Artur Skowroński", "title": "Rzeszów Java User Group", "subject": "TBC - multithreading with Project Loom and Kotlin's Coroutines", "url": "https://www.meetup.com/Rzeszow-Java-User-Group/events/qmvrdpyzfbrb/", "description": "<p>Both Java and Kotlin are languages that are heavily used in Distributed Systems, handling multiple asynchronous operations simultaneously. Blocking is not an option in such an environment, but let’s be honest, we crave for the easier synchronous world. That’s why JVM as a platform has an inherent focus on providing an easier option of multithreaded programming. Today, I’d like to compare two of such options - Kotlin Coroutines and Project Loom, that want to provide fibers and continuations to core Java.</p>"}, {"lang": "en", "startDate": "2019-04-03", "endDate": "2019-04-03", "location": "Karlsruhe, Germany", "speaker": "Anton Kostanjsek", "title": "Kotlin Karlsruhe User Group", "subject": "Kotlin and the Chrono24 Android-app", "url": "https://www.meetup.com/Kotlin-Karlsruhe-User-Group/events/259757223", "description": "<p>- History\n- Concept and architecture\n- Rewrite: Challenges/Kotlin specific benefit</p>"}, {"lang": "fr", "startDate": "2019-05-15", "endDate": "2019-05-15", "location": "Valbonne, France", "speaker": "Emmanuel Vinas", "title": "Riviera Dev 2019", "subject": "Deep Dive Kotlin:Du Hello World AU Bytecode", "url": "https://rivieradev.fr/session/615", "description": "<p>-Comment aborder un nouveau langage? Les uns répondent en codant, les autres en regardant son fonctionnement en détail. Dans ce 'Deep Dive' nous vous proposons les deux ! Quoi de mieux qu'un live-coding d'un exercice complet pour découvrir les idiomes du langage. Puis en regardant sous le capot, les fonctionnalités que nous n'avons pas (encore) en Java, ne resteront plus un mystère pour vous !</p>"}, {"lang": "ru", "startDate": "2019-04-23", "endDate": "2019-04-23", "location": "Moscow, Russia", "speaker": "Vitaly Bragilevsky", "title": "Apps Conf 2019", "subject": "Не морочьте мне голову со своим функциональным программированием", "url": "http://appsconf.ru/moscow/2019/abstracts/4419", "description": "<p>-Адепты функционального программирования очень любят завлекать неопытных программистов обещаниями идеальной выразительности кода, его стопроцентной корректности, лёгкости поддержки и простоты рефакторинга. Иные даже пророчат высочайшую производительность и попадание после смерти напрямую в райские кущи. Опытные разработчики знают, что ничего такого не бывает, программирование — это тяжёлый труд, а серебряные пули, может, и помогают от вампиров, но никак не в процессе разработки ПО. С другой стороны, если что-то может хоть как-то облегчить труд программиста, то почему бы не попробовать этим чем-то воспользоваться?</p>\n<p>-В своём докладе я сформулирую основные элементы функционального стиля программирования, приведу примеры их воплощения в коде на двух языках - Swift и Kotlin, а также попытаюсь предложить прагматичный подход к их применению. Разработчики этих языков прекрасно знакомы с функциональным программированием, поэтому они смогли сделать удобным его применение «в малом», предусмотрев все необходимые компоненты. Причём чем дальше, тем качественнее и полнее соответствующая поддержка реализуется.</p>"}, {"lang": "en", "startDate": "2019-03-17", "endDate": "2019-03-17", "location": "Izmir, Turkey", "speaker": "Elif Boncuk", "title": "Women Techmakers Izmir IWD '19", "subject": "Kotlin Cheat Sheet", "url": "https://www.meetup.com/GDG-Izmir/events/258331774/"}, {"lang": "es", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "México,Mexico", "speaker": "Dinorah Tovar", "title": "WeWork", "subject": "Arquitectura en Android: Haciendo magia con el desarrollo en Kotlin", "url": "https://arquitecturaenandroidhaciendomagiaconeldesarrolloe.splashthat.com/", "description": "<p>-Aprende las diferencias entre Java y Kotlin, el nuevo lenguaje oficial de Android y por qué es magia que puedes entender en poco tiempo de manera eficiente.</p>\n<p>Conoce los principios básicos de Clean Architecture para garantizar que tu desarrollo en Android sobreviva en una industria en constante evolución.</p>\n<p>Comparte una pizza con nosotros mientras discutimos sobre las mejores practicas en Android.</p>"}, {"lang": "en", "startDate": "2019-03-23", "endDate": "2019-03-23", "location": "Bangalore, India", "speaker": "Adit Lal", "title": "BlrKotlin - Kotlin User Group", "subject": "The power of inline", "url": "https://www.meetup.com/BlrKotlin/events/259353339", "description": "<p>This talk highlights the usages of Inline in Kotlin.\nHow it works and how it helps increase code quality. This session will provide some details on experimental features like inline classes, the difference between inline, crossInline and noinline.</p>"}, {"lang": "en", "startDate": "2019-03-23", "endDate": "2019-03-23", "location": "Bangalore, India", "speaker": "Adit Lal", "title": "BlrKotlin - Kotlin User Group", "subject": "Coroutines & Asynchronous Programming", "url": "https://www.meetup.com/BlrKotlin/events/259353339", "description": "<p>This talk is targeted for audiences who are already a bit familiar or atleast had a short introduction to Kotlin Coroutines.\nWe will dig deeper to various APIs of Coroutines and how to use them more efficiently. We will also explore experimental features of Kotlin coroutines - channels and the select API.\nFinally we will have a look how to use Coroutines with Rx with kotlinx-coroutines-rx2</p>"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Madrid, Spain", "speaker": "Wojtek Kalicinski", "title": "Madrid Android Developer Group", "subject": "All for one and one for all. Kotlin Mutiplatform", "url": "https://www.meetup.com/madrid-android-dev-group/events/259820707/", "description": "<p>The promise of cross-platform frameworks looks great on paper, and some of them do a pretty good job delivering actual results. But with inherent differences between platforms, is \"build once, run anywhere\" even worth pursuing? Learn how you can share parts of your app between mobile platforms (and even the web!) without compromising quality, and delivering a best in class Android experience. During this talk I'll explain the basics of setting up Kotlin Multiplatform projects, show an example app sharing business logic in Kotlin between Android, iOS and the web, and show how to implement your own Kotlin MP libraries.</p>"}, {"lang": "ru", "startDate": "2019-03-13", "endDate": "2019-03-13", "location": "Moscow, Russia", "speaker": "Pavel Finkelstein", "title": "DevsDay.ru", "subject": "Kotlin в продакшн", "url": "https://devsday.ru/event/details/576", "description": "<p>На встрече Павел предлагает обсудить, как живётся котлину в энтерпрайзе большей или меньшей коварности. Он расскажет, на какие грабли успел наступить примерно за два года активной разработки, какие плюшки и удобности нашёл, и что его удивило.</p>"}, {"lang": "en", "startDate": "2019-03-18", "endDate": "2019-03-18", "location": "Utrecht, Netherlands", "speaker": "Sébastien Deleuze", "title": "Sourcelabs B.V.", "subject": "Spring Boot with Kofu and Coroutines", "url": "https://www.meetup.com/Sourcelabs/events/258188421/"}, {"lang": "en", "startDate": "2019-03-18", "endDate": "2019-03-18", "location": "Utrecht, Netherlands", "speaker": "Allard Buijze", "title": "Sourcelabs B.V.", "subject": "Bootiful CQRS and Event Sourcing with Axon", "url": "https://www.meetup.com/Sourcelabs/events/258188421/"}, {"lang": "en", "startDate": "2019-03-18", "endDate": "2019-03-18", "location": "New York, NY, USA", "speaker": "Chris Celiberti", "title": "New York Kotlin Meetup", "subject": "Corda / Blockchain", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/259390602/", "description": "<p>With Blockchain being all the rage these days right, wrong or indifferent companies are looking at this technology to create de-centralized products and services. StreetWire will present its real estate application built on Kotlin using R3's Corda open source platform exploring the workings of the blockchain, Corda's framework, Kotlin code and technical aspects of the application.</p>"}, {"lang": "en", "startDate": "2019-03-18", "endDate": "2019-03-18", "location": "New York, NY, USA", "speaker": "Talon Ghost", "title": "New York Kotlin Meetup", "subject": "Nimble Web Framework", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/259390602/", "description": "<p>Let's build a web app with Kotlin! In this talk I would like to share how Nimble makes it easy peasy to start building web applications that share the same data structures and logic as your backend Kotlin service! We will explore a small example that consumes data from the internet and renders content onto a page while investigating the simple API exposed by Nimble!</p>"}, {"lang": "en", "startDate": "2019-03-18", "endDate": "2019-03-18", "location": "Singapore, Singapore", "speaker": "Andrey Mischenko", "title": "Singapore Kotlin User group", "subject": "Kotlin Part", "url": "https://www.meetup.com/kotlinsg/events/259591175/", "description": "<p>This talk is about the current state of the Kotlin as a `tool` for multiplatform development for Android and iOS. The presented approach can be considered as a solution for the old problem of sharing code between platforms and might be interesting for both Android and iOS developers</p>"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Brussels, Belgium", "speaker": "Guy Heylens", "title": "Kotlin Belgium User Group", "subject": "Kotlin/Native: The Good, The Bad, and the Ugly", "url": "https://www.meetup.com/Kotlin-User-Group-Belgium/events/259364203/", "description": "<p>The promise of write-once-run-everywhere has haunted native mobile developers since the first time someone whispered the words “phone gap”. But what if there was a way to have cross-platform development with a modern, type-safe language? JetBrains is trying to make this happen with Kotlin/Native, which compiles to LLVM bytecode, and can run on iOS, Android, and even the web. Learn more about some of the benefits of working with Kotlin/Native, some of the drawbacks, and a few of the (current) potential dealbreakers when it comes to using this exciting new technology in a real app.</p>"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Cambridge, MA", "speaker": "Paul Reilly", "title": "Kotlin Office Hours", "subject": "Kotlin MPP in action on the Argus Project", "url": "https://www.meetup.com/kotlin-office-hours/events/259741586/", "description": "<p>Tonight, I will present a status update on the Argus project. We will focus on a Kotlin MPP support library\nused to provide data from The Movie DB (TMDB) visiting some Kotlin features used in the library (tmdb-lib at\nhttps://github.com/pajato/tmdb-lib), specifically parsing Json with Kotlin Serialization, accessing TMDB data sets using\ncoroutines and testing using Ktor. The talk will be highly interactive as I seek out feedback and suggestions from the\nKotlin gurus in attendance.</p>"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Berlin, Germany", "speaker": "Michel Onwordi", "title": "Kotlin user group Berlin", "subject": "Type Assisted Development: A case for Inline Classes", "url": "https://www.meetup.com/kotlin-berlin/events/tvhffpyzfbcc/"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Berlin, Germany", "speaker": "Oleksii Fedorov", "title": "Kotlin user group Berlin", "subject": "How to Avoid False Sense of Null-safety?", "url": "https://www.meetup.com/kotlin-berlin/events/tvhffpyzfbcc/"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "Bucharest, Romania", "speaker": "Gabriel Alexandru", "title": "Softbinator", "subject": "Let's talk about Kotlin!", "url": "https://www.meetup.com/softbinator/events/259793500/"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Oslo, Norway", "speaker": "Marie Katrine Ekeberg, Anders Mikkelsen", "title": "Oslo Kotlin Meetup", "subject": "Kotlin hack and learn - coroutines", "url": "https://www.meetup.com/meetup-group-nWeRbyMu/events/259663337/", "description": "<p>Want to hack and learn coroutines with us? Coroutines is a popular topic these days when parallell and asynchronous programming is discussed. In this meetup we will take a look at coroutines, their differences to threads and how you can use it in your project. Instead of just a presentation, we will hack and learn together! Bring your laptop, we will provide pizza and tasks. To get you started we will even throw a short introductory presentation into the mix.</p>"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Belfast, United Kingdom", "speaker": "Gareth Fleming", "title": "Kotlin Belfast User Group", "subject": "The transition from Java to the wonderful world of Koltin", "url": "https://www.meetup.com/kotlin-belfast/events/259063462/"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Belfast, United Kingdom", "speaker": "Dmitry Kandalov", "title": "Kotlin Belfast User Group", "subject": "Writing a fully-working game of Snake in less than an hour of pure Kotlin + IntelliJ", "url": "https://www.meetup.com/kotlin-belfast/events/259063462/"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Sydney, Australia", "speaker": "Dave Glover", "title": "Sydney Kotlin User Group", "subject": "Building an End-to-End Secure, Scalable IoT Serverless Solution", "url": "https://sydkotlin.space/#meetup-march-2019", "description": "<p>Learn how to build and run your IoT solutions securely and at scale. We will cover device security with Azure Sphere, distribute intelligence to the edge with Azure IoT Edge, and building real-time serverless solutions with Azure Functions and Azure SignalR</p>"}, {"lang": "uk", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Lviv, Ukraine", "speaker": "Dmytro Gorodnitskiy", "title": "Lviv Kotlin User Group", "subject": "Android navigation components: як не заблукати серед трьох сосен", "url": "https://www.meetup.com/Lviv-Kotlin-User-Group/events/259467289/"}, {"lang": "uk", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Lviv, Ukraine", "speaker": "Rostyslav Lesovyi", "title": "Lviv Kotlin User Group", "subject": "Kotlin Coroutines In-depth", "url": "https://www.meetup.com/Lviv-Kotlin-User-Group/events/259467289/"}, {"lang": "en", "startDate": "2019-04-11", "endDate": "2019-04-11", "location": "Dnipro, Ukraine", "speaker": "Anna Shkabara", "title": "Kotlin Dnipro", "subject": "A short story about Android BLE", "url": "https://www.meetup.com/Kotlin-Dnipro/events/259955166/"}, {"lang": "en", "startDate": "2019-04-11", "endDate": "2019-04-11", "location": "Dnipro, Ukraine", "speaker": "Eugene Surkov", "title": "Kotlin Dnipro", "subject": "Coroutines - just do it", "url": "https://www.meetup.com/Kotlin-Dnipro/events/259955166/"}, {"lang": "pl", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "Warsaw, Poland", "speaker": "Marcin Moskała", "title": "Kotlin Night Warsaw", "subject": "Understanding Kotlin Coroutines", "url": "https://www.meetup.com/Kotlin-Warsaw-by-Kt-Academy/events/258459508/", "content": {"video": "https://www.youtube.com/watch?v=DOoJnJJnAG4&feature=youtu.be"}, "description": "<p>Kotlin Coroutines is a powerful tool. Well implemented concept of suspendable computation... It is a dream of many theoretics of concurrent programming for a long time. But how it is possible? How do Kotlin coroutines really work? Why are they important? What do they introduce? And finally, how you can use them in your project?</p>\n<p>In this talk, I will show you how to use Kotlin Coroutines and what makes them so special and so efficient. I will also discuss if they are an alternative to RxJava.</p>"}, {"lang": "en", "startDate": "2019-03-25", "endDate": "2019-03-25", "location": "Toronto, Canada", "speaker": "Arturo Mejia", "title": "Kotlin Toronto", "subject": "A gentle introduction to Kotlin Coroutines", "url": "https://www.meetup.com/Kotlin-Toronto/events/259760993/", "description": "<p>In this talk, we're are going to introduce the concept of Kotlin Coroutines in an easy and simple way.\nWe are going to talk about its core concepts, what's makes them special, how you can use and test them,\nand finally how they are different from other alternatives like Rx.</p>"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Munich, Germany", "speaker": "Yahor Berdnikov", "title": "Kotlin User Group Munich", "subject": "First stable release of CoRedux. What is change since previous talk and how it look now?", "url": "https://www.meetup.com/Kotlin-User-Group-Munich/events/259525671/"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Munich, Germany", "speaker": "Danny Preusler", "title": "Kotlin User Group Munich", "subject": "Lightning Talk about Property Delegates", "url": "https://www.meetup.com/Kotlin-User-Group-Munich/events/259525671/"}, {"lang": "en", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Munich, Germany", "speaker": "Ilya Chernikov", "title": "Kotlin User Group Munich", "subject": "Kotlin Scripting. Using Kotlin as a scripting language", "url": "https://www.meetup.com/Kotlin-User-Group-Munich/events/259525671/"}, {"lang": "en", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Amsterdam, The Netherlands", "speaker": "Alfred Foltin", "title": "Kotlin.amsterdam", "subject": "Hacking with Kotlin", "url": "https://www.meetup.com/kotlin-amsterdam/events/259771811/", "description": "<p>Have a Kotlin project you want to show? Just getting started with Kotlin and need some help? Interested in some Kotlin hacks? This evening is for you.</p>"}, {"lang": "en", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Ondo, Nigeria", "speaker": "Akinrolie Shola Slick", "title": "Kotlin Ondo User Group", "subject": "Kotlin Webinar Ondo", "url": "https://www.meetup.com/Kotlin-Ondo-User-Group/events/259292075/", "description": "<p>Experience the power of the fastest growing language in the world. Learn mobile development with ease and get resources, tools, and latest updates on Kotlin and more.</p>"}, {"lang": "de", "startDate": "2019-04-02", "endDate": "2019-04-02", "location": "Kassel, Germany", "speaker": "Nils Schmidt", "title": "Kassel Kotlin User Group", "subject": "Einführung in Kotlin", "url": "https://www.meetup.com/Kassel-Kotlin-User-Group/events/259755584/"}, {"lang": "en", "startDate": "2019-04-03", "endDate": "2019-04-03", "location": "Chicago, USA", "speaker": "Ryan Perkins", "title": "Chicago Kotlin Users Group", "subject": "Kotlin Multiplatform", "url": "https://www.meetup.com/Chicago-Kotlin/events/259929789/", "description": "<p>This talk will discuss what multi-platform and native Kotlin is, how organizations and teams can utilize it in their projects, and the advantages and disadvantages of adopting it.</p>"}, {"lang": "en", "startDate": "2019-04-03", "endDate": "2019-04-03", "location": "Karlsruhe, Germany", "speaker": "Falk Appel", "title": "Kotlin Karlsruhe User Group", "subject": "Build your own Kotlin Dependency Injection", "url": "https://www.meetup.com/Kotlin-Karlsruhe-User-Group/events/259757223/"}, {"lang": "ru", "startDate": "2019-04-23", "endDate": "2019-04-23", "location": "Moscow, Russia", "speaker": "Andrey Govorovsky", "title": "Apps Conf 2019", "subject": "Model Driven-конфигурация приложения на Kotlin DSL", "url": "http://appsconf.ru/moscow/2019/abstracts/5058", "description": "<p>Трудно представить современное мобильное приложение без удаленной конфигурации - A/B-тесты, запуск новых фич, замена строк, графических ресурсов.</p>\n<p>В ходе доклада мы рассмотрим как создать DSL на Kotlin для описания конфигурации приложения и как из него сгенерировать парсеры с валидацией, документацию и настройки разработчика.</p>"}, {"lang": "sk", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Bratislava, Slovakia", "speaker": "Rainer Kern", "title": "GDG Bratislava", "subject": "Coroutines in Kotlin 1.3 & Assisted ViewModel Injection", "url": "https://www.meetup.com/GDG-Bratislava/events/259866663/", "description": "<p>Prezentácie si pre vás pripravili softvérový architekt a Kotlinový nadšenec Rainer Kern a šéf Android developerov v Sygicu Miroslav Kacera.</p>"}, {"lang": "fr", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Paris, France", "speaker": "Cyril Findeling", "title": "Kotlin Paris Meetup", "subject": "Découvrir Kotlin avec des mini-jeux Android", "url": "https://www.meetup.com/Kotlin-Paris-Meetup/events/259473328/"}, {"lang": "fr", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Paris, France", "speaker": "Robin Penea", "title": "Kotlin Paris Meetup", "subject": "De Java à Kotlin: L'histoire d'une migration Android", "url": "https://www.meetup.com/Kotlin-Paris-Meetup/events/259473328/"}, {"lang": "fr", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Paris, France", "speaker": "Salomon Brys", "title": "Kotlin Paris Meetup", "subject": "Kotlin Puzzlers", "url": "https://www.meetup.com/Kotlin-Paris-Meetup/events/259473328/"}, {"lang": "en", "startDate": "2019-04-02", "endDate": "2019-04-02", "location": "San Francisco, CA, USA", "speaker": "Jag Saund", "title": "The San Francisco Android GDG", "subject": "Kotlin Coroutines and Channels: From 0 to 100", "url": "https://www.meetup.com/sfandroid/events/259585686/", "description": "<p>We all know multithreaded application development can make you 🤔😡. Chasing down deadlocks and race conditions can keep you up at night. But Kotlin introduces another way to tackle the problem. This talk introduces the fundamentals of both Coroutines and Channels with a simple Coffee Shop analogy. It'll take you from the foundation to a few different approaches on solving common problems. See how you can add Coroutines and Channels to your toolbox of asynchronous programming.</p>"}, {"lang": "en", "startDate": "2019-04-02", "endDate": "2019-04-02", "location": "Portland, OR, USA", "speaker": "Sean Massie", "title": "Kotlin Portland User Group", "subject": "Kotlin, standing on the shoulders of Giants.", "url": "https://www.meetup.com/Kotlin-Portland-User-Group/events/ttbqjqyzgbdb/", "description": "<p>This talk will be a discussion on the wonders of Java and what Kotlin has done to build on them.</p>"}, {"lang": "en", "startDate": "2019-04-04", "endDate": "2019-04-04", "location": "Austin, TX, USA", "speaker": "Lauren Yew", "title": "Google Developer Group Austin", "subject": "Threading Made Easy! A Busy Developer’s Guide to Kotlin Coroutines", "url": "https://www.meetup.com/gdgaustin/events/259531184/", "description": "<p>- What coroutines are and how they function\n- How to use them (with real world examples and demos)\n- Where and why you should use coroutines in your app\n- How to avoid pitfalls of coroutines\n- How they compare to other threading solutions like callbacks and RxJava</p>"}, {"lang": "en", "startDate": "2019-04-12", "endDate": "2019-04-12", "location": "Pisa, Italy", "speaker": "Daniele Campogiani, Giovanni Catania", "title": "GDG DevFest Pisa 2019", "subject": "Functional Validation with Arrow and Bow", "url": "https://devfest.gdgpisa.it/schedule/2019-04-13?sessionId=205", "description": "<p>An introduction to some data types of Arrow and Bow: we will use them to validate a form in an application. Code samples will be in Kotlin and Swift</p>"}, {"lang": "en", "startDate": "2019-04-03", "endDate": "2019-04-03", "location": "San Diego, CA", "speaker": "Ian Brandt", "title": "San Diego Kotlin User Group", "subject": "Monthly Kotlin!", "url": "https://www.meetup.com/sd-kotlin/events/hxkqbqyzgbfb/"}, {"lang": "en", "startDate": "2019-04-04", "endDate": "2019-04-04", "location": "Lausanne, Switzerland", "speaker": "Jonas Schmid", "title": "Mobile Romandie Beer", "subject": "Kotlin for Swift developers", "url": "https://www.meetup.com/Mobile-Romandie-Beer/events/258869460/", "description": "<p>Swift and Kotlin have a lot of concepts in common but they also have a few notable differences. Knowing both languages can help you write better code and share ideas between developers of “the other platform”.\n> We will cover the basics of Kotlin before converting a Swift app into a Kotlin one. We will use concepts such as sealed classes, extensions and of course coroutines to make our code more robust and readable.</p>"}, {"lang": "en", "startDate": "2019-04-04", "endDate": "2019-04-04", "location": "London, UK", "speaker": "Nazarii Ivanchuk", "title": "Kotlin London", "subject": "Suspending functions, coroutines and state machines", "url": "https://www.meetup.com/kotlin-london/events/259735082/", "description": "<p>Suspending functions, coroutines and state machines Explore. How Kotlin coroutine works under the hood. Introduction into the dark arts of the coroutines transformation during compilation.</p>"}, {"lang": "en", "startDate": "2019-04-04", "endDate": "2019-04-04", "location": "London, UK", "speaker": "Pablisco", "title": "Kotlin London", "subject": "A null hypothesis", "url": "https://www.meetup.com/kotlin-london/events/259735082/", "description": "<p>We are going to explore how we use nullable types in Kotlin — going through the benefits, caveats and alternatives that can make or break our code. What can we do to make our code more readable, maintainable and less error bound? What should we avoid? It may contain traces of opinions.</p>"}, {"lang": "fr", "startDate": "2019-04-09", "endDate": "2019-04-09", "location": "Lyon, France", "speaker": "Martial Maillot", "title": "Lyon Kotlin User Group", "subject": "La programmation orienté objet en Kotlin", "url": "https://www.meetup.com/Lyon-Kotlin-User-Group/events/rrxsqqyzgbmb/", "description": "<p>20 minutes en livecoding pour découvrir les listes.</p>"}, {"lang": "en", "startDate": "2019-04-10", "endDate": "2019-04-10", "location": "St.Petersburg, Russia", "speaker": "Hadi Hariri", "title": "St. Petersburg Kotlin User Group", "subject": "Introduction to Ktor for server-side development", "url": "https://www.meetup.com/St-Petersburg-Kotlin-User-Group/events/260173917/", "description": "<p>Ktor is an asynchronous web framework built from the the ground up using Kotlin and coroutines. It provides developers the ability to create both server and client applications targeting a variety of platforms including JVM, JavaScript and macOS, Windows and Linux via Kotlin/Native. In this talk we’re going to focus primarily on Ktor as a server application, see how simple it is to create asynchronous and robust server side applications, deployment models, features it provides out of the box, its extensibility model, and how it’s different to some of the other existing solutions on the market</p>"}, {"lang": "en", "startDate": "2019-03-22", "endDate": "2019-03-22", "location": "Bucharest, Romania", "speaker": "Ionut Balosin", "title": "Voxxed Days Bucharest 2019", "subject": "Desugaring Kotlin features and their performance impact", "url": "https://romania.voxxeddays.com/2019/02/03/desugaring-kotlin-features-and-their-performance-impact/", "description": "<p>In this presentation I will try to demystify a few Kotlin language features and to present how they are compiled\ninto the bytecode in order to have a better understanding about what happens under the hood.</p>"}, {"lang": "en", "startDate": "2019-03-07", "endDate": "2019-03-07", "location": "Rochester, NY", "speaker": "George Adams, Stephen Byrne", "title": "Kotlin Night Rochester", "subject": "Kotlin - A brief introduction to the language.", "url": "https://www.meetup.com/RocDev/events/258581233/", "description": "<p>We will cover enough of the structure andsyntax that hopefully everybody will be able to follow along for the rest of the evening.</p>"}, {"lang": "en", "startDate": "2019-03-07", "endDate": "2019-03-07", "location": "Rochester, NY", "speaker": "George Adams, Stephen Byrne", "title": "Kotlin Night Rochester", "subject": "Web Services - Comparison of the leading Kotlin-based web frameworks - Ktor andJavalin", "url": "https://www.meetup.com/RocDev/events/258581233/"}, {"lang": "en", "startDate": "2019-03-07", "endDate": "2019-03-07", "location": "Rochester, NY", "speaker": "George Adams, Stephen Byrne", "title": "Kotlin Night Rochester", "subject": "Desktop GUIs", "url": "https://www.meetup.com/RocDev/events/258581233/", "description": "<p>TornadoFX, a JavaFX framework for Kotlin that uses type-safe buildersto make building views easy and readable.</p>"}, {"lang": "en", "startDate": "2019-03-07", "endDate": "2019-03-07", "location": "Rochester, NY", "speaker": "George Adams, Stephen Byrne", "title": "Kotlin Night Rochester", "subject": "Coroutines - Asynchronous programming without expensive threads and context switches.", "url": "https://www.meetup.com/RocDev/events/258581233/"}, {"lang": "en", "startDate": "2019-03-06", "endDate": "2019-03-06", "location": "Atlanta, USA", "speaker": "Venkat Subramaniam, Josh Long", "title": "DevNexus 2019", "subject": "Kotlin jumpstart with Venkat and Josh, part 1", "url": "https://devnexus.com/presentations/3545/", "description": "<p>A two hour, live-coded, presentation on getting you on the road to Kotlin with Josh Long and Venkat S!</p>"}, {"lang": "en", "startDate": "2019-03-06", "endDate": "2019-03-06", "location": "Atlanta, USA", "speaker": "Dev Gupta", "title": "DevNexus 2019", "subject": "Spring Boot and Kotlin", "url": "https://devnexus.com/presentations/3211/", "description": "<p>Let’s showcase how Kotlin makes Java developers lives easier in Spring Boot</p>"}, {"lang": "en", "startDate": "2019-03-06", "endDate": "2019-03-06", "location": "Atlanta, USA", "speaker": "Venkat Subramaniam", "title": "DevNexus 2019", "subject": "Developing Micronaut Applications with Kotlin", "url": "https://devnexus.com/presentations/3509/", "description": "<p>If you’re developing with Kotlin or getting started with the language, come to this talk to find out how to program your Micronaut application with Kotlin. Kotlin brings a variety of interesting features for fluency, type safety, and asynchronous programming. Learn how to leverage those capacities of the language in the context of Micronaut.</p>"}, {"lang": "pl", "startDate": "2019-03-16", "endDate": "2019-03-16", "location": "Gdansk,Poland", "speaker": "Pavel Vlodarskiy", "title": "SegFault University", "subject": "Kotlin plus Spring minus Adnotacje", "url": "http://segfault.events/sites/gdansk2019/abstracts/kotlin-spring/", "description": "<p>Spring 5 dostał natywne wsparcie dla Kotlina z wygodnym DSLem i wygląda na to, że już po ludzku można ogarnąć konfigurację w trakcie kompilacji bez żadnych adnotacji, dziwnych CGlib proxy i majstrowania w runtime.</p>"}, {"lang": "pl", "startDate": "2019-03-14", "endDate": "2019-03-14", "location": "Gdansk,Poland", "speaker": "Marcin Moskala", "title": "SegFault University", "subject": "Kotlin for Java developers", "url": "http://segfault.events/sites/gdansk2019/abstracts/kotlin-for-java-developers/", "description": "<p>What’s all the fuss about Kotlin? On this workshop, you will discover it yourself. It will cover the most important Kotlin features. Show null-safety, extension functions and why collection processing in Kotlin is so good.</p>"}, {"lang": "en", "startDate": "2019-03-22", "endDate": "2019-03-22", "location": "Bucharest, Romania", "speaker": "Dmitry Kandalov", "title": "Voxxed Days Bucharest 2019", "subject": "Live Coding Kotlin/Native Snake", "url": "https://romania.voxxeddays.com/2019/02/26/live-coding-kotlin-native-snake/", "description": "<p>Dmitry Kandalov has been programming and trying to get better at it since DOS times. The last 10 years or so he spent in Java and JVM languages land, most recently focusing on Kotlin.</p>"}, {"lang": "en", "startDate": "2019-03-29", "endDate": "2019-03-29", "location": "Bucharest, Romania", "speaker": "Victor Rentea", "title": "Kotlin Kindergarten", "subject": "Kotlin Kindergarten ep #02", "url": "https://eventil.com/events/kotlin-kindergarten-ep-02", "description": "<p>Sick of Java? Let’s try Kotlin : probably the next de-facto standard for Android apps, and a cool compact language to write your JUnit tests in.</p>"}, {"lang": "en", "startDate": "2019-03-11", "endDate": "2019-03-11", "location": "Hamburg, Germany", "speaker": "Mathias Düsterhöft", "title": "Serverless Hamburg", "subject": "Fighting cold startup issues for your Kotlin Lambda with GraalVM", "url": "https://www.meetup.com/Serverless-Hamburg/events/258959816/", "description": "<p>how we can fight cold startup times for Kotlin or Java functions on AWS Lambda using GraalVM and the AWS newly announced Custom Lambda Runtimes.</p>"}, {"lang": "en", "startDate": "2019-03-12", "endDate": "2019-03-12", "location": "Chicago, USA", "speaker": "Mathias Düsterhöft", "title": "Chicago Kotlin User Group", "subject": "Building and Using Kotlin DSL's", "url": "https://www.meetup.com/Chicago-Kotlin/events/259395990/", "description": "<p>Join us as we hear from two of our regular attendees, John Burns and Jonathan Bisson as they speak about building and utilizing Domain Specific Languages (DSLs for short) in Kotlin. Domain specific languages are subsets of functions in a programming language designed specifically to ease development and communicate intention more effectively within a particular problem-space.</p>\n<p>John Burns will kick things off around 6pm by examining how Kotlin's language features enable us to construct a DSL for building static websites.</p>\n<p>Jonathan Bisson will follow up speaking about how he utilizes Kotlin in his daily professional life and he will explore some of the applications he has built, some of the libraries used (SpringBoot, TornadoFX) and the science surrounding them.</p>"}, {"lang": "en", "startDate": "2019-03-13", "endDate": "2019-03-13", "location": "Kitchener, Canada", "speaker": "Ersin Ertan", "title": "Kotlin Waterloo P2P", "subject": "Kotlin coroutines", "url": "https://www.meetup.com/Kotlin-Waterloo-P2P/events/259552403/", "description": "<p>Coroutines have large benefits over the regular threading model of Java. Most threads wait on IO 99% of the time and coroutines make use of this time to perform real work. Scalability is dramatically increased and memory consumption is reduced.</p>"}, {"lang": "en", "startDate": "2019-03-22", "endDate": "2019-03-22", "location": "Bucharest, Romania", "speaker": "Ionut Balosin", "title": "Voxxed Days Bucharest 2019", "subject": "Desugaring Kotlin features and their performance impact", "url": "https://romania.voxxeddays.com/2019/02/03/desugaring-kotlin-features-and-their-performance-impact/", "description": "<p>In this presentation I will try to demystify few Kotlin language features and to present how they are compiled into the bytecode in order to have a better understanding about what happens under the hood.</p>"}, {"lang": "en", "startDate": "2019-03-30", "endDate": "2019-03-30", "location": "Madrid, Spain", "speaker": "Mercedes Wyss", "title": "GreachConf", "subject": "Kotlin & Implications in an IoT project", "url": "https://agenda.greachconf.com/talk/kotlin-implications-in-an-iot-project", "description": "<p>Develop IoT solutions with Kotlin is possible thanks to the incorporation to Kotlin as a first class programming language to Android and the becoming of Android Things, an optimized version of Android for embedded devices. This talk is looking for explore the aspects around IoT projects, Hardware, Security, Server Side, Data Analysis from the hand of Android Things and Kotlin.</p>\n<p>The Internet of Things is a technology that has been echoing for some time. Arriving to generate interesting and attractive solutions. It usually happens that those who develop this type of solutions know about the Hardware, or they only have knowledge of the Software side. This talk seeks to explore all those aspects around IoT in the hand of a real project for monitoring fishbowls (something that you can implement at home).</p>\n<p>In the hardware side, we will use sensors and different technologies for handle the information obtained from these (Raspberry PI, Arduino, etc). Since we want to show how to use Kotlin for develop IoT solutions, we will use Android Things with Kotlin and Raspberry PI.</p>\n<p>The server side, using Serverless or IoT cloud solutions, options to analyze our information. Finally, is important take some considerations over the security aspects in IoT projects, although there are not yet 100% solid solutions, there are already efforts to solve this.</p>"}, {"lang": "en", "startDate": "2019-03-05", "endDate": "2019-03-05", "location": "Portland, OR, USA", "speaker": "Josh Owens", "title": "Kotlin Portland User Group", "subject": "Our first kotlin android app", "url": "https://www.meetup.com/Kotlin-Portland-User-Group/events/ttbqjqyzfbhb/", "description": "<p>A look at how two Kroger apprentices built an internal app to facilitate regression testing on Android devices using deep links, Kotlin, MVVM patterns, and a node middleware server built with Koa. They will cover tools they found, UI patterns, and the learning experience behind building your first Android app.</p>"}, {"lang": "es", "startDate": "2019-03-14", "endDate": "2019-03-14", "location": "Guadalajara, Mexico", "speaker": "Vicente Martínez", "title": "Guadalajara Hack Nights", "subject": "Room for Android in Kotlin", "url": "https://www.meetup.com/Guadalajara-Hack-Nights/events/259095605/", "description": "<p>Room is a persistence library that provides a level of abstraction over SQLite. It has many advantages over traditional ORM's and we will be learning a proper use of it by creating a simple app that remind us when and how much to pay for our credit cards. We will be talking about some of the common designs to create relationships using DAOS in Room and accessing Live Data. Also, we will be discovering some hot topics using Kotlin for Android</p>"}, {"lang": "en", "startDate": "2019-03-19", "endDate": "2019-03-19", "location": "Santa Cruz, CA", "speaker": "John Kaster", "title": "Santa Cruz Kotlin User Group", "subject": "Kotlin-related talk TBD", "url": "https://www.meetup.com/Santa-Cruz-Kotlin-User-Group/events/pbbvjqyzfbzb/"}, {"lang": "en", "startDate": "2019-03-19", "endDate": "2019-03-19", "location": "Addison, TX", "speaker": "Chris Koeberle", "title": "Kotlin DFW", "subject": "Kotlin Code Generation with KotlinPoet", "url": "https://www.meetup.com/Kotlin-DFW/events/258830399/", "description": "<p>This talk will cover Kotlin code generation with KotlinPoet. KotlinPoet is a Kotlin (and Java) API for generating kotlin source files.</p>\nSometimes a task is repetitive enough that it seems like you shouldn’t actually have to do it, but not so repetitive that you can just tell the IDE to handle it. KotlinPoet will help you generate Kotlin code, whether in an annotation processor, in a local script, or even to share a common definition between server and client. We’ll look at how it works, and some tips and tricks for solving common problems with it!</p>"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "San Francisco, CA, USA", "speaker": "Valeriy Ovechkin", "title": "San Francisco Kotlin Meetup", "subject": "How Caviar migrated their Android app from Java to 100% Kotlin", "url": "https://www.meetup.com/San-Francisco-Kotlin-Meetup/events/259407623/"}, {"lang": "en", "startDate": "2019-03-21", "endDate": "2019-03-21", "location": "San Francisco, CA, USA", "speaker": "Panel Discussion", "title": "San Francisco Kotlin Meetup", "subject": "Migrating Code & Teams to Kotlin", "url": "https://www.meetup.com/San-Francisco-Kotlin-Meetup/events/259407623/"}, {"lang": "ko", "startDate": "2019-04-08", "endDate": "2019-04-08", "location": "Seoul, Korea", "speaker": "KJ Jeon", "title": "Kotlin Night Seoul", "subject": "Effective Java and Kotlin", "url": "https://www.meetup.com/kotlinkr/events/259457837/", "description": "<p>The book, 'Effective Java' introduces guidelines for implementing efficient and well-designed Java programs.\nKotlin has a design that can be applied to these guidelines. The Kotlin Reference document cites this book to support the explanation.\nIn this session, we will go over the rules of the 'Effective Java' and share how it is reflected in Kotlin or how it can be applied.</p>"}, {"lang": "ko", "startDate": "2019-04-08", "endDate": "2019-04-08", "location": "Seoul, Korea", "speaker": "SH Lee", "title": "Kotlin Night Seoul", "subject": "Create elegant code using Kotlin", "url": "https://www.meetup.com/kotlinkr/events/259457837/", "description": "<p>Introduction to how to make code elegant by using high order function, extension function, function literals with receivers, DSL etc. showing example of Kotlin code actually applied to FLO.</p>"}, {"lang": "ko", "startDate": "2019-04-08", "endDate": "2019-04-08", "location": "Seoul, Korea", "speaker": "HS Kang", "title": "Kotlin Night Seoul", "subject": "Why Kotin? - from Java developer's point of view", "url": "https://www.meetup.com/kotlinkr/events/259457837/", "description": "<p>We will share you why Java developers feel inconvenienced while using Java by comparing the Java example code with the Kotlin example code, introducing the merits and why the Java developers should change the project to Kotlin.</p>"}, {"lang": "ko", "startDate": "2019-04-08", "endDate": "2019-04-08", "location": "Seoul, Korea", "speaker": "JW Heo", "title": "Kotlin Night Seoul", "subject": "Kotlin + AWS Lambda and API Gateway", "url": "https://www.meetup.com/kotlinkr/events/259457837/", "description": "<p>Create and deploy a simple API using Kotlin and the AWS SAM (serverless application model). The script to build and distribute is also written in Kotlin (Gradle + Kotlin DSL).</p>"}, {"lang": "en", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "London, UK", "speaker": "Dmitry Kandalov", "title": "Kotlin London", "subject": "Live coding algorithms", "url": "https://www.meetup.com/kotlin-london/events/258399375/", "description": "<p>This is live coding session in Kotlin with TDD which will cover binary search, merge sort and heap/quick sort. Although these algorithms might seem simple, there are a few subtleties related to the algorithms and their implementation on\nJVM.</p>\n<p>The session assumes that you're already familiar with the algorithms to some extent.</p>"}, {"lang": "en", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "London, UK", "speaker": "Guillermo Orellana", "title": "Kotlin London", "subject": "Kotlin Multiplatform", "url": "https://www.meetup.com/kotlin-london/events/258399375/", "description": "<p>Nowadays Kotlin is more than a JVM language - it allows you to target so many more different platforms.\n<p>In this talk we'll explore how Kotlin powers the creation of a web app that served as an introduction to full stack engineering for somebody with an Android background.</p>\n<p>We will explore pros, cons and pitfalls and have fun deploying to the could!</p>"}, {"lang": "es", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "Guadalajara, Mexico", "speaker": "Ignacio Arces", "title": "Guadalajara Kotlin User Group", "subject": "Painless Dependency InjeKtion", "url": "https://www.meetup.com/Kotlin-User-Group-GDL/events/258772840/", "description": "<p>Hablaremos de la importancia de DI para crear código modular y altamente testeable. Diferentes tipos de DI con PROs/CONs y daremos un vistazo a las diferentes opciones disponibles para implementar DI con Kotlin; desde las librerías tradicionales de Java como Spring y Guice hasta las opciones 100% Kotlin como KoDeIn e Insert-Koin</p>"}, {"lang": "es", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "Guadalajara, Mexico", "speaker": "David Cordova", "title": "Guadalajara Kotlin User Group", "subject": "The Strategy and Komposition", "url": "https://www.meetup.com/Kotlin-User-Group-GDL/events/258772840/", "description": "<p>Muchas buenas practicas vienen incluidas en Kotlin por la misma forma en que esta diseñado el lenguaje y una de ellas es el favorecer la composicion de clases. Hablaremos de porque es ventajoso tener esto sobre la herencia y como podemos implementar el patron de Strategy en nuestros proyectos.</p>"}, {"lang": "en", "startDate": "2019-02-13", "endDate": "2019-02-13", "location": "New York, NY, USA", "speaker": "Zachary Smith", "title": "New York Kotlin Meetup", "subject": "Intro to Web Dev with Kotlin", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/258684498/", "description": "<p>With front-end web apps becoming larger and more complex, and Node.js allowing Javascript to be used on the server side, the language has had a rapid rise in popularity. But for many JVM/Android developers, the thought of getting into front end web development and the Javascript ecosystem can seem quite unpleasant. However with Kotlin's ability to target JS, we can leverage the language features we've come to love, to make the experience a bit more fun. In this talk, we'll explore how we can build a Kotlin front-end application and even use Kotlin to interact with Node.js on the server.</p>"}, {"lang": "en", "startDate": "2019-02-13", "endDate": "2019-02-13", "location": "New York, NY, USA", "speaker": "Brian Plummer", "title": "New York Kotlin Meetup", "subject": "Moshi: Kotlin Codegen", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/258684498/", "description": "<p>Learn how to leverage Moshi’s Kotlin codegen so your data model can be immutable and quickly parsed reflection free. I’ll discuss why this is important to us as developers, integration details, and how Moshi implemented this feature!</p>"}, {"lang": "en", "startDate": "2019-02-14", "endDate": "2019-02-14", "location": "Cambridge, MA", "speaker": "Constantine Bialik", "title": "Kotlin Office Hours", "subject": "Kotlin-DSL for Gradle: How to convert Gradle scripts to Kotlin", "url": "https://www.meetup.com/kotlin-office-hours/events/258798239/", "description": "<p>Now it's more then a year since Gradle officially supports Kotlin-DSL to define projects. This (and JetBrain’s effort to support of Kotlin-Native) allows to develop most of the projects COMPLETELY in Kotlin including server side, client side, native/mobile application and build/test scripts.</p>\n<p>However most project generating tools still create Gradle scripts in Groovy only. Even IntelliJ IDEA creates Kotlin projects with Groovy script for Gradle.</p>\n<p>Now is the perfect time for this presentation to demonstrate how easy it is to convert Groovy script for Gradle to Kotlin-DSL script for Gradle.</p>"}, {"lang": "de", "startDate": "2019-02-18", "endDate": "2019-02-18", "location": "Villach, Austria", "speaker": "Lorenz Schmoliner", "title": "Developer Meetup Kärnten", "subject": "Quick Intro zu Kotlin Native", "url": "https://www.meetup.com/devmeetupk/events/258826490/", "description": "<p>Kotlin Native ermöglicht es euch Kotlin Code zu schreiben und diesen dann zu nativem plattform-spezifischen Code zu kompilieren. Unterstützte Zielplattformen sind unter anderem iOS und Android. Lorenz wird euch in einem Intro zeigen, was man sich darunter vorstellen kann.</p>"}, {"lang": "pl", "startDate": "2019-02-21", "endDate": "2019-02-21", "location": "Kielce, Poland", "speaker": "Krzysztof Korbacz, Paweł Pyzik", "title": "Kielce Java User Group", "subject": "Kotlin na backendzie", "url": "https://www.meetup.com/Kielce-Java-User-Group/events/258820631/", "description": "<p>Zastanawialiście się ostatnio czy ten nowy projekt backendowy jest dobrym miejscem by spróbować Kotlina (i nie chodzi nam o ketchup)?</p>\n<p>Ale wszystko co wiecie na temat Kotlina to wiedza pozyskana z kilku prezentacji lub blog postów, które mówią jak młodzieżowy jest to język?</p>\n<p>Może dobrym pomysłem byłoby zapytać kogoś kto tego spróbował na własnej skórze? I oto jesteśmy my by opowiedzieć Wam naszą historię transformacji z Java Backend do Java/Kotlin Backend developerów.</p>\n<p>Opowiemy Wam jakie Kotlin kryje w sobie pułapki, które ficzery Kotlina podobają nam się najbardziej. Przeprowadzimy Was przez recepty, które zebraliśmy w trakcie prac nad naszym ostatnim projektem.</p>\n<p>A jako wisienka na torcie: powiemy Wam czy wybralibyśmy Kotlina ponownie dysponując wiedzą, którą dysponujemy\ndzisiaj.</p>"}, {"lang": "pt", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Lisbon, Portugal", "speaker": "Ricardo Caetano, Pedro Alves", "title": "Kotlin Lisboa", "subject": "Boas vindas", "url": "https://www.meetup.com/kotlin-lisboa/events/258269613/"}, {"lang": "pt", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Lisbon, Portugal", "speaker": "Pedro Alves", "title": "Kotlin Lisboa", "subject": "Porque escolhi Kotlin para ensinar programação", "url": "https://www.meetup.com/kotlin-lisboa/events/258269613/"}, {"lang": "pt", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Lisbon, Portugal", "speaker": "Fábio Rito", "title": "Kotlin Lisboa", "subject": "Lightweightform - Utilização prática da linguagem em contexto multiplataforma para validar dados no\n            Frontend e Backend", "url": "https://www.meetup.com/kotlin-lisboa/events/258269613/"}, {"lang": "en", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Stuttgart, Germany", "speaker": "Alex Koufatzis", "title": "Kotlin User Group Stuttgart", "subject": "Kotlin Coroutines", "url": "https://www.meetup.com/Kotlin-User-Group-Stuttgart/events/257953412/"}, {"lang": "en", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Stuttgart, Germany", "speaker": "Giso Bartels", "title": "Kotlin User Group Stuttgart", "subject": "Model-View-Intent with Kotlin", "url": "https://www.meetup.com/Kotlin-User-Group-Stuttgart/events/257953412/"}, {"lang": "es", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "Madrid, Spain", "speaker": "Alonso Torres", "title": "Madrid GUG", "subject": "Kotlin para Grooviers", "url": "https://www.meetup.com/madrid-gug/events/258091440/", "description": "<p>Google lo soporta como lenguaje de primer nivel para Android, muchas bibliotecas le dan soporte al primer nivel e incluso nuestro querido Gradle lo va a usar para implementar su DSL alternativa./p>\n<p>No es ningún secreto que Jetbrains, los creadores del lenguaje, se inspiraron muchísimo en Groovy. Eso nos coloca a los programadores de Groovy en un punto ideal porque con poco esfuerzo podemos aprender este nuevo lenguaje trayéndonos mucha experiencia./p>\n<p>En esta charla voy a hacer un recorrido por algunas de las principales características del lenguaje y ponerlas frente a frente con Groovy. Veremos ventajas e inconvenientes de las dos aproximaciones y espero que salgáis con bastante ideas de cómo es el lenguaje.</p>"}, {"lang": "ru", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "Lviv, Ukraine", "speaker": "Vyacheslav Koldovskyy", "title": "Kotlin Lviv User Group", "subject": "Kotlin & Google cloud platform", "url": "https://dou.ua/calendar/25485/?from=tw"}, {"lang": "ru", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "Lviv, Ukraine", "speaker": "Sergey Zolotov", "title": "Kotlin Lviv User Group", "subject": "Coroutines on Server side", "url": "https://dou.ua/calendar/25485/?from=tw"}, {"lang": "en", "startDate": "2019-05-27", "endDate": "2019-05-27", "location": "Barcelona, Spain", "speaker": "Mercedes Wyss", "title": "JBCNConf", "subject": "Kotlin & Implications in an IoT project", "url": "http://www.jbcnconf.com/2019/infoTalk.html?id=5c196e3638da165f64820b2d", "description": "<p>Develop IoT solutions with Kotlin is possible thanks to the incorporation to Kotlin as a first class programming language to Android and the becoming of Android Things, an optimized version of Android for embedded devices. This talk is looking for explore the aspects around IoT projects, Hardware, Security, Server Side, Data Analysis from the hand of Android Things and Kotlin. The Internet of Things is a technology that has been echoing for some time. Arriving to generate interesting and attractive solutions. It usually happens that those who develop this type of solutions know about the Hardware, or they only have knowledge of the Software side. This talk seeks to explore all those aspects around IoT in the hand of a real project for monitoring fishbowls (something that you can implement at home). In the hardware side, we will use sensors and different technologies for handle the information obtained from these (Raspberry PI, Arduino, etc). Since we want to show how to use Kotlin for develop IoT solutions, we will use Android Things with Kotlin and Raspberry PI. The server side, using Serverless or IoT cloud solutions, options to analyze our information. Finally, is important take some considerations over the security aspects in IoT projects, although there are not yet 100% solid solutions, there are already efforts to solve this.</p>"}, {"lang": "en", "startDate": "2019-05-27", "endDate": "2019-05-27", "location": "Barcelona, Spain", "speaker": "Paulien van Alst, Brian Vermeer", "title": "JBCNConf", "subject": "My Kotlin is better than your Java!", "url": "http://www.jbcnconf.com/2019/infoTalk.html?id=5c48ec449034ae38180b14dd", "description": "<p>TLDR: The big discussion: Kotlin or Java, to migrate or not to migrate and why... The world of languages on the JVM has seen alternatives to Java come and go. Kotlin is probably the most popular one at this moment. Although Java is still one of the most commonly used programming languages, Kotlin seems to keep growing very fast. Where Java is known for its verbosity, Kotlin aims at making programming easier. On the other hand, Kotlin is a mix of paradigms and forces you to learn yet another language. Moreover, with all the new features that are rapidly introduced in Java, is Kotlin actually needed? So what are the aspects where they differ from each other? In which situations should we choose the one or the other? Should we migrate to Kotlin or is Java good enough? As Kotlin claims full interoperability with Java, should we even choose? In this talk we will fire up the battle between Kotlin and Java. In this battle one of us will root for Java while the other cheers for Kotlin. Who wins? That is totally up to you. The audience will be judge and jury. So...bring it on.</p>"}, {"lang": "es", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Madrid, Spain", "speaker": "Antonio Leiva", "title": "GreachConf", "subject": "Kotlin Workshop", "url": "https://agenda.greachconf.com/talk/kotlin-workshop"}, {"lang": "en", "startDate": "2019-03-29", "endDate": "2019-03-29", "location": "Madrid, Spain", "speaker": "Nicolás Patarino", "title": "GreachConf", "subject": "When Clean Architecture met Kotlin: A love story", "url": "https://agenda.greachconf.com/talk/when-clean-architecture-met-kotlin-a-love-story", "description": "<p>Kotlin, a modern language bursts into the community when developers have been perfecting what they call Clean Architecture for years, some potions and spells with which to increase the power of testability and become independent of evil external agents and cruel frameworks.</p>"}, {"lang": "en", "startDate": "2019-03-29", "endDate": "2019-03-29", "location": "Madrid, Spain", "speaker": "Alberto de Avila", "title": "GreachConf", "subject": "GRAALVM with Groovy & Kotlin", "url": "https://agenda.greachconf.com/talk/graalvm-with-groovy-kotlin", "description": "<p>Have you heard about GRAALVM? Maybe yes, but, how can we use it? In this talk we are going to see how to create images to execute our JVM applications faster and what are the GRAALVM limitations when using Groovy or Kotlin as program languagues</p>"}, {"lang": "en", "startDate": "2019-02-19", "endDate": "2019-02-19", "location": "Bangalore, India", "speaker": "Adit Lal", "title": "BlrKotlin", "subject": "Empower Session: The Power Of Kotlin", "url": "https://skillenza.com/challenge/socgen-kotlin-meetup-feb-2019", "description": "<p>Societe Generale which is regarded among the most forward thinking banks is organizing a meetup to structure a network of enthusiastic professionals around development trends in financial infrastructure surrounding Kotlin.This talk introduces and highlights how we could use Kotlin DSL’s and add some readability of code by enforcing the use of declarative code with minimum boilerplate, as well as look at why Kotlin is particularly good for DSLs with examples. And we are doing this with BlrKotlin (Bengaluru’s favourite Kotlin User Group).</p>"}, {"lang": "en", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Copenhagen, Denmark", "speaker": "Benoit Hebrard", "title": "Kotlin Copenhagen User Group", "subject": "Sealed classes", "url": "https://www.meetup.com/Kotlin-Copenhagen/events/258526808/", "description": "<p>Sealed classes are often described as enums on steroids. This talk will be an introduction to how sealed classes work, and some practical applications for them.</p>"}, {"lang": "es", "startDate": "2019-02-20", "endDate": "2019-02-20", "location": "México,Mexico", "speaker": "Adrian Catalan", "title": "GDG Androidtitlan", "subject": "If your code looks like it's Kotlin & quacks like it's Kotlin, then it probably is swift.", "url": "https://www.eventbrite.com/e/activity-35-9th-anniversary-tickets-56545090889?aff=ebdssbdestsearch&fbclid=IwAR1sCf3Y5Te8UKzH5jpnJ1OIrGiE2bU_r3hJl1oFv1k4Mx_k0jkrzqAASHM"}, {"lang": "en", "startDate": "2019-02-22", "endDate": "2019-02-22", "location": "Kampala, Uganda", "speaker": "Kevin Janvier", "title": "Kotlin Uganda User Group", "subject": "Intro to Web Dev with Kotlin", "url": "https://www.facebook.com/events/598956270515802/", "description": "<p>With front-end web apps becoming larger and more complex, and Node.js allowing Javascript to be used on the server side, the language has had a rapid rise in popularity. But for many JVM/Android developers, the thought of getting into front end web development and the Javascript ecosystem can seem quite unpleasant. However with Kotlin's ability to target JS, we can leverage the language features we've come to love, to make the experience a bit more fun. In this talk, we'll explore how we can build a Kotlin front-end application and even use Kotlin to interact with Node.js on the server.\nLearn how to leverage Kevin’s Kotlin codegen so your data model can be immutable and quickly parsed reflection free. I’ll discuss why this is important to us as developers, integration details, and how Moshi implemented this feature!</p>"}, {"lang": "ru", "startDate": "2019-03-02", "endDate": "2019-03-02", "location": "Taganrog, Russia", "speaker": "Alexey Shafranov", "title": "Taganrog Kotlin User Group", "subject": "Исключения в Kotlin и их особенности", "url": "https://vk.com/wall-177966710_6"}, {"lang": "ru", "startDate": "2019-03-02", "endDate": "2019-03-02", "location": "Taganrog, Russia", "speaker": "Andrey Tereshchenko", "title": "Taganrog Kotlin User Group", "subject": "Корутины. Гибкое асинхронное программирование в Kotlin", "url": "https://vk.com/wall-177966710_6"}, {"lang": "ru", "startDate": "2019-03-02", "endDate": "2019-03-02", "location": "Taganrog, Russia", "speaker": "Victor Petrenko", "title": "Taganrog Kotlin User Group", "subject": "Kotlin vs Swift", "url": "https://vk.com/wall-177966710_6"}, {"lang": "ru", "startDate": "2019-03-02", "endDate": "2019-03-02", "location": "Taganrog, Russia", "speaker": "Denis Alexandrov", "title": "Taganrog Kotlin User Group", "subject": "Десерт от Kotlin - синтаксический сахар", "url": "https://vk.com/wall-177966710_6"}, {"lang": "ru", "startDate": "2019-03-02", "endDate": "2019-03-02", "location": "Samara, Russia", "speaker": "Andrey Antipov", "title": "Samara Kotlin User Groups", "subject": "Тестируем выразительность языка (ломаем компилятор) на примере Kotlin", "url": "https://samara-it-community.timepad.ru/event/897399/", "description": "<p>На что стоит обратить внимание при исследовании выразительных средств нового языка программирования. С какими багами и непонятностями я столкнулся в процессе исследования Kotlin</p>"}, {"lang": "en", "startDate": "2019-02-02", "endDate": "2019-02-02", "location": "Bangladesh, India", "speaker": "S M Mohi-Us Sunnat", "title": "Bangladesh Kotlin User Group", "subject": "A Day with Kotlin for DIU Students", "url": "https://www.facebook.com/events/2269176219995187/", "description": "<p>This is the first meetup arranged by Bangladesh Kotlin User Group for the developers of Bangladesh. In this meetup, there will be the expertise Kotlin developers of Bangladesh who will be sharing their view on Kotlin.</p>\n<p>What will you get to know:\n1) What are the scopes of using Kotlin\n2) How it can ease the coding experience\n3) What are the ways it benefits a developer to code?\n4) Why Kotlin is the new future of Android development.\n5) How to use this language in an app (Demonstration)\n6) Object-oriented programming with Kotlin\n7) Android with Kotlin</p>"}, {"lang": "en", "startDate": "2019-02-02", "endDate": "2019-02-02", "location": "Bangladesh, India", "speaker": "S M Mohi-Us Sunnat", "title": "Bangladesh Kotlin User Group", "subject": "Basic Uses of Kotlin in Android and Spring", "url": "https://www.facebook.com/events/2269176219995187/", "description": "<p>Start with the Past, Present & Future of Kotlin. What will be the Future scopes of Kotlin Developers? Demonstrate the Basic Uses of Kotlin Android and Server with some simple code. Lastly, invite to join the Facebook group.</p>"}, {"lang": "en", "startDate": "2019-02-01", "endDate": "2019-02-01", "location": "London, UK", "speaker": "Alex Dunn", "title": "NDC London", "subject": "Kotlin for C# Developers", "url": "https://ndc-london.com/talk/kotlin-for-c-developers/", "description": "<p>Dive into the latest craze in languages and platforms - Kotlin. This time we will be looking at it from the perspective of a .NET C# developer, draw comparisons between the languages, and bridge the gap between these 2 amazing languages. We'll look at: Kotlin as a language Platforms Kotlin is great for Object Oriented Implementations in Kotlin Extended Features Features Kotlin has that C# doesn't A demo Android application in Kotlin vs a Xamarin.Android app in C# In the end you will leave with a foundational knowledge of Kotlin and its capabilities to build awesome apps with less code. You should feel comfortable comparing C# applications to Kotlin applications and know where to find resources to learn even more!</p>"}, {"lang": "en", "startDate": "2019-02-06", "endDate": "2019-02-06", "location": "Cairo, Egypt", "speaker": "Shady Selim", "title": "Career Launcher 6.0", "subject": "What's New with Kotlin for Android", "url": "https://www.facebook.com/events/1243280675797115/permalink/1246705902121259/", "description": "<p>What's New with Kotlin for Android</p>"}, {"lang": "en", "startDate": "2019-04-11", "endDate": "2019-04-11", "location": "Bristol, UK", "speaker": "Andy Balaam", "title": "ACCU 2019", "subject": "Kotlin makes your Java code better", "url": "https://conference.accu.org/2019/sessions.html#XHowKotlinmakesyourJavacodebetter", "description": "<p>Concrete examples, based on real-world code, of how converting Java code to Kotlin improves it. We will cover: * Reducing the amount of code for common patterns like value objects and default parameters * Preventing errors using immutability, null safety and explicit inheritance * Expressing ideas more directly using pattern matching, sealed classes and conditional expressions * Less verbose functional-style code like streams and lambdas * Clearer object structure with primary and secondary constructors One of the joys of Kotlin is how easy it is to make a gradual transition from Java. All of the examples will demonstrate code that can be dropped in to an existing Java code base with little or no disruption. If we have time, we'll discuss things we wish were in Kotlin, and whether any of them are plausible on the JVM platform.</p>"}, {"lang": "en", "startDate": "2019-03-06", "endDate": "2019-03-06", "location": "Benin, Nigeria", "speaker": "Ebuka Onyebinamma", "title": "Kotlin Benin User group", "subject": "Kotlin community: A necessity for every modern society", "url": "https://www.meetup.com/Kotlin-Benin-User-group/events/258961825/", "description": "<p>In recent times in the Tech world, precisely the software Engineering space, new technologies have evolved with kotlin as one of them, which has a very concise syntax, but powerful abilities and very versatile. Therefore, there is a need for every society to have a Kotlin community where members will be guided on learning the language and use it to solve problems around them.</p>"}, {"lang": "fr", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Paris, France", "speaker": "Geoffrey Métais", "title": "Paris Android User Group", "subject": "Modern concurrency on Android with Kotlin", "url": "https://www.meetup.com/Android-Paris/events/258788405/", "description": "<p>Le framework Android actuel, basé sur Java incite beaucoup à créer des \"callback hells\" et de nombreux points de blocage via des mutex, car nous n'avons pas de moyen plus simple de garantir la \"thread safety\".</p>\n<p>Avec les coroutines, Kotlin apporte un framework complet et efficace pour s'occuper de la concurrence d'une manière plus performante et surtout plus simple.</p>\n<p>Ce talk a pour but de montrer comment tirer parti des coroutines pour se débarraser des callbacks et des\nsynchonize.</p>"}, {"lang": "fr", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Paris, France", "speaker": "Aubry Alexandre et Duponchel Nicolas", "title": "Paris Android User Group", "subject": "Rx vs Coroutines", "url": "https://www.meetup.com/Android-Paris/events/258788405/", "description": "<p>La librairie Rx est une solution efficace et assez répandue pour traiter l’asynchronisme. Depuis l’arrivée de Kotlin une nouvelle solution est disponible : les coroutines.</p>\n<p>Dans cette présentation nous exposerons les basiques de Rx et des Coroutines. Nous mettrons ensuite en confrontation les 2 solutions via des cas d’usages simples, afin de tirer les avantages de chaque techno. Finalement nous essaierons ensemble de comprendre les philosophies de chaque solution.</p>"}, {"lang": "fr", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Paris, France", "speaker": "Geoffrey Marizy", "title": "Paris Android User Group", "subject": "Wrapping Android callbacks", "url": "https://www.meetup.com/Android-Paris/events/258788405/", "description": "<p>Les coroutines et RxJava c'est bien joli mais le framework Android lui repose sur les callbacks.</p>\n<p>Durant cette présentation, on va étendre la plateforme Android pour utiliser d'autres mécanismes ; coroutines, RxJava et LiveData. Je vous présenterai quelques techniques pour encapsuler les callbacks, et les avantages que l'on peut en tirer.</p>"}, {"lang": "en", "startDate": "2019-02-26", "endDate": "2019-02-26", "location": "Vienna, Austria", "speaker": "Rainer Kern", "title": "Kotlin Vienna", "subject": "Coroutines in Kotlin", "url": "https://www.meetup.com/Kotlin-Vienna/events/258992140/"}, {"lang": "en", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Gaborone, Botswana", "speaker": "Kesego Tumisang", "title": "GDG Gaborone", "subject": "Kotlin Night Gaborone", "url": "https://www.meetup.com/GDG-Gaborone/events/257657567/"}, {"lang": "pl", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Wroclaw, Poland", "speaker": "Anna Opoka", "title": "GDG Wrocław", "subject": "Kotlin Coroutines", "url": "https://www.meetup.com/GDG-Wroclaw/events/259093297/", "description": "<p>Na warsztatach poznamy podstawowe elementy korutyn oraz sposoby na wykorzystanie ich w Androidowym projekcie. Przerobimy także przykładową aplikację z callbacków na Kotlin Coroutines.</p>"}, {"lang": "es", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "México City, Mexico", "speaker": "Saúl Buentello", "title": "Kotlin CDMX User Group", "subject": "Coroutines vs Threads, are they any different?", "url": "https://www.meetup.com/Kotlin-CDMX/events/259104858/", "description": "<p>When you read the documentation, it is said that coroutines can be suspended without blocking a thread but what is the difference between blocking and suspending? What happens when you launch a coroutine or start a thread?</p>"}, {"lang": "pt", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "São Paulo, Brazil", "speaker": "Rafael Toledo, Consultor Líder", "title": "Kotlin Meetup - São Paulo", "subject": "Kotlin no backend com ktor", "url": "https://www.meetup.com/kotlin-meetup-sp/events/259136223/", "description": "<p>E pra esse encontro vamos ter um workshop bem legal sobre como utilizar Kotlin no Backend com ktor, com o Rafael Toledo, Consultor Lider na ThoughtWorks. Vamos aprender na prática comoLevem seus notebooks, vai ser daora! :)</p>"}, {"lang": "it", "startDate": "2019-03-02", "endDate": "2019-03-02", "location": "Salerno, Italy", "speaker": "Davide Cerbo", "title": "DevDay Salerno", "subject": "Kotlin: forse è la volta buona", "url": "https://www.meetup.com/devday-salerno/events/258898263/", "description": "<p>Dopo 20 anni Java inizia a sentire il peso degli anni e la sua sintassi non evolve come vorremmo, ma la JVM resta sempre un ambiente affidabile ed è già in produzione presso moltissime aziende. Negli ultimi anni sono usciti molti linguaggi basati sulla JVM, ma non tutti hanno avuto il successo sperato. Kotlin ha conquistato Android e, ora, grazie a una sintassi intuitiva e grandi aziende che lo supportano potrebbe essere molto utilizzato anche nelle applicazioni web.</p>"}, {"lang": "de", "startDate": "2019-03-28", "endDate": "2019-03-28", "location": "Hamburg, Germany", "speaker": "Michael Schneider", "title": "Hamburg Data Science Meetup", "subject": "Data hacking, from fast prototyping to production systems in order personalize Jimdo websites", "url": "https://www.meetup.com/Hamburg-Data-Science-Meetup/events/258130550/", "description": "<p>A tool stack overview on building non blocking and near real time data products in Kotlin in order to personalize websites at Jimdo. From data sourcing using apache drill to rapid prototyping, addressing the importance of machine learning evaluation, production problems and finally a/b testing with live users. Embracing the data driven culture of learning and failing fast.</p>"}, {"lang": "ru", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Moscow, Russia", "speaker": "Evgeny Zakharov", "title": "Kotlin Moscow", "subject": "Kotlin, посмотрим насколько глубока кроличья нора", "url": "https://softer-meetup.timepad.ru/event/904248/", "description": "<p>Порой возникают вопросы, почему в Kotlin некоторые вещи сделаны так, а не иначе. И на что стоит обратить внимание, если производительность играет не последнюю роль? Где же найти все ответы? Байткод! Заглянем внутрь, посмотрим на его декомпилированный вариант в Java, и большая часть вопросов исчезнет!</p>"}, {"lang": "ru", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Moscow, Russia", "speaker": "Vladislav Verminsky", "title": "Kotlin Moscow", "subject": "Поваренная книга Kotlin Native/MPP", "url": "https://softer-meetup.timepad.ru/event/904248/", "description": "<p>Цель доклада — рассказать о том, что такое Kotlin Native и Multiplatform, как они связаны между собой и чем отличаются, для каких целей используются. Познакомиться с компилятором kotlin-native и его инструментами, как создавать проекты через gradle, их структура и возможности плагинов. Создадим, скомпилируем и запустим проекты для Kotlin Native — C и Kotlin MPP — JS.</p>"}, {"lang": "en", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Athens, Greece", "speaker": "Vladislav Verminsky", "title": "GDG Android Athens", "subject": "An introduction to Kotlin Coroutines for Android", "url": "https://www.meetup.com/GDG-Android-Athens/events/259046622/", "description": "<p>Coroutines that fascinated devs from its early beta have graduated the experimental phase and are now stable 🎓. Coroutines provide a way to write asynchronous code sequentially making multithreaded programming more debuggable and maintainable. In this presentation Antonis will try to guide you through the main features of Coroutines that make it so special.</p>"}, {"lang": "ua", "startDate": "2019-02-23", "endDate": "2019-02-23", "location": "Lviv, Ukraine", "speaker": "Marharyta Nedzelska", "title": "JavaDay Lviv 2019", "subject": "Rediscovering gRPC with Kotlin coroutines", "url": "https://www.javaday.org.ua/speakers/Marharyta-Nedzelska", "content": {"slides": "https://docs.google.com/presentation/d/1RNH_dqFWEOOF9rDtUc-wJojfK2dV-iSb-VmG7WIhrAw/edit#slide=id.g38a1a2af64_2_35"}, "description": "<p>Microservice architecture is now a huge trend...</p>"}, {"lang": "en", "startDate": "2019-02-23", "endDate": "2019-02-23", "location": "Lviv, Ukraine", "speaker": "Sergey Zolotov", "title": "JavaDay Lviv 2019", "subject": "Kotlin Coroutines in Practice", "url": "https://www.javaday.org.ua/speakers/Sergey-Zolotov", "description": "<p>Kotlin coroutines are a hot topic and were released this year. We use them in our projects on backend. In this talk I will show you how to use it in real back-end based applications, common patterns and problems you could face</p>"}, {"lang": "en", "startDate": "2019-03-12", "endDate": "2019-03-12", "location": "Stockholm, Sweden", "speaker": "Mariana Bocoi", "title": "Go See Tech Talks #9", "subject": "Intro to Kotlin", "url": "https://www.meetup.com/Go-See-Tech-Talks/events/258963333/", "description": "<p>Kotlin starts to take more space in the coding world. Why is it an interesting language? How is it different than Java? Why would one switch? For our next tech talk, we have invited Mariana Bocoi - a software developer at Volvo Car Mobility - who will try to answer these questions and share her experience from working in Java, Clojure and now Kotlin. Most of the comparisons will be to Java.</p>"}, {"lang": "fr", "startDate": "2019-03-12", "endDate": "2019-03-12", "location": "Lyon, France", "speaker": "Martial Maillot", "title": "Lyon Kotlin User Group", "subject": "La programmation orienté objet en Kotlin", "url": "https://www.meetup.com/Lyon-Kotlin-User-Group/events/rrxsqqyzfbqb/", "description": "<p>Livecoding pour découvrir les classes et extensions.</p>"}, {"lang": "en", "startDate": "2019-03-13", "endDate": "2019-03-13", "location": "Nürnberg, Germany", "speaker": "Nino Handler", "title": "GDG Nuremberg Android", "subject": "Kotlin - why, how, when - why?", "url": "https://www.meetup.com/GDG-Nuremberg-Android/events/xsfbcpyzfbjb/", "description": "<p>Nino will give you reasons to switch to Kotlin if you haven't done yet and explain why it is nothing to be afraid of. A big part of the talk will be about interoperability between Kotlin and Java and how to call Kotlin code from Java.</p>"}, {"lang": "en", "startDate": "2019-03-14", "endDate": "2019-03-14", "location": "Haifa, Israel", "speaker": "Nir Golan", "title": "TechAssembly - Northern Tech Talks", "subject": "Introduction to Kotlin.", "url": "https://www.meetup.com/TechAssembly/events/259242490/"}, {"lang": "ru", "startDate": "2019-02-20", "endDate": "2019-02-20", "location": "Minsk, Belarus", "speaker": "Kirill Rozov", "title": "School.kt", "subject": "Introduction", "url": "https://bkug.by/course/", "content": {"video": "https://www.youtube.com/watch?v=nS1N4DFYEQs", "slides": "https://github.com/BelarusKUG/Course/blob/master/course_1/slides/1.pdf"}}, {"lang": "ru", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Minsk, Belarus", "speaker": "Ruslan Ibragimov", "title": "School.kt", "subject": "OOP", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-03-06", "endDate": "2019-03-06", "location": "Minsk, Belarus", "speaker": "Sergey Krukov", "title": "School.kt", "subject": "Standard Library", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-03-13", "endDate": "2019-03-13", "location": "Minsk, Belarus", "speaker": "Anthony Rutkevich", "title": "School.kt", "subject": "Functional Programming", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-03-20", "endDate": "2019-03-20", "location": "Minsk, Belarus", "speaker": "Pavel Schors", "title": "School.kt", "subject": "Generics", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-03-27", "endDate": "2019-03-27", "location": "Minsk, Belarus", "speaker": "Kirill Rozov", "title": "School.kt", "subject": "DSL+Multiplatform", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-04-03", "endDate": "2019-04-03", "location": "Minsk, Belarus", "speaker": "Ruslan Ibragimov", "title": "School.kt", "subject": "Coroutines", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-04-10", "endDate": "2019-04-10", "location": "Minsk, Belarus", "speaker": "Sergey Krukov", "title": "School.kt", "subject": "Backwards Compatibility with Java", "url": "https://bkug.by/course/"}, {"lang": "ru", "startDate": "2019-04-17", "endDate": "2019-04-17", "location": "Minsk, Belarus", "speaker": "Sergey Krukov, Kirill Rozov, Ruslan Ibragimov", "title": "School.kt", "subject": "Kotlin Ecosystem", "url": "https://bkug.by/course/"}, {"lang": "fr", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "Lyon, France", "speaker": "Martial Maillot", "title": "Lyon Kotlin User Group", "subject": "Tests unitaires, une bonne recette", "url": "https://www.meetup.com/Lyon-Kotlin-User-Group/events/rrxsqqyzdbqb/", "description": "<p>Découverte : La programmation orienté objet en Kotlin : 20 minutes en livecoding pour découvrir la syntaxe et les outils proposés.</p>\n<p>Confirmé : Tests unitaires, une bonne recette. Comment rendre vos tests unitaires plus lisible et concis avec\nKotlin.</p>"}, {"lang": "en", "startDate": "2019-02-13", "endDate": "2019-02-13", "location": "Kitchener, Canada", "speaker": "Andy Chow", "title": "Kotlin Waterloo P2P", "subject": "Testing with Kotlin", "url": "https://www.meetup.com/Kotlin-Waterloo-P2P/events/258362981/", "description": "<p>Andy will demonstrate how testing with Kotlin is significantly cleaner, easier and more enjoyable than Java. Testing can take advantage of the majority of Kotlin features and has some very easy to use frameworks. As a result, testing is one of the easiest ways to start making the switch from Java to Kotlin or to begin your Kotlin journey, so this is a must see talk!</p>"}, {"lang": "en", "startDate": "2019-02-20", "endDate": "2019-02-20", "location": "Hamburg, Germany", "speaker": "Jendrik Johannes", "title": "Kotlin User Group Hamburg", "subject": "Dependency Management in Gradle 5 and beyond", "url": "https://www.meetup.com/Kotlin-User-Group-Hamburg/events/258460746/", "description": "<p>The Java ecosystem allows developers to profit from a large pool of reusable libraries. Traditionally, the platform-independence of Java always made it easy to publish and share ready-to-use libraries. As Kotlin and Android developers, we also profit from this existing catalogue of libraries. However, new challenges for dealing with dependencies in the JVM world emerged over the past years, as software systems grew further in complexity and new platforms, such as Kotlin or Android, emerged.</p>\n<p>Dependency management is one of the major functionalities of the Gradle Build Tool.</p>\n</p>Gradle 5 offers a number of new stable features to support developers in managing dependencies – and more can be expected soon.</p>"}, {"lang": "en", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "Limerick, Ireland", "speaker": "Garth Gilmour", "title": "Kotlin Limerick User Group", "subject": "Kotlin - The Whole Damn Family", "url": "https://www.meetup.com/kotlinlimerick/events/258238931/", "description": "<p>Kotlin has seen rapid adoption over the last two years, and is now mainstream on the JVM. But that is only the start of the story. During 2018 Kotlin JS became a realistic option for browser based apps, with extensive support for building UI's in React. This year will see the emergence of Kotlin Native, enabling you to write programs that run outside of the JVM across a range of platforms. Best of all your common code can be managed via multiplatform projects and libraries, ending the duplication of type declarations in distributed systems. In this talk Garth will present examples of both Kotlin JS Web apps and Kotlin Native programs and talk about the stability, maturity and long term prospects for each.</p>"}, {"lang": "en", "startDate": "2019-03-27", "endDate": "2019-03-27", "location": "Frankfurt, Germany", "speaker": "Gustav Karlsson", "title": "Kotlin Meetup Rhein-Main", "subject": "Creating DSL:s in Kotlin", "url": "https://www.meetup.com/Kotlin-Rhein-Main/events/258464544/"}, {"lang": "en", "startDate": "2019-03-27", "endDate": "2019-03-27", "location": "Frankfurt, Germany", "speaker": "Sabrina Wenngatz", "title": "Kotlin Meetup Rhein-Main", "subject": "Kotlin Multiplatform", "url": "https://www.meetup.com/Kotlin-Rhein-Main/events/258464544/"}, {"lang": "en", "startDate": "2019-03-27", "endDate": "2019-03-27", "location": "Frankfurt, Germany", "speaker": "Wolfram Rittmeyer", "title": "Kotlin Meetup Rhein-Main", "subject": "Exploring Kotlin Coroutines", "url": "https://www.meetup.com/Kotlin-Rhein-Main/events/258464544/"}, {"lang": "es", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "Madrid, Spain", "speaker": "Alonso Torres", "title": "Madrid Groovy User Group", "subject": "Kotlin para Grooviers", "url": "https://www.meetup.com/madrid-gug/", "description": "<p>Google lo soporta como lenguaje de primer nivel para Android, muchas bibliotecas le dan soporte al primer nivel e incluso nuestro querido Gradle lo va a usar para implementar su DSL alternativa.</p>\n<p>No es ningún secreto que Jetbrains, los creadores del lenguaje, se inspiraron muchísimo en Groovy. Eso nos coloca a los programadores de Groovy en un punto ideal porque con poco esfuerzo podemos aprender este nuevo lenguaje trayéndonos mucha experiencia.</p>\n<p>En esta charla voy a hacer un recorrido por algunas de las principales características del lenguaje y ponerlas frente a frente con Groovy. Veremos ventajas e inconvenientes de las dos aproximaciones y espero que salgáis con bastante ideas de cómo es el lenguaje.</p>"}, {"lang": "en", "startDate": "2019-02-04", "endDate": "2019-02-04", "location": "Stockholm, Sweden", "speaker": "Bob Dahlberg", "title": "Jfokus 2019", "subject": "Quickie: Pitfalls when mixing Kotlin & Java", "url": "https://www.jfokus.se/jfokus19/talks/2589", "description": "<p>I've had my fair share of android projects being converted to Kotlin from Java and I thought I'd share the lessons I've learned doing so. There are a few subtle pitfalls that are very easy to fall into.</p>\n<p>So this is gonna be a quickie about my best practices and how to avoid doing the same mistakes I've made and seen</p>"}, {"lang": "en", "startDate": "2019-02-04", "endDate": "2019-02-04", "location": "Stockholm, Sweden", "speaker": "Justin D Lee", "title": "Jfokus 2019", "subject": "Kotlin is as awesome as you've heard. Here's why.", "url": "https://www.jfokus.se/jfokus19/talks/2703", "description": "<p>Most presentations introducing a new language are really just language tours. A lot of interesting language features are shown but it's not always clear why one would choose to adopt that new language. This presentation looks at a number of interesting features of the language and ecosystem that are more interesting than just a fancy new for loop. No one switch languages because of a for loop. So we'll look at a number of \"big ticket\" features of the language and ecosystem that do more to distinguish Kotlin than mere syntax sugar alone can provide. It will reasonably fast paced as we try to cover as many interesting tidbits as we can get through.</p>"}, {"lang": "en", "startDate": "2019-02-04", "endDate": "2019-02-04", "location": "Stockholm, Sweden", "speaker": "Anton Arhipov", "title": "Jfokus 2019", "subject": "Kotlin DSL in 45 minutes", "url": "https://www.jfokus.se/jfokus19/talks/2452", "description": "<p>Learn how to create type-safe and statically typed DSLs in Kotlin. Uncover the language features that makes DSL creation possible. We\u0092ll take a look at a few practical examples and create a simple DSL ourselves.</p>\n<p>The session starts with an introduction to DSL related Kotlin language features. Next, we create a simple DSL in a live coding session and then continue adding expressiveness and language features. We cover a number of examples, like JSON or XML builder\u0092s, data binding, configuration & template engines.</p>"}, {"lang": "en", "startDate": "2019-05-01", "endDate": "2019-05-01", "location": "Chicago, USA", "speaker": "Roman Elizarov", "title": "GOTO Conference 2019", "subject": "Asynchronous Programming with Kotlin", "url": "https://gotochgo.com/2019/workshops/174", "description": "<p>This workshop covers asynchronous programming in Kotlin using coroutines. It starts with basics of asynchronous programming and its differences from blocking code and introduces concepts of suspending functions and coroutines. Dealing with the ecosystem of blocking code on JVM is covered in depth as well as best practices for managing cancellation of asynchronous operations. The workshop also covers more advanced topics of concurrent decomposition of work via futures, deep dive into coroutine contexts and includes an overview of Communication Sequential Process (CSP) approach and channels.</p>"}, {"lang": "pl", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "Warsaw, Poland", "speaker": "Marek Multarzyński", "title": "Kotlin Night Warsaw", "subject": "Interoperability with Kotlin", "url": "https://www.meetup.com/Kotlin-Warsaw-by-Kt-Academy/events/258459508/", "description": "<p>In this presentation I would like to introduce the audience to the Kotlin Native compilation. We will determine its reasonable use. I will show the result of Kotlin Native compilation on many platforms. We will make a comparison between Kotlin Native approach and native solutions.</p>"}, {"lang": "pl", "startDate": "2019-02-28", "endDate": "2019-02-28", "location": "Warsaw, Poland", "speaker": "Krzysztof Romanowski", "title": "Kotlin Night Warsaw", "subject": "The price we all pay. Does Kotlin slow down our code?", "url": "https://www.meetup.com/Kotlin-Warsaw-by-Kt-Academy/events/258459508/", "content": {"video": "https://www.youtube.com/watch?v=jDFeNcMWzCs&feature=youtu.be"}, "description": "<p>Kotlin, as well as other languages like Scala or Groovy is developed (echm, hacked, eckm) over JVM. We all enjoy\nfeatures like extension methods or strict null management that does not have corresponding functionalities native to\nJVM. How does that affect performance?</p>\n<p>Let’s run some benchmarks!</p>"}, {"lang": "en", "startDate": "2019-04-25", "endDate": "2019-04-25", "location": "Chicago, USA", "speaker": "Sean Mcquillan", "title": "Chicago Roboto 2019", "subject": "Launching Into Coroutines", "url": "https://chicagoroboto.com/sessions/launching-into-coroutines/", "description": "<p>Kotlin coroutines are a new way to manage async operations on Android. Stable with Kotlin 1.3 now is a great time to explore using coroutines in your app. In this talk you’ll learn about the history coroutines, how they work in Kotlin, and effective patterns for using coroutines on Android. The talk will also cover how to avoid common pitfalls and mistakes with using coroutines. After this talk you will have a good understanding of Kotlin coroutines and how to effectively use them on Android!</p>"}, {"lang": "en", "startDate": "2019-04-25", "endDate": "2019-04-25", "location": "Chicago, USA", "speaker": "Huyen Tue Dao", "title": "Chicago Roboto 2019", "subject": "Dissecting the stdlib II", "url": "https://chicagoroboto.com/sessions/dissecting-the-stdlib-ii/", "description": "<p>One of the best places to learn idiomatic Kotlin is the stdlib. Now I don’t mean just using the stdlib but going to the source, literally. In this session, we’ll look at some of the methods and tools inside the stdlib and dig into how they’re written to reveal intermediate to advanced language features, slick syntax and conventions, and high-level abstractions to help you write more fluent objects and interfaces. We’ll also take a few glances at the underlying bytecode to understand how and why the features work the way they do.</p>"}, {"lang": "en", "startDate": "2019-02-21", "endDate": "2019-02-21", "location": "Wexford, Ireland", "speaker": "Ronan Doyle", "title": "South East Tech Meetup", "subject": "Kotlin vs Java for Android", "url": "https://www.meetup.com/South-East-Tech-Meetup/events/258599220/", "description": "<p>While Kotlin can be used to develop server-side, web and native OS applications, this talk will focus on highlighting some of the benefits of using Kotlin over Java when developing Android applications.</p>"}, {"lang": "de", "startDate": "2019-03-26", "endDate": "2019-03-26", "location": "Munich, Germany", "speaker": "Danny Preussler", "title": "MobileTechCon", "subject": "Kotlin vs. Java", "url": "https://mobiletechcon.de/android-development/kotlin-vs-java/", "description": "<p>Geht es nach Google, ist Kotlin die Zukunft der Android-Entwicklung. Erst vor etwas mehr als einem Jahr als „First-Class Citizen“ offiziell für die Android Plattform freigegeben, setzen heute bereits mehr als 25% der Top 1000 Android Anwendungen aus dem Play Store auf Kotlin. Und noch wichtiger: Die Zufriedenheit der Entwickler liegt laut Umfrage bei 97% und damit deutlich über dem vergleichbaren Wert für Java.</p>\n<p>Der Grund hierfür liegt klar auf der Hand. Die speziell für die Entwicklung von Android Apps geschaffene Sprache ist die direkte Antwort auf viele Probleme, die sich durch die Verwendung von Java im Android-Umfeld ergeben. Sie vereint dabei das Beste aus objektorientierter und funktionaler Programmiersprache und unterstützt so die Entwickler optimal mit Inter-Operabilität, Sicherheit und Tool Support.</p>\n<p>Der Workshop stellt Kotlin aus Sicht eines Android-Entwicklers vor und zeigt, welche Vorteile die Verwendung der neuen Programmiersprache mit sich bringen kann. Natürlich gehen wir dabei auch auf mögliche Migrationsszenarien und das Zusammenspiel von Java und Kotlin ein.</p>"}, {"lang": "en", "startDate": "2019-02-27", "endDate": "2019-02-27", "location": "Eindhoven, Netherlands", "speaker": "Joost Heikoop", "title": "Brabant.scala", "subject": "Kotlin vs. Java", "url": "https://www.meetup.com/brabant-scala/events/258756808/", "description": "<p>We have almost 20 years of Scala experience between us and have experience with many other languages. Recently we have jumped onto Kotlin, because it look very promising as Java competitor. Of course there is no one size fits all solution. We will show how the two languages compare and explain why and when, you should pick one over the other. Or maybe should consider some else all together.</p>"}, {"lang": "en", "startDate": "2019-02-22", "endDate": "2019-02-22", "location": "Pescara, Italy", "speaker": "Daniele Campogiani", "title": "Kotlin Night Pescara", "subject": "Android Functional validation with Arrow", "url": "https://www.meetup.com/GDG-Pescara/events/257319662/"}, {"lang": "en", "startDate": "2019-02-22", "endDate": "2019-02-22", "location": "Pescara, Italy", "speaker": "Matteo Bonifazi", "title": "Kotlin Night Pescara", "subject": "Kotlin killed Java stars", "url": "https://www.meetup.com/GDG-Pescara/events/257319662/"}, {"lang": "en", "startDate": "2019-02-22", "endDate": "2019-02-22", "location": "Pescara, Italy", "speaker": "Davide Cerbo", "title": "Kotlin Night Pescara", "subject": "Kotlin loves React", "url": "https://www.meetup.com/GDG-Pescara/events/257319662/"}, {"lang": "en", "startDate": "2019-03-19", "endDate": "2019-03-19", "location": "Zurich, Switzerland", "speaker": "Marharyta Nedzelska", "title": "Voxxed Days Zürich", "subject": "Building microservices with Kotlin and gRPC", "url": "https://voxxeddays.com/zurich/#schedule"}, {"lang": "ru", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "St.Petersburg, Russia", "speaker": "Pavel Finkelstein", "title": "JUG.ru", "subject": "Kotlin два года в проде и ни единого разрыва", "url": "https://jug.ru/2019/01/pavel-finkelstein/", "content": {"video": "https://www.youtube.com/watch?v=0H0mhiJLR7k"}}, {"lang": "en", "startDate": "2019-02-12", "endDate": "2019-02-12", "location": "Austin, TX, USA", "speaker": "Ben Boral", "title": "Austin Kotlin Meetup", "subject": "Ktor \"a Kotlin framework for building asynchronous servers and clients in connected systems.\"", "url": "https://www.meetup.com/Austin-Kotlin-Meetup/events/258130464/", "description": "<p>This month, Ben Boral will present a REST API he is building using Ktor. This talk will explain how to build a REST API in Kotlin with Ktor assuming zero prior Ktor knowledge.</p>"}, {"lang": "pt", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "São Paulo, Brazil", "speaker": "José Luiz Manzoli", "title": "Kotlin Meetup - São Paulo", "subject": "Kotlin para Backend", "url": "https://www.meetup.com/kotlin-meetup-sp/events/257930569/"}, {"lang": "en", "startDate": "2019-01-16", "endDate": "2019-01-16", "location": "New York, NY, USA", "speaker": "Mohit Sarveiya", "title": "New York Kotlin Meetup", "subject": "Dissecting Coroutines", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/257866899/", "description": "<p>2019 maybe be the year of Kotlin coroutines. What is a coroutine anyway? A coroutine is an instance of a state machine and a suspending function defines the state machine. What does that mean? Join me in this talk as we will explore the ins and out of coroutines. We will dive deep into channels, actors and the reactive streams modules. We’ll also look at their usage to solve common async problems in Android.</p>"}, {"lang": "en", "startDate": "2019-01-16", "endDate": "2019-01-16", "location": "New York, NY, USA", "speaker": "Brent Watson", "title": "New York Kotlin Meetup", "subject": "Advanced Kotlin", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/257866899/", "description": "<p>Brent will be giving the talk that he presented at droidcon nyc and droidcon sf on \"Advanced Kotlin\". We'll cover some of the more advanced features of Kotlin in this talk such as delegates, annotation use-site targets, tailrec, reflection, and much more.</p>"}, {"lang": "en", "startDate": "2019-01-18", "endDate": "2019-01-18", "location": "Brussels, Belgium", "speaker": "Sébastien Deleuze", "title": "The Brussels Java User Group", "subject": "Spring Boot with Kofu and Coroutines", "url": "https://www.meetup.com/BruJUG/events/257663434/", "description": "<p>This presentation will give me the opportunity to present the upcoming official support of coroutines in Spring (Framework, Boot, Data) as well as Kofu, the Kotlin DSL, developed within the the Spring Fu incubator that I started a few months ago, which goal is to configure Spring Boot in a more explicit as well as more efficient manner.</p>\n<p>My live coding will demonstrate how to develop a Spring Boot application with Kofu by using the new Coroutine API's from WebFlux and Spring Data R2DBC (Reactive SQL).</p>\n<p>We will also compare Reactive API's versus Coroutines (pros and cons) to help you make informed decisions.</p>"}, {"lang": "de", "startDate": "2019-01-30", "endDate": "2019-01-30", "location": "Bielefeld, Germany", "speaker": "Dennis Dierkes, Ruben Gees", "title": "Bielefelder Kotlin User Group", "subject": "Sealed Classes, Reified Generics and Ktor", "url": "https://www.meetup.com/Bielefelder-Kotlin-User-Group/events/257889787/", "description": "<p>Den Anfang macht Ruben (https://github.com/rubengees) mit Sealed Classes. Sealed Classes erweitern Enums um alle Funktionalitäten einer traditionellen Klasse und sind besonders nützlich im Zusammenhang mit Generics und dem speziellen Typ Nothing.</p>\n<p>Anschließend erzählt Robin (https://github.com/roschlau) etwas über Reified Generics, welche im Gegensatz zu Java die Typinformationen auch innerhalb der Funktion verfügbar machen, was zu lesbarerem Code führt.</p>\n<p>Den Schluss macht Dennis (https://github.com/deen13) mit Ktor, einem Framework zur Erstellung webbasierter API's mit minimalem Aufwand.</p>"}, {"lang": "en", "startDate": "2019-03-15", "endDate": "2019-03-15", "location": "Amsterdam, The Netherlands", "speaker": "Ellen Shapiro", "title": "Appdevcon 2019", "subject": "Kotlin/Native: The Good, The Bad, and the Ugly", "url": "https://appdevcon.nl/session/kotlin-native-the-good-the-bad-and-the-ugly/", "description": "<p>The promise of write-once-run-everywhere has haunted native mobile developers since the first time someone whispered the words “phone gap”. But what if there was a way to have cross-platform development with a modern, type-safe language? JetBrains is trying to make this happen with Kotlin/Native, which compiles to LLVM bytecode, and can run on iOS, Android, and even the web. Learn more about some of the benefits of working with Kotlin/Native, some of the drawbacks, and a few of the (current) potential dealbreakers when it comes to using this exciting new technology in a real app.</p>"}, {"lang": "en", "startDate": "2019-04-30", "endDate": "2019-04-30", "location": "Chicago, USA", "speaker": "Sean McQuillan", "title": "GOTO Conference 2019", "subject": "Embracing the Future in a Multi-Platform World: A Kotlin Story", "url": "https://gotochgo.com/2019/sessions/729", "description": "<p>So you know Kotlin, but you aren’t sure you’re utilizing it to its full potential across platforms?</p>\n<p>If you’re not sure about what Coroutines really have to offer or if you want to share your business logic between Android and other platforms, this session is your next step to becoming a Kotlin expert and your lesson on how to thrive in a multi-language world.</p>\n<p>In this session, you’ll learn how to write a multiplatform utility class and how Coroutines can live next to RxJava.\n</p>"}, {"lang": "en", "startDate": "2019-03-10", "endDate": "2019-03-10", "location": "Pisa, Italy", "speaker": "Fabio Collini", "title": "GDG DevFest Pisa 0.1", "subject": "From Java to Kotlin beyond Alt+Shift+Cmd+K", "url": "https://devfest.gdgpisa.it/schedule/day1?sessionId=148", "description": "<p>Kotlin is a first-class language for Android development since Google I/O 2017. And it’s here to stay! Thanks to Android Studio it’s really easy to introduce Kotlin in an existing project, the configuration is trivial and then we can convert Java classes to Kotlin using a Alt+Shift+Cmd+K. But the new syntax is the just beginning, using Kotlin we can improve our code making it more readable and simpler to write. In this talk we’ll see how to use some Kotlin features (for example data classes, collections, coroutines and delegates) to simplify Android development comparing the code with the equivalent “modern” Java code. It’s not fair to compare Kotlin code with plain Java 6 code so the Java examples will use lambdas and some external libraries like RxJava and AutoValue.</p>"}, {"lang": "en", "startDate": "2019-03-10", "endDate": "2019-03-10", "location": "Pisa, Italy", "speaker": "Roberto Orgiu", "title": "GDG DevFest Pisa 0.1", "subject": "EAsync Kotlin", "url": "https://devfest.gdgpisa.it/schedule/day1?sessionId=167", "description": "<p>Writing async code is never easy, but nowadays we have many solutions. One approach would be to use RxJava and its schedulers but... have you heard of Kotlin Coroutines? Join us and let's see how good they are today!</p>"}, {"lang": "en", "startDate": "2019-03-10", "endDate": "2019-03-10", "location": "Pisa, Italy", "speaker": "James Mark Coggan", "title": "GDG DevFest Pisa 0.1", "subject": "How to test your Android Things code in a clean way with Kotlin", "url": "https://devfest.gdgpisa.it/schedule/day1?sessionId=150", "description": "<p>Android things gives you the ability to connect all those Internet of things devices you have around all together. But how can you test it? In this talk you will learn in a practical way how to structure your Android Things project so you can write proper unit tests that don’t depend on your sensors, actuators or the Android framework.</p>"}, {"lang": "it", "startDate": "2019-03-10", "endDate": "2019-03-10", "location": "Pisa, Italy", "speaker": "Fabio Collini, Roberto Orgiu", "title": "GDG DevFest Pisa 0.1", "subject": "Kotlin Codelab Part 2 - Extra Registration needed!", "url": "https://devfest.gdgpisa.it/schedule/day1?sessionId=163", "description": "<p>Kotlin è un linguaggio di programmazione utilizzabile su piattaforma JVM e, dall’ultimo Google I/O, supportato ufficialmente su Android. Durante il Codelab sarà mostrato come convertire a Kotlin una app Android scritta in Java. L'app è composta da sei classi Java, le classi saranno convertite una ad una in Kotlin analizzando la sintassi di questo linguaggio e i vari costrutti utilizzabili. L'esempio è disponibile qui: https://github.com/fabioCollini/KotlinCodelab IMPORTANTE: Visto il numero ridotto di posti, per questo codelab é obbligatorio registarsi qui: http://bit.ly/dfpi17-codelab</p>"}, {"lang": "en", "startDate": "2019-02-14", "endDate": "2019-02-14", "location": "Budapest, Hungary", "speaker": "Nagy Bence", "title": "Kotlin Budapest User Group", "subject": "Type Safety with Inline Classes", "url": "https://www.meetup.com/Kotlin-Budapest/events/258089176/", "description": "<p>From measuring elapsed time to querying database objects, representing different concepts with primitive values is a common practice in many programming languages. Luckily, Kotlin’s new inline classes enable us to accurately represent these concepts in a type-safe and efficient manner.</p>"}, {"lang": "en", "startDate": "2019-02-14", "endDate": "2019-02-14", "location": "Budapest, Hungary", "speaker": "Voros Gyula", "title": "Kotlin Budapest User Group", "subject": "Micronaut + Kotlin", "url": "https://www.meetup.com/Kotlin-Budapest/events/258089176/", "description": "<p>Micronaut is a modern, JVM-based, full-stack framework for building modular, easily testable microservice and serverless applications. And it pairs amazingly well with Kotlin - Gyula is here to tell you all about it.</p>"}, {"lang": "en", "startDate": "2019-01-17", "endDate": "2019-01-17", "location": "Lehi, UT, USA", "speaker": "Matt Berteaux", "title": "Kotlin Utah User Group", "subject": "Intro to Ktor", "url": "https://www.meetup.com/Kotlin-Utah/events/ggfnjqyzcbwb/", "description": "<p>This month we are going to learn about Ktor a \"framework for quickly creating connected applications in Kotlin with minimal effort.\"</p>"}, {"lang": "en", "startDate": "2019-01-22", "endDate": "2019-01-22", "location": "Seattle, WA", "speaker": "Daniel Gruici", "title": "Seattle Kotlin", "subject": "Statefulness is fun! Except when it gets cumbersome.", "url": "https://www.meetup.com/Seattle-Kotlin/events/257686164/", "description": "<p>We will be talking about how being stateful in your applications can be useful (especially with Kotlin's help), some pitfalls and not so great stuff that can come up as you go, as well as how it greatly benefits testing for both UI and Unit tests.</p>"}, {"lang": "en", "startDate": "2019-01-22", "endDate": "2019-01-22", "location": "Seattle, WA", "speaker": "Ravi Subramanian", "title": "Seattle Kotlin", "subject": "A deep dive into adb", "url": "https://www.meetup.com/Seattle-Kotlin/events/257686164/", "description": "<p>What does `adb lolcat` do? A deep dive into adb</p>"}, {"lang": "en", "startDate": "2019-01-24", "endDate": "2019-01-24", "location": "Düsseldorf, Germany", "speaker": "Jan Völker", "title": "Kotlin User Group Düsseldorf", "subject": "How to write an interpreter in Kotlin", "url": "https://www.meetup.com/Dusseldorf-Kotlin-Meetup/events/257965951/", "description": "<p>In this talk we'll show you how to write a simple interpreter from scratch. No dependencies, no tricks\njust pure kotlin.</p>"}, {"lang": "fr", "startDate": "2019-01-24", "endDate": "2019-01-24", "location": "Lille, France", "speaker": "Yassine Benabbas", "title": "Lille Android User Group", "subject": "Les nouveautés de Kotlin 1.3 en Live Coding", "url": "https://www.meetup.com/Lille-Android-User-Group/", "description": "<p>Découvrons ensemble les nouveautés de Kotlin 1.3. Au programme on verra notamment les inline classes, les contrats et la les coroutines qui ont été stabilisées.</p>\n<p>Live coding signifie que tout sera illustré avec du code et un IDE (IntelliJ). Donc c’est garanti 0% slides.</p>"}, {"lang": "fr", "startDate": "2019-01-24", "endDate": "2019-01-24", "location": "Lille, France", "speaker": "Salomon Brys", "title": "Lille Android User Group", "subject": "Kotlin pour Android, iOS et le Web", "url": "https://www.meetup.com/Lille-Android-User-Group/events/258099776/", "description": "<p>Kotlin est un des langages officiels pour le développement Android, et il est maintenant officiellement supporté par plusieurs framework backends comme Spring. Saviez vous que vous pouvez utiliser Kotlin pour compiler pour iOS via LLVM ou pour le web via JS ?</p>\n<p>Durant cette présentation, je montrerai comment créer une application mobile qui tourne sur Android, sur iOS et sur le web tout en restant fidèle à chaque plateforme.</p>"}, {"lang": "en", "startDate": "2019-01-29", "endDate": "2019-01-29", "location": "Tel Aviv-Yafo, Israel", "speaker": "Ohad Shai", "title": "KotlinTLV", "subject": "Playing with Kotlin Workshop", "url": "https://www.meetup.com/KotlinTLV/events/258089468/", "description": "<p>We will meet again, with a different format. This time we will hold a workshop so please bring your laptop. In this workshop, we will implement the game of 2048 together. The exercise is originally a part of the 'Kotlin for Java Developers' course that is taught by JetBrains. We will have IntelliJ IDE Ultimate licenses as prizes.</p>"}, {"lang": "pl", "startDate": "2019-01-30", "endDate": "2019-01-30", "location": "Kraków, Poland", "speaker": "Krzysztof Korbacz", "title": "Kraków Kotlin User Group", "subject": "Lesson learned - Kotlin on backend", "url": "https://www.meetup.com/krakow-kotlin/events/257954710/", "description": "<p>Have you recently wondered if this new backend project is a good moment to jump into Kotlin, but all you know about it was those blog posts and presentations saying how cool is it?</p>\n<p>Maybe it is good idea to ask someone brave or stupid enough who has already done it? Then here we are to tell you our story of transformation from Java backend devs to Kotlin backend developers.</p>\n<p>We will tell you what pitfalls we see in Kotlin and which of its features we appreciate the most. We will walk you through the recipes we gathered in our last project. Last but not least we will tell you if we would choose Kotlin again, knowing what we know today :)</p>"}, {"lang": "pl", "startDate": "2019-01-30", "endDate": "2019-01-30", "location": "Kraków, Poland", "speaker": "Paweł Pyzik", "title": "Kraków Kotlin User Group", "subject": "Can your team benefit from migrating to Kotlin?", "url": "https://www.meetup.com/krakow-kotlin/events/257954710/", "description": "<p>After talk we would like to invite to you to discussion about benefits and drawback of switching from java to Kotlin. We will share stories from people who managed to convince their product owners to taka a risk of shifting to Kotlin.:)</p>"}, {"lang": "en", "startDate": "2019-02-06", "endDate": "2019-02-06", "location": "Stuttgart, Germany", "speaker": "Alex Koufatzis", "title": "Kotlin User Group Stuttgart", "subject": "Kotlin Coroutines", "url": "https://www.meetup.com/Kotlin-User-Group-Stuttgart/events/257953412/"}, {"lang": "en", "startDate": "2019-02-06", "endDate": "2019-02-06", "location": "Stuttgart, Germany", "speaker": "Giso Bartels", "title": "Kotlin User Group Stuttgart", "subject": "Model-View-Intent with Kotlin", "url": "https://www.meetup.com/Kotlin-User-Group-Stuttgart/events/257953412/"}, {"lang": "en", "startDate": "2019-02-20", "endDate": "2019-02-20", "location": "Düsseldorf, Germany", "speaker": "Simon Wirtz", "title": "Kotlin User Group Düsseldorf", "subject": "Coroutines - Simple Concurrency with Kotlin", "url": "https://www.meetup.com/Dusseldorf-Kotlin-Meetup/events/257985526/", "description": "<p>This talk will give an overview of Kotlin's approach to coroutines and how they help you structure your code.\nLet's see what coroutines are, how they look like and how they support us in writing concurrent code for the JVM, JavaScript and other platforms.</p>\n<p>It has never been a better time to get started with Kotlin coroutines as JetBrains has just released them in a 1.0 version.</p>"}, {"lang": "pl", "startDate": "2019-02-22", "endDate": "2019-02-22", "location": "Warsaw, Poland", "speaker": "Marcin Moskala", "title": "Kotlin Warsaw by Kt. Academy", "subject": "Klub dyskusji programistycznej", "url": "https://www.meetup.com/Kotlin-Warsaw-by-Kt-Academy/events/blgqpqyzcbpb/", "description": "<p>Spotkanie w czasie którego będziemy dyskutować na tematy związane z programowaniem. Głównym celem jest rozwój własnego zrozumienia problemów i koncepcji programistycznych, oraz wypracowywanie lepszych praktyk dla programistów. Dodatkowo chcemy poprawić nasze umiejętności sprawnego artykuowania swoich myśli oraz prowadzenia dyskusji programistycznej.</p>"}, {"lang": "ru", "startDate": "2019-01-28", "endDate": "2019-01-28", "location": "Minsk, Belarus", "speaker": "Ilmir Usmanov", "title": "Belarus Kotlin User Group", "subject": "Kotlin Coroutines: Deep Dive", "url": "https://bkug.by/", "description": "<p>Ильмир расскажет о том, как корутины устроены внутри: какие преобразования делает компилятор, чтобы синхронный код превратить в ассинхронный; как на низком уровне представлены корутины и что на самом деле делают функции suspendCoroutine и resume.</p>"}, {"lang": "ru", "startDate": "2019-01-28", "endDate": "2019-01-28", "location": "Minsk, Belarus", "speaker": "Ruslan Ibragimov", "title": "Belarus Kotlin User Group", "subject": "Undertow", "url": "https://bkug.by/", "description": "<p>Руслан расскажет о своем опыте использования Undertow: примеры использования, как подружить корутины с undertow и сравнит его с более известными Spring и Ktor.</p>"}, {"lang": "ru", "startDate": "2018-12-06", "endDate": "2018-12-06", "location": "St.Petersburg, Russia", "speaker": "Dmitry Savinov", "title": "Java Jam", "subject": "Kotlin Contracts", "url": "https://events.yandex.ru/events/meetings/6-dec-2018/", "content": {"video": "https://www.youtube.com/watch?time_continue=4&v=IsW1KiU6rQI"}, "description": "<p>Контракты — это новая экспериментальная фича в Kotlin 1.3.\nПоговорим о том, что такое контракты в Котлине и с чем их едят.\nПосмотрим на то, что уже можно потрогать руками — как в стабильном режиме,\nтак и в экспериментальном. В конце немного обсудим текущее направление исследований в этой области.</p>"}, {"lang": "en", "startDate": "2018-12-20", "endDate": "2018-12-20", "location": "Tallinn, Estonia", "speaker": "Anton Arhipov", "title": "Tallinn DevOps Meetup", "subject": "Kotlin DSL in under an hour", "url": "https://www.meetup.com/Tallinn-DevOps-Meetup/events/257076424/"}, {"lang": "en", "startDate": "2019-01-08", "endDate": "2019-01-08", "location": "Sheffield, United Kingdom", "speaker": "Matt Ellis", "title": "dotnetsheff", "subject": "Kotlin for the curious", "url": "https://www.meetup.com/dotnetsheff/events/253753378/", "description": "<p>Interested in Kotlin? And why not - it’s a pragmatic language designed to remove ceremony, solve real world problems and still feel familiar to newcomers. It can target the JVM, Android, JavaScript and native code, even running on iOS. That’s a lot of reach for a single programming language.</p>\n<p>In this talk, we’ll go on a high level, introductory tour of Kotlin - how to get up and running, what Kotlin looks like, and how to write idiomatic, concise code - functional or object oriented. We’ll look at data classes, top level and first class functions, inlining, null safety and more, including the design decisions behind some of the language choices. We’ll see how you can build DSLs, with examples from Android and HTML, and look at how we can build multi-platform projects. And we’ll take a look at coroutines, Kotlin’s answer to C#’s async/await.</p>"}, {"lang": "en", "startDate": "2019-01-09", "endDate": "2019-01-09", "location": "Warsaw, Poland", "speaker": "Marharyta Nedzelska", "title": "Warsaw Cloud Native Meetup", "subject": "Building Microservices with Kotlin and gRPC", "url": "https://www.meetup.com/Warsaw-Cloud-Native-Meetup/events/257113254/", "description": "<p>Microservice architecture is now a huge trend. All big organizations with millions of users are doing microservices. This means they have lots of channels of communication between services and need to send and get much data. At some point, you can find yourself in a situation where your current approach doesn’t provide you with efficient communications, you pay more, wait for more, lose more etc. Maybe it’s time to look at gRPC… In this talk, we will cover the basics of gRPC, protocol buffers, and its usage. We will try to understand its pros and cons and where this approach could be used. We will also compare this approach with the alternatives. The most interesting about this talk is that we will have lots of practice. We will learn how to write .proto files, how to make effective communication between your microservices, and of course, write much code (in Kotlin)</p>"}, {"lang": "en", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "Denver, CO, USA", "speaker": "Mike Patterson", "title": "Denver Droids (aka Denver Android Developers Group)", "subject": "Coroutines: Kotlin's Flexible Async Approach", "url": "https://www.meetup.com/DenverDroids/events/kchhnqyzcbtb/", "description": "<p>Asynchronous programming is impossible to avoid in Android development unless your app is quite simple. Any networking or database calls require background threads to avoid blocking the UI, which could create ANR (Application Not Responding) bugs.</p>\n<p>The Android framework provides AsyncTasks, which can be unwieldy. Some app developers use 3rd party libraries like RxJava to handle threading, which can involve a steep learning curve.</p>\n<p>Coroutines provide a few advantages over these, but most importantly coroutines make asynchronous code read like synchronous code. With the release of Kotlin v1.3, coroutines are now stable. Come to Denver Droids and learn about the advantages, the how-to, and some best practices around coroutines.</p>"}, {"lang": "en", "startDate": "2019-02-08", "endDate": "2019-02-08", "location": "Tokyo, Japan", "speaker": "JB Lorenzo", "title": "DroidKaigi 2019", "subject": "Fast Prototypes with Flutter + Kotlin/Native", "url": "https://droidkaigi.jp/2019/en/accepted"}, {"lang": "ja", "startDate": "2019-02-08", "endDate": "2019-02-08", "location": "Tokyo, Japan", "speaker": "mhidaka", "title": "DroidKaigi 2019", "subject": "Understanding Kotlin Coroutines: コルーチンで進化するアプリケーション開発", "url": "https://droidkaigi.jp/2019/en/accepted", "description": "<p>Kotlin Coroutinesは非同期処理をシンプルに記述できるKotlinの言語機能です。実験的な機能としてこれまでも提供されてきましたがKotlin 1.3で正式にリリース予定です。</p>\n<p>Androidの誕生から10年たちアプリの利用シーンが増えた結果、アプリ開発の複雑さも増してきています。開発者はアプリの性質に合わせてMVVMをはじめとしたアーキテクチャとArchitecture Components（AAC）など複雑性を解消するライブラリを組み合わせ、実装上の課題を解決してきました。\n<p>本セッションでは新登場のCoroutinesを既存のアプリケーションへ適用する方法と導入するメリットを中心に解説します。</p>\n<p>Coroutines の本質を理解することはアーキテクチャをよりシンプルに保ちます。そして言語機能の追加がアプリ開発現場に与える影響を考察していきます。</p>\n<p>設計・開発の効率化といえば、これまで多くの場合、ライブラリの導入がメインでした。しかしアプリの複雑性が増加するにつれて多数のライブラリを導入しつづけることは開発者に多くの知識を要求し、イニシャルコストの増加に繋がります。言語そのものの力を理解することでコストを下げ、より素早い開発を実現できます。</p>\n<p>本セッションはアプリ開発で実践できるよう、なじみのあるアーキテクチャを通じてCoroutinesを学んでいきます。\n聞き終わったときには、AACなどモダンなライブラリのなかで効率的な非同期処理に対応する方法を習得できます</p>"}, {"lang": "en", "startDate": "2019-04-30", "endDate": "2019-04-30", "location": "Chicago, USA", "speaker": "Sean McQuillan", "title": "GOTO Chicago 2019", "subject": "Embracing the Future in a Multi-Platform World: A Kotlin Story", "url": "hhttps://gotochgo.com/2019/sessions/729", "description": "<p>So you know Kotlin, but you aren’t sure you’re utilizing it to its full potential across platforms?</p>\n<p>If you’re not sure about what Coroutines really have to offer or if you want to share your business logic between Android and other platforms, this session is your next step to becoming a Kotlin expert and your lesson on how to thrive in a multi-language world.</p>\n<p>In this session, you’ll learn how to write a multiplatform utility class and how Coroutines can live next to\nRxJava.</p>"}, {"lang": "en", "startDate": "2019-06-19", "endDate": "2019-06-19", "location": "Amsterdam, The Netherlands", "speaker": "Paulien van Alst", "title": "GOTO Amsterdam 2019", "subject": "Upgrade Time: Choose Java 11 or the “other” one… Kotlin", "url": "https://gotoams.nl/2019/sessions/777", "description": "<p>Most of the Java applications are written in Java 8 nowadays and people are looking around to upgrade to Java 11 or even migrating to Kotlin. Both are promoted as the new way to go and both have their own strengths and weaknesses. Upgrading to Java 11 might be an obvious next safe step to do. But what if you could migrate to Kotlin with the same effort? This would bring you additional advantages like: data classes, very concise list manipulations, extension functions, DSL's and even more to get your code more readable and maintainable. Considering the Kotlin migration, the first questions that pop up are: What are the wise steps to take and where to start? Some experiences and thoughts answering these questions will be shared during this live coding session.</p>"}, {"lang": "es", "startDate": "2019-01-10", "endDate": "2019-01-10", "location": "Vigo, Spain", "speaker": "Saul Molinero", "title": "Vigo Android Developer Group", "subject": "Por qué de debería conocer Kotlin", "url": "https://www.meetup.com/Vigo-Android-Developer-Group/events/257554063/"}, {"lang": "de", "startDate": "2019-01-28", "endDate": "2019-01-28", "location": "Mainz,Germany", "speaker": "Niklas Lochschmidt", "title": "Talks4Nerds Wiesbaden", "subject": "Kotlin: Das moderne Java", "url": "https://www.meetup.com/Talks4Nerds/events/257129358/"}, {"lang": "fr", "startDate": "2019-01-17", "endDate": "2019-01-17", "location": "Aix-en-Provence, France", "speaker": "Thomas Roncaglia", "title": "GDG Aix-Marseille", "subject": "Workshop Android-Kotlin", "url": "https://www.meetup.com/GDG-Aix-Marseille/events/257095150/"}, {"lang": "en", "startDate": "2019-02-07", "endDate": "2019-02-07", "location": "Miami, FL, USA", "speaker": "Marcelo Olivas", "title": "Miami JVM Group", "subject": "Kotlin for Java Developers", "url": "https://www.meetup.com/Miami-Java-User-Group/events/255768122/", "description": "<p>An introduction to the Kotlin language and why it is getting so much attention. In this talk, we will learn some of the advantages and features of the language.</p>\n<p>The growth of Kotlin as an Android development language has been explosive. If you are developing for Android devices, you need to become comfortable with the language, both for native development and because more and more tutorials and support libraries are adopting it. Join us to gain an understanding of Kotlin fundamentals.</p>"}, {"lang": "en", "startDate": "2019-02-22", "endDate": "2019-02-22", "location": "Emeryville, CA", "speaker": "Rohit Basu", "title": "DeveloperWeek 2019", "subject": "Go - Rust - Scala - Kotlin, What Should I Learn Next?", "url": "developerweek.com", "description": "<p> have been coding in Java & Javascript for many years now and I want to learn something new. If I had to pick 1 Systems Programming and 1 Applications Programming language, which should/would that be. In this talk, I will compare go, rust, scala, kotlin and show how easy/difficult it is to write the first `Hello World` in these languages. We will look at the pros and cons of these 4 languages and will try to pick winners.</p>"}, {"lang": "en", "startDate": "2019-07-19", "endDate": "2019-07-19", "location": "Denver, CO, USA", "speaker": "Nick Capurso", "title": "360|AnDev 2019", "subject": "Kotlin Coroutines: An Intro to Practical Use on Android", "url": "https://360andev.com/sessions/kotlin-coroutines-an-intro-to-practical-use-on-android/", "description": "<p>Asynchronous programming has always been a challenging problem for Android developers. Any good solution has to gracefully handle errors, cancellation, chaining multiple actions together, handle thread swapping, and much more.</p>\n<p>Kotlin’s coroutines are yet another option for asynchronous programming. However, unlike other popular contenders, coroutines meet all the previously mentioned requirements out-of-the-box, have a gentler learning curve, and don’t require you to write an absurd amount of boilerplate.</p>\n<p>That said, learning any new asynchronous solution takes time and often comes with a period of trial-and-error until you have all the nuances figured out. Get a jumpstart on coroutines:\n<p>(1) Lessen the learning curve by getting the subtleties of coroutines out of the way early\n(2) Learn how to work coroutines into an existing app: easy places to start transitioning, interop with existing libraries, and reusing existing threading constructs\n(3) Learn how to easily support error handling, cancellation, and task chaining\n(4) Learn how to unit test coroutines</p>\n<p>Get a head start on coroutines in your apps and easily write, test, and maintain asynchronous code like never\nbefore!</p>"}, {"lang": "en", "startDate": "2019-07-19", "endDate": "2019-07-19", "location": "Denver, CO, USA", "speaker": "Joshua Lamson", "title": "360|AnDev 2019", "subject": "Kotlinize your Canvas", "url": "https://360andev.com/sessions/custom-drawing-with-canvas-in-kotlin/", "description": "<p>When you’re creating a new View to display some complex data, it’s easy for the number of View objects you’re using to get out of control. Between elaborate shapes, shaders/colors, and text in specific places and orientations, using only Android Views and layouts can turn your layout into a dense, complicated mess. Luckily, there’s a better way to add all your customizations. What you need is a blank Canvas! (Literally, android.graphics.Canvas).</p>\n<p>In this session, we’ll delve into the details of using a Canvas to display anything you need in a truly custom way, explaining it all through simple examples written in Kotlin. You’ll leave this talk knowing how override the behavior of View, ViewGroup, and Drawable to draw custom shapes, paths, and text on the Canvas.</p>"}, {"lang": "pl", "startDate": "2019-01-04", "endDate": "2019-01-04", "location": "Warsaw, Poland", "speaker": "Marcin Moskala", "title": "Kotlin Warsaw by Kt. Academy", "subject": "Klub dyskusji programistycznej", "url": "https://www.meetup.com/Kotlin-Warsaw-by-Kt-Academy/events/lbvvnqyzcbgb/", "description": "<p>Spotkanie w czasie którego będziemy dyskutować na tematy związane z programowaniem. Głównym celem jest rozwój własnego zrozumienia problemów i koncepcji programistycznych, oraz wypracowywanie lepszych praktyk dla programistów. Dodatkowo chcemy poprawić nasze umiejętności sprawnego artykuowania swoich myśli oraz prowadzenia dyskusji programistycznej.</p>"}, {"lang": "en", "startDate": "2019-01-22", "endDate": "2019-01-22", "location": "Rotterdam, Netherlands", "speaker": "Paulien van Alst", "title": "RotterdamJUG (Java User Group)", "subject": "Kotlin workshop", "url": "https://www.meetup.com/RotterdamJUG/events/257702100/", "description": "<p>In this workshop, you will build a simple webservice in Kotlin and hopefully see how easy it can be to write new business functionality. No Hello, World app guaranteed! You will be developing a true microservice with real business rules. The workshop offers you to jump in at different levels: from totally new to Kotlin to the more experienced ones. The covered topics are (data) classes, collections and types (type alias), inheritance, interfaces and extension functions, coroutines and Kotlin’s interoperability with Spring.</p>"}, {"lang": "en", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "Chicago, USA", "speaker": "Mark Ducommun", "title": "Chicago Kotlin Users Group", "subject": "Monthly Kotlin Meetup", "url": "https://www.meetup.com/Chicago-Kotlin/events/qhwhcpyzcbtb/"}, {"lang": "en", "startDate": "2019-03-06", "endDate": "2019-03-06", "location": "Atlanta, USA", "speaker": "Ken Kousen", "title": "DevNexus", "subject": "Kotlin: Safe, Pragmatic Interoperability on the JVM", "url": "https://devnexus.com/presentations/3555/", "description": "<p>Kotlin is a practical language designed for the JVM. It focuses on pragmatism and safety, with an emphasis on interoperability and tool support. Kotlin is statically typed and includes null checks in the type system itself. The language runs anywhere Java does, from microservices to Android apps. This workshop will show how to use Kotlin to simplify anything you originally planned to do in Java.</p>\n<p>Kotlin combines object-oriented programming with functional features like lambda expressions, functional types, and data classes. Since it comes from JetBrains, the company that produces the IntelliJ IDEA development environment, it’s tool support is excellent. IntelliJ even provides a Java-to-Kotlin converter to help you get started.</p>\n<p>This presentation will cover the basic types, defining and calling functions, programming with lambdas, higher order functions, and DSLs. The goal is to give you enough background to be productive while you continue to learn and grow with the language.</p>"}, {"lang": "en", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "Prague, Czech Republic", "speaker": "Hadi Hariri", "title": "Czech Kotlin User Group", "subject": "Kotlin Talk s Hadim Haririm", "url": "https://www.eventbrite.com/e/kotlin-talk-s-hadim-haririm-tickets-54531821145?fbclid=IwAR05m2jnPE4n7cfE9cK3cU-bTMq8T5g0lJbqD2M_FMABae3GTz7obxpbiLE", "description": "<p>Nový rok začínáme pěkně zostra. Opět k nám zavítá Hadi Hariri z JetBrains, se kterým jsme se potkali loni v březnu, kdy nás provedl asynchronním programováním a ukázal, jak se používá Kotlin Coroutines. Tentokrát si pro nás připravil talk Functional Programming in Kotlin. Přiblíží nám, jak efektivně využívat funkcionální programování se zaměřením na lambdy, Higher Order funkce a podobně. Po skončení talku je připraven na zvídavé otázky – využijte možnost upgradovat své skilly a zeptat se na cokoli, co vás na Kotlinu zajímá!</p>"}, {"lang": "nl", "startDate": "2019-01-31", "endDate": "2019-01-31", "location": "Arnhem, Netherlands", "speaker": "Coen Smid", "title": "Avisi Techday", "subject": "Kotlin multiplatform", "url": "https://www.avisi.nl/evenementen/techdays/techday-kotlin-multiplatform?utm_content=82248031&utm_medium=social&utm_source=twitter&hss_channel=tw-390634166", "description": "<p>Kotlin is een programmeertaal die steeds populairder wordt. Het gebruik neemt exponentieel toe: zowel bij apps als bij serverside applicaties. Frontend Kotlin wordt langzamerhand ook opgepakt. Nu (sinds Kotlin 1.2) is Kotlin multiplatform aangekondigd en is dit beschikbaar om mee te experimenteren.</p>\n<p>De filosofie is als volgt: schrijf applicaties voor web, desktop, backend, Android en iOS in dezelfde taal en deel de code tussen de apps. Dit heeft meerdere voordelen, waarvan we de meeste tijdens deze Techday gaan bespreken. We willen natuurlijk vooraan staan bij deze nieuwe ontwikkelingen!</p>"}, {"lang": "pl", "startDate": "2019-02-02", "endDate": "2019-02-02", "location": "Kielce, Poland", "speaker": "Paweł Włodarski", "title": "Kielce JUG", "subject": "Pierwsze warsztaty z Kotlina w ramach KJUG", "url": "https://kotlin.kielcejava.pl/", "description": "<p>Wprowadzenie do OOP i FP w Kotlinie</p>\n<p>Tworzenie DSLi i praktyczny przykład ze Springiem</p>\n<p>System typów w Kotlinie</p>"}, {"lang": "fr", "startDate": "2019-01-16", "endDate": "2019-01-16", "location": "Montpellier, France", "speaker": "Adrien Pessu, Martin Lacaze", "title": "Montpellier JUG", "subject": "Kotlin: Le back du futur, le codelab", "url": "https://www.jug-montpellier.org/", "description": "<p>Depuis l’annonce par Google du support de Kotlin sur Android, les développeurs d'applications mobiles se sont fortement intéressés à ce langage récent. Mais \"Nom de Zeus !\" est-ce réservé aux développeurs mobiles ? Non, Non et Non. Kotlin tourne sur la JVM alors autant en profiter dans tous nos projets.</p>\n<p>Viens nous rejoindre pour découvrir toutes les facettes de ton futur prochain langage préféré. À travers plusieurs exercices, tu apprendras à transformer ton vieux Java en Kotlin puis à penser directement en Kotlin pour plus de \"fun\" et moins de \"void\".</p>"}, {"lang": "uk", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "Lviv, Ukraine", "speaker": "Oleg Semen", "title": "Lviv Kotlin User Group", "subject": "Sliced by whole. Little advanture at multiplutform world", "url": "https://www.meetup.com/Lviv-Kotlin-User-Group/events/257283433/"}, {"lang": "uk", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "Lviv, Ukraine", "speaker": "Marharyta Nedzelska", "title": "Lviv Kotlin User Group", "subject": "Kotlin: a lazy language for lazy people", "url": "https://www.meetup.com/Lviv-Kotlin-User-Group/events/257283433/"}, {"lang": "uk", "startDate": "2019-01-15", "endDate": "2019-01-15", "location": "Lviv, Ukraine", "speaker": "Dmitrij Zaitzev", "title": "Lviv Kotlin User Group", "subject": "Drugs vs Money or Idiomatic DI with Kotlin", "url": "https://www.meetup.com/Lviv-Kotlin-User-Group/events/257283433/"}, {"lang": "en", "startDate": "2019-01-16", "endDate": "2019-01-16", "location": "Austin, TX, USA", "speaker": "William Cook", "title": "Austin Kotlin Meetup", "subject": "Kotlin Coroutines", "url": "https://www.meetup.com/Austin-Kotlin-Meetup/events/257636132/", "description": "<p>Start the new year by learning about the big feature of Kotlin 1.3, coroutines. Coroutines are an important language feature to understand, because they define how we accomplish asynchronous work in Kotlin.</p>"}, {"lang": "en", "startDate": "2019-01-16", "endDate": "2019-01-16", "location": "Kitchener, ON, USA", "speaker": "Andrew Arnott", "title": "Kotlin Waterloo P2P", "subject": "Lambda with Receiver", "url": "https://www.meetup.com/Kotlin-Waterloo-P2P/events/257343839/", "description": "<p>Andrew will demonstrate how Kotlin lambdas are more capable and efficient than Java lambdas. He will also demonstrate how lambdas with receiver enable higher levels of code re-use than Java.</p>"}, {"lang": "ru", "startDate": "2019-01-18", "endDate": "2019-01-18", "location": "Moscow, Russia", "speaker": "Alexander Nozik", "title": "Kotlin Moscow User Group", "subject": "Работа с TornadoFX в Kotlin-стиле", "url": "https://www.meetup.com/KotlinMoscow/events/256806522/", "description": "<p>Александр Нозик, старший научный сотрудник института ядерных исследований РАН и руководитель научной группы МФТИ, представит обзор возможностей JavaFX в целом и TornadoFX в частности. Будет продемонстрирована работа с TornadoFX в Kotlin-стиле. Также будет демо 3D-визуализации и мультиплатформенного использования TornadoFX и JS.</p>"}, {"lang": "ru", "startDate": "2019-01-18", "endDate": "2019-01-18", "location": "Moscow, Russia", "speaker": "Ilmir Usmanov", "title": "Kotlin Moscow User Group", "subject": "Kotlin Coroutines", "url": "https://www.meetup.com/KotlinMoscow/events/256806522/", "description": "<p>Ильмир Усманов, разработчик компилятора Kotlin из JetBrains, расскажет о корутинах - как они устроены внутри, какие преобразования делает компилятор, чтобы синхронный код превратить в асинхронный, как на низком уровне реализованы корутины и что на самом деле делают функции suspendCoroutine и resume.</p>"}, {"lang": "en", "startDate": "2019-01-19", "endDate": "2019-01-19", "location": "Orlando, FL", "speaker": "Kevin Galligan", "title": "GDG DevFest Florida", "subject": "Kotlin Multiplatform in Production", "url": "https://devfestflorida.org/schedule/2019-19-01?sessionId=207", "description": "<p>Kotlin Multiplatform tooling, language, and libraries have been emerging rapidly since mid-2018, and some major applications are launching into production. As Kotlin Multiplatform enters the mainstream, it will become increasingly valuable for mobile developers to understand what it is, how to think about shared architecture, what the status of the community currently is, and what to watch for updates on where the ecosystem goes in the future.</p>"}, {"lang": "en", "startDate": "2019-01-19", "endDate": "2019-01-19", "location": "Orlando, FL", "speaker": "Ian Thomas", "title": "GDG DevFest Florida", "subject": "Exploring Kotlin Multiplatform", "url": "https://devfestflorida.org/schedule/2019-19-01?sessionId=200", "description": "<p>Developing for multiple platforms is expensive and requires multiple disciplines. Kotlin Multiplatform provides a sane, cheap, and fast method to target multiple environments with the same codebase. Leveraging direct compilation to target environments, Kotlin Multiplatform can save you time and money sharing your business logic between your target platforms. By using a common build tool, you also save considerable learning costs typically associated with writing platform native code. In this talk, we will explore these possibilities and demonstrate how a single multiplatform project can be deployed to multiple target environments.</p>"}, {"lang": "en", "startDate": "2019-01-19", "endDate": "2019-01-19", "location": "Orlando, FL", "speaker": "Sam Edwards", "title": "GDG DevFest Florida", "subject": "DIY Dependency Injection with Kotlin", "url": "https://devfestflorida.org/schedule/2019-19-01?sessionId=200", "description": "<p>Dependency Injection seems like this SUPER complex topic that only the most senior developers understand. At the end of the day, it’s just “inversion of control” where instances of objects/classes are provided to you, instead of created by you. Kotlin’s language features allow us to do this concisely, without a library, and in this talk I’ll show you how to DO IT YOURSELF. This talk will demystify dependency injection and help you understand the huge benefits it provides for testing, maintainability and modularity.</p>"}, {"lang": "fr", "startDate": "2018-12-19", "endDate": "2018-12-19", "location": "Paris, France", "speaker": "Daniel Marin", "title": "Kotlin Paris Meetup", "subject": "Kotlin Native et Kotlin Multiplatform", "url": "https://www.meetup.com/Kotlin-Paris-Meetup/events/256817682/"}, {"lang": "fr", "startDate": "2018-12-19", "endDate": "2018-12-19", "location": "Paris, France", "speaker": "Benjamin Lacroix, Paul-Guillaume Dejardin", "title": "Kotlin Paris Meetup", "subject": "Koltin Dans Ton Cloud", "url": "https://www.meetup.com/Kotlin-Paris-Meetup/events/256817682/"}, {"lang": "ru", "startDate": "2019-01-18", "endDate": "2019-01-18", "location": "Moscow, Russia", "speaker": "Alexander Nosik, Ilnur Usmanov", "title": "Kotlin Moscow User Group", "subject": "Новогодний Kotlin - JavaFX, TornadoFX и корутины", "url": "https://devsday.ru/event/details/324", "description": "<p>Будет продемонстрирована работа с TornadoFX в Kotlin-стиле. Также будет демо 3D-визуализации и мультиплатформенного использования TornadoFX и JS.</p>\n<p>корутины - как они устроены внутри, какие преобразования делает компилятор, чтобы синхронный код превратить в асинхронный, как на низком уровне реализованы корутины и что на самом деле делают функции suspendCoroutine и resume.</p>"}, {"lang": "es", "startDate": "2018-12-20", "endDate": "2018-12-20", "location": "Santiago, Chile", "speaker": "Felipe López", "title": "Kotlin Santiago User Group", "subject": "Kotlin + Spring", "url": "https://www.meetup.com/KotlinSantiago/events/256580057/"}, {"lang": "es", "startDate": "2018-12-20", "endDate": "2018-12-20", "location": "Santiago, Chile", "speaker": "Roberto Osorio", "title": "Kotlin Santiago User Group", "subject": "Kotlin + Vertx", "url": "https://www.meetup.com/KotlinSantiago/events/256580057/"}, {"lang": "en", "startDate": "2019-01-02", "endDate": "2019-01-02", "location": "San Diego, CA", "speaker": "Ian Brandt", "title": "Kotlin Santiago User Group", "subject": "Monthly Kotlin!", "url": "https://www.meetup.com/sd-kotlin/events/hxkqbqyzcbdb/"}, {"lang": "en", "startDate": "2019-01-17", "endDate": "2019-01-17", "location": "Berlin, Germany", "speaker": "Ayelen Chavez, JB Lorenzo", "title": "Kotlin User Group Berlin", "subject": "Fast Prototypes with Flutter + Kotlin/Native", "url": "https://www.meetup.com/kotlin-berlin/events/tvhffpyzcbwb/"}, {"lang": "en", "startDate": "2019-01-22", "endDate": "2019-01-22", "location": "Amsterdam, The Netherlands", "speaker": "Alexey Soshin", "title": "Amsterdam Java User Group", "subject": "Kotlin Design Patterns", "url": "https://www.meetup.com/Amsterdam-Java-User-Group/events/257307488/", "description": "<p>Design patterns are just missing language features? In this talk we'll cover how different design patterns from \"Gang of Four\" are applied in Kotlin. Which are built in, which are easy to implement, and also some that are not necessary\nnow</p>"}, {"lang": "en", "startDate": "2019-01-31", "endDate": "2019-01-31", "location": "Limerick, Ireland", "speaker": "Tom Prior", "title": "Kotlin Limerick User Group", "subject": "Introducing Kotlin", "url": "https://www.meetup.com/kotlinlimerick/events/256998956/", "description": "<p>This talk will be an intro talk to the Kotlin Limerick group and also to Kotlin itself and its ecosystem. It will give a high level overview of the language all the exciting things that are happening in the Kotlin ecosystem from Kotin on the JVM to Kotlin Native.</p>"}, {"lang": "en", "startDate": "2019-01-31", "endDate": "2019-01-31", "location": "Limerick, Ireland", "speaker": "Tiernan Scully", "title": "Kotlin Limerick User Group", "subject": "Migrating from Java to Kotlin in Enterprise", "url": "https://www.meetup.com/kotlinlimerick/events/256998956/", "description": "<p>This talk will focus on how Teckro moved from using Java 8 to Kotlin in our spring boot microservices platform. We'll touch on how it happened, the benefits gained by switching and the lessons we learned along the way.</p>"}, {"lang": "en", "startDate": "2019-01-31", "endDate": "2019-01-31", "location": "Minneapolis, MN", "speaker": "Sean McQuillan", "title": "Twin Cities Kotlin User Group", "subject": "Kotlin Coroutines", "url": "https://www.meetup.com/Twin-Cities-Kotlin-User-Group/events/256748699/", "description": "<p>Kotlin coroutines are a new way to manage async operations on Android. Stable with Kotlin 1.3, now is a great time to explore using coroutines in your app. In this talk, you'll learn about the history of coroutines, how they work in Kotlin, and effective patterns for using coroutines on Android. The talk will also cover how to avoid common pitfalls and mistakes with using coroutines. After this talk you will have a good understanding of Kotlin coroutines and how to effectively use them on Android!</p>"}, {"lang": "en", "startDate": "2019-02-05", "endDate": "2019-02-05", "location": "Portland, OR, USA", "speaker": "Sean Massie", "title": "Kotlin Portland User Group", "subject": "Kotlin, standing on the shoulders of Giants.", "url": "https://www.meetup.com/Kotlin-Portland-User-Group/events/ttbqjqyzdbhb/", "description": "<p>This talk will be a discussion on the wonders of Java and what Kotlin has done to build on them.</p>"}, {"lang": "en", "startDate": "2019-01-31", "endDate": "2019-01-31", "location": "Arnhem, Netherlands", "speaker": "Coen Smid", "title": "Avisi Techdays", "subject": "Kotlin Multiplatform", "url": "https://www.meetup.com/Avisi-Techdays-Arnhem/events/256627293/", "description": "<p>Kotlin is a booming language. Its usage is skyrocketing in both apps and serverside applications. Frontend Kotlin is also emerging. And now (since Kotlin 1.2) Kotlin multiplatform has been announced and is currently in experimental. The philosophy: Write web, desktop, backend, Android and iOS apps in the same language and share code between your apps.\n<p>There are lots of advantages to this, many of which will be discussed during this Techday. Of course, we want to be at the front of this new development!</p>\n<p>So software developers, come and play. You will be supplied with a working base project, the knowledge to use it and lots of sparring partners and will build an application during the hands-on.</p>"}, {"lang": "en", "startDate": "2018-12-10", "endDate": "2018-12-10", "location": "Munich, Germany", "speaker": "Hadi Hariri", "title": "Kotlin User Group Munich", "subject": "Functional Programming with Kotlin", "url": "https://www.meetup.com/Kotlin-User-Group-Munich/events/256268476/"}, {"lang": "en", "startDate": "2018-12-10", "endDate": "2018-12-10", "location": "Munich, Germany", "speaker": "Enrique Lopez Manas", "title": "Kotlin User Group Munich", "subject": "Kotlin/Native for Multiplatform development", "url": "https://www.meetup.com/Kotlin-User-Group-Munich/events/256268476/"}, {"lang": "en", "startDate": "2018-12-10", "endDate": "2018-12-10", "location": "Copenhagen, Denmark", "speaker": "Mads Bjerg Frandsen", "title": "Kotlin Copenhagen", "subject": "Sequential applications using Coroutines", "url": "https://www.meetup.com/Kotlin-Copenhagen/events/256464752/", "description": "<p>This is a demonstration of how Coroutines can be used as a tool to describe your application as one sequential flow. We will go over the general architecture of an experimental application running on the JVM and Android.</p>"}, {"lang": "pt", "startDate": "2018-12-11", "endDate": "2018-12-11", "location": "São Paulo, Brazil", "speaker": "Rafael Toledo", "title": "Kotlin Meetup - São Paulo", "subject": "Convertendo um app Android para Kotlin Gradle DSL", "url": "https://www.meetup.com/kotlin-meetup-sp/events/256939932/"}, {"lang": "en", "startDate": "2018-12-04", "endDate": "2018-12-04", "location": "New York, NY, USA", "speaker": "Kevin Galligan", "title": "Brooklyn Kotlin", "subject": "Multi platform and native/iOS", "url": "https://www.meetup.com/Brooklyn-Kotlin/events/256381372/"}, {"lang": "pt", "startDate": "2018-12-11", "endDate": "2018-12-11", "location": "São Paulo, Brazil", "speaker": "Kassiano Resende", "title": "Kotlin Meetup - São Paulo", "subject": "Kotlin funcional", "url": "https://www.meetup.com/kotlin-meetup-sp/events/256939932/"}, {"lang": "en", "startDate": "2018-12-18", "endDate": "2018-12-18", "location": "Cambridge, MA", "speaker": "Ryan Batchelder", "title": "Kotlin Office Hours", "subject": "Adopting Kotlin at a 100 Year Old Insurance Company", "url": "https://www.meetup.com/kotlin-office-hours/events/256918125/", "description": "<p>The path to Kotlin adoption is different for everyone, and at an enterprise with deeply rooted tech, changing the primary programming language away from Java can be tough. This talk will dig into what our path looked like and how our team culture has grown around Kotlin, as well as things that we’ve learned along the way.</p>"}, {"lang": "en", "startDate": "2018-12-12", "endDate": "2018-12-12", "location": "Utrecht, Netherlands", "speaker": "Renaro de Paula Santos", "title": "Utrecht Kotlin Meetup", "subject": "Reactive Programming with Kotlin", "url": "https://www.meetup.com/meetup-group-YgJEOzCn/events/256270159/"}, {"lang": "en", "startDate": "2018-12-13", "endDate": "2018-12-13", "location": "Moscow, Russia", "speaker": "Sergey Alekhin", "title": "Kotlin Moscow", "subject": "Бэкенд и работа с данными через JOOQ", "url": "https://www.meetup.com/KotlinMoscow/events/256634128/"}, {"lang": "en", "startDate": "2018-10-20", "endDate": "2018-10-20", "location": "Lodz, Poland", "speaker": "Salomon Brys", "title": "Mobilization 2018", "subject": "Kotlin for Android, iOS & the mobile web", "url": "http://2018.mobilization.pl/index.html#ts-talks", "content": {"video": "https://www.youtube.com/watch?v=z8LAY3cFaAA"}, "description": "<p>Kotlin is an official language for Android development, but did you know you can use the Kotlin language to compile for iOS via LLVM as well as for the web via JS ?</p>\n<p>In this talk, I will show how to create a mobile application that runs on Android, on iOS and on the web while remaining true to each platform.</p>\n<p>We will see how to organize your code to share your business logic between platforms while keeping the presentation specific to each of them.</p>\n<p>Finally, we will discuss the current state of Kotlin multi-platform, as well as its future.</p>"}, {"lang": "en", "startDate": "2018-10-20", "endDate": "2018-10-20", "location": "Lodz, Poland", "speaker": "Marcin Moskała", "title": "Mobilization 2018", "subject": "Superpowers of Kotlin Delegation", "url": "http://2018.mobilization.pl/index.html#ts-talks", "content": {"video": "https://www.youtube.com/watch?v=h7YR4k70zoE"}, "description": "<p>Property delegation is pretty new feature in the programming world and most developers use only small amount of possibilities it provides. On the other hand, class delegation is known for decades and it was promoted by big authorities. All it needed was language support, which was introduced in Kotlin. On this session, we are going to dive into possibilities that Kotlin delegation gives. Let's discover this features and understand its superpowers.</p>"}, {"lang": "en", "startDate": "2018-10-20", "endDate": "2018-10-20", "location": "Lodz, Poland", "speaker": "Saul Diaz Gonzalez", "title": "Mobilization 2018", "subject": "An Arrow to the Kotlin", "url": "http://2018.mobilization.pl/index.html#ts-talks", "content": {"slides": "https://speakerdeck.com/sefford/an-arrow-to-the-kotlin"}, "description": "<p>Kotlin has been a revolution in the past two years, especially in the Android world which were using outdated versions of Java.</p>\n<p>The language leap is so high, that now we are even allowed to put some Functional Programming in the mix.</p>\n<p>This is being done through Arrow project, a FP typed library for Kotlin (and compatible with Java)\nBut, instead of doing a boring theroretical introduction to FP principles, we will see practical examplen on how we can complement our classic OOP with FP structures and patterns Arrow provides, and how can we apply them to have more concise and robust code.</p>"}, {"lang": "de", "startDate": "2018-11-22", "endDate": "2018-11-22", "location": "Bielefeld, Germany", "speaker": "Wolfram Rittmeyer", "title": "Bielefelder Kotlin User Group", "subject": "Exploring Coroutines in Kotlin", "url": "https://www.meetup.com/Bielefelder-Kotlin-User-Group/events/256037918/", "description": "<p>Seit etwas mehr als einem Jahr sind Kotlin Coroutines als experimentelles Feature erhältlich. Mit Kotlin 1.3 wurden sie jüngst in den offiziellen Sprachkern aufgenommen. In diesem Talk geht Wolfram darauf ein, welche Probleme sie lösen und was dabei zu beachten ist.</p>"}, {"lang": "en", "startDate": "2018-11-22", "endDate": "2018-11-22", "location": "Berlin, Germany", "speaker": "Alexander Podkhalyuzin, Roman Belov", "title": "Kotlin user group Berlin", "subject": "Kotlin Mutliplatform, reality and future plans", "url": "https://www.meetup.com/kotlin-berlin/events/254881619/", "description": "<p>One of the most successful multiplatform technologies is JVM, however, mobile platforms gave us new challenges, which nobody solved yet in a decent way.</p>\n<p>In this talk, we'll show you current possibilities of sharing Kotlin code between Android and iOS. It is quite new technology, so a lot of possibilities are open to you, not only for creating new apps in Kotlin but inventing new popular cross-platform libraries and we'll show how to achieve it as well. And for the talk final, we'll share some future possibilities about making a fullstack application using Kotlin and having common code between backend, frontend, and mobile apps. As part of the whole talk we will take a look into Kotlin/Native basics as it's default backend for iOS apps.</p>"}, {"lang": "en", "startDate": "2018-11-22", "endDate": "2018-11-22", "location": "Berlin, Germany", "speaker": "Thomas Sammons", "title": "Kotlin user group Berlin", "subject": "A Co-Platform Pairing Experience", "url": "https://www.meetup.com/kotlin-berlin/events/254881619/", "description": "<p>How different really is it to write a native iOS app compared with a native Android app? Are these platforms just different sides of the same coin?</p>\n<p>This will be a recounting of the experience of pair programming between iOS and Android. How we went about doing it, the good, bad and the ugly and some interesting insights we had along the way.</p>"}, {"lang": "en", "startDate": "2018-11-22", "endDate": "2018-11-22", "location": "Berlin, Germany", "speaker": "Ash Davies", "title": "Kotlin user group Berlin", "subject": "RxJava & Coroutines: A Practical Analysis", "url": "https://www.meetup.com/kotlin-berlin/events/254881619/", "description": "<p>Kotlin has taken the Android world by storm, and is quickly becoming the most popular language, with coroutines approaching stability, does it make sense to replace your RxJava implementations for Coroutines?</p>\n<p>Despite the hype, it may not make sense to jump on the bandwagon just yet, with RxJava having already proven its stability and usefulness, and in many cases the comparison between the two frameworks showing that they simply fit different purposes.</p>\n<p>In this talk, you can learn how you can utilise the strengths of each framework, how to correctly choose the best solution for the requirements of your project, whether it may be beneficial to migrate or run them concurrently, and how you can start doing so for your project.</p>"}, {"lang": "en", "startDate": "2018-11-22", "endDate": "2018-11-22", "location": "Budapest, Hungary", "speaker": "Adrián Bukros", "title": "Kotlin Budapest User Group", "subject": "Kotlin Multiplatform for Android and iOS", "url": "https://www.meetup.com/Kotlin-Budapest/events/255662160/", "description": "<p>In this presentation Adrian is going to guide you through a working example (with networking and JSON parsing) where you can share your business logic between Android and iOS with the help of Kotlin Multiplatform.</p>"}, {"lang": "en", "startDate": "2018-11-22", "endDate": "2018-11-22", "location": "Budapest, Hungary", "speaker": "Ádám Arold", "title": "Kotlin Budapest User Group", "subject": "Tips for writing Kotlin libraries", "url": "https://www.meetup.com/Kotlin-Budapest/events/255662160/", "description": "<p>In this talk we'll explore some of the minor but significant intricacies of developing libraries for Kotlin, including multiplatform projects.</p>"}, {"lang": "en", "startDate": "2018-11-27", "endDate": "2018-11-27", "location": "Stuttgart, Germany", "speaker": "Alexandros Koufatzis, Jerko Horvat", "title": "Kotlin User Group Stuttgart", "subject": "What's new in Kotlin 1.3", "url": "https://www.meetup.com/Kotlin-User-Group-Stuttgart/events/255951459/"}, {"lang": "en", "startDate": "2018-11-27", "endDate": "2018-11-27", "location": "Stuttgart, Germany", "speaker": "Jochen Traunecker", "title": "Kotlin User Group Stuttgart", "subject": "Polyglot backends with Kotlin and Ballerina", "url": "https://www.meetup.com/Kotlin-User-Group-Stuttgart/events/255951459/"}, {"lang": "en", "startDate": "2018-11-28", "endDate": "2018-11-28", "location": "Sydney, Australia", "speaker": "Christian Rolf", "title": "Sydney Kotlin User Group", "subject": "Kotlin Collections vs Java Streams", "url": "https://sydkotlin.space/#meetup-november-2018", "description": "<p>The Kotlin Collections API is great for processing complex data structures with readable code. But what’s the performance impact compared to using Java Streams? This talk will cover how to avoid the obvious pitfalls and when to chose readability over performance.</p>"}, {"lang": "en", "startDate": "2018-11-28", "endDate": "2018-11-28", "location": "Sydney, Australia", "speaker": "Shinoo Goyal", "title": "Sydney Kotlin User Group", "subject": "Exploring Kotlin Functions - Let’s have some fun()", "url": "https://sydkotlin.space/#meetup-november-2018", "description": "<p>The goal of this talk is learning about Kotlin functions and how they differ from the ones in Java. The discussion is around variety of scopes offered by Kotlin functions and variations on how they can be invoked. In addition, we will also take a look at lambdas and reified type parameters.</p>"}, {"lang": "en", "startDate": "2018-11-28", "endDate": "2018-11-28", "location": "Düsseldorf, Germany", "speaker": "Simon Wirtz", "title": "Kotlin User Group Düsseldorf", "subject": "Coroutines - Simple Concurrency with Kotlin", "url": "https://www.meetup.com/Dusseldorf-Kotlin-Meetup/events/256338819/", "description": "<p>The concept of a coroutine is fairly old already. In the 1960s, computer scientists began describing it, and since then, multiple languages have incorporated coroutines as a tool for writing asynchronous code.</p>\n<p>This talk will give an overview of Kotlin's approach to coroutines and how they help you structure your code.</p>\n<p>Let's see what coroutines are, how they look like and how they support us in writing concurrent code for the JVM, JavaScript and other platforms.</p>\n<p>It has never been a better time to get started with Kotlin coroutines as JetBrains has just released them in a 1.0 version.</p>"}, {"lang": "en", "startDate": "2018-11-28", "endDate": "2018-11-28", "location": "Kraków, Poland", "speaker": "Tomasz Godzik", "title": "Kraków Kotlin User Group", "subject": "Could Gradle be statically-typed? Meet build.gradle.kts", "url": "https://www.meetup.com/krakow-kotlin/events/256540817/", "description": "<p>In this talk we will try to introduce you to Gradle build tool and how you can get it working using Kotlin. We will try to show how you can benefit from using a statically typed language for your project builds.</p>"}, {"lang": "en", "startDate": "2018-11-28", "endDate": "2018-11-28", "location": "Kraków, Poland", "speaker": "Jon Pretty", "title": "Kraków Kotlin User Group", "subject": "A Fresh Approach to Compiling JVM Languages with Fury", "url": "https://www.meetup.com/krakow-kotlin/events/256540817/", "description": "<p>Java and Scala's open-source ecosystem faces several challenges. Writing and maintaining build configurations is too difficult, and publishing is even harder, coming with additional friction of having to support an increasing multiplicity of targets targets.</p>\n<p>But worse, this workflow puts a burden on a few key people in the open-source community to publish their libraries quickly so that their downstream users can publish theirs, and it can take months for some projects to be published. How is it that the multi-billion-dollar industry has become so dependent on so few people?</p>\n<p>I will introduce Fury, a fast, source-based dependency manager and build tool for JVM-based languages which aspires to radically disrupt the ecosystem for the better. Fury defines builds as static data, not code, making reasoning about them simple and fast. Fury facilitates a new, distributed and version-controlled ecosystem where publishing is as simple as tagging a signed commit. And builds can be external to projects, so there's no need to impose Fury upon any existing developers who are happy with their current build setup.</p>\n<p>The utopia we are striving for is a new, fluid and versatile ecosystem in which developers are liberated to publish more easily and frequently, and where it becomes easier for anyone to make contributions to open-source projects.</p>"}, {"lang": "en", "startDate": "2018-11-29", "endDate": "2018-11-29", "location": "Amsterdam, The Netherlands", "speaker": "Serdar Cinar", "title": "Kotlin.amsterdam", "subject": "Contract Programming", "url": "https://www.meetup.com/kotlin-amsterdam/events/256405355/", "description": "<p>Kotlin 1.3 introduced built-in support for Contracts to improve smart casting. In this talk, we will discover the \"Contract Programming\" principles and how to implement them in Kotlin. Although it is still immature and has limited capabilities, we will discuss the use cases and potential of Contracts in Kotlin’s future.</p>"}, {"lang": "en", "startDate": "2018-11-29", "endDate": "2018-11-29", "location": "Amsterdam, The Netherlands", "speaker": "Alexey Soshin", "title": "Kotlin.amsterdam", "subject": "Design Patterns with Kotlin", "url": "https://www.meetup.com/kotlin-amsterdam/events/256405355/", "description": "<p>\"Design Patterns\" by Gang of Four is one of the best known books about software. Some declare that those design patterns are obsolete, though. Are they? In this talk we'll cover some of them, and discuss whether they make sense in the Kotlin world.</p>"}, {"lang": "en", "startDate": "2018-12-04", "endDate": "2018-12-04", "location": "Portland, OR, USA", "speaker": "Jason Mauer", "title": "Kotlin Portland User Group", "subject": "Kotlin + Android = Crazy Delicious", "url": "https://www.meetup.com/Kotlin-Portland-User-Group/events/ttbqjqyxqbgb/", "description": "<p>Kotlin is the new hotness in Android development since Google announced its official support at last year’s IO conference. We’ll be going over the benefits of moving to Kotlin for Android, as well as tips and tricks for Android developers getting up to speed with the language.</p>"}, {"lang": "en", "startDate": "2018-12-17", "endDate": "2018-12-17", "location": "Oslo, Norway", "speaker": "Tadej Slamic", "title": "Oslo Kotlin Meetup", "subject": "Kotlin/Native, a brief introduction", "url": "https://www.meetup.com/meetup-group-nWeRbyMu/events/256643990/", "description": "<p>Kotlin/Native is all the hype these days. In this brief introduction, we'll cover the Kotlin/Native basics and go through a few examples on how to write multiplatform code. We'll see code that runs on Android, as well as iOS, and discuss the niceties and limitations of this new and exciting technology.</p>"}, {"lang": "es", "startDate": "2018-11-28", "endDate": "2018-11-28", "location": "México,Mexico", "speaker": "José Dimas", "title": "Facilito Talks Online #3", "subject": "Kotlin para el 2019", "url": "https://talks.codigofacilito.com/events/6", "description": "<p>José es Google Developer Expert en Android y Kotlin, además de tutor en CódigoFacilito. Para esta edición nos tiene un tema con las novedades que le esperan a Kotlin en el año que viene, en sus propias palabras, no es predecir el futuro, son cosas que ya se anunciaron.</p>"}, {"lang": "en", "startDate": "2018-12-11", "endDate": "2018-12-11", "location": "Palo Alto, California", "speaker": "Florina Muntenescu", "title": "DevFest onAir", "subject": "Shaping your app’s architecture with Kotlin and Architecture Components", "url": "https://devfest.withgoogle.com/events/devfestonair18#schedule", "description": "<p>Many apps began adopting Kotlin and Android Architecture Components atthe same time. While ostensibly quite different, the interplay of these two changes ends up heavily influencing each other.</p>\n<p>Plaid is an open source example of material design concepts. It has a complex functionality but had a large amount of technical debt. We took the challenge of refactoring the app, following the Android Guide to App Architecture, while simultaneously converting the app to Kotlin—while keeping the existing functionality, fixing broken API integrations and adding new ones.</p>\n<p>The Guide to App Architecture provided a good starting point for creating lean, isolated classes. Kotlin features like delegates, high order functions and lambdas, sealed classes and others, end up shaping much of the architecture of the app. This talk covers the architecture lessons learned while converting Plaid to Kotlin and integrating Architecture Components.</p>"}, {"lang": "en", "startDate": "2018-12-04", "endDate": "2018-12-04", "location": "Seattle, WA", "speaker": "Giorgio Natili", "title": "Seattle Android Developers", "subject": "Funtastic Kotlin", "url": "https://www.meetup.com/Seattle-Android-Developers/", "description": "<p>Kotlin was on the market for a while when Google announced its official support in Android over one year ago. This announcement consolidated an already rich user base and brought new enthusiasm to the language making it a de-facto standard tool for Android development.</p>\n<p>Kotlin supports both the object-oriented and functional programming paradigms. Even more, its support for high-order functions, extension functions, scoping functions, lambdas, and immutable values can revolutionize the way Android apps get developed.</p>\n<p>In Kotlin you define a function with the fun keyword, and I have to say it, no better choice for a language keyword!</p>\n<p>During this talk, I will show you all the peculiarities of Kotlin's functions and drive you through the transformation that you can apply to an existing Android code base and make it functional, testable, and, even more, easy to read.</p>"}, {"lang": "en", "startDate": "2018-12-04", "endDate": "2018-12-04", "location": "Athens, Greece", "speaker": "Antonis Lilis", "title": "Kotlin Athens", "subject": "An introduction to Kotlin Coroutines", "url": "https://www.meetup.com/Kotlin-Athens/events/256326323/", "description": "<p>Coroutines that fascinated devs from its early beta have graduated the experimental phase and are now stable 🎓. Coroutines provide a way to write asynchronous code sequentially making multithreaded programming more debuggable and maintainable. In this presentation Antonis will try to guide you through the main features of Coroutines that make it so special.</p>"}, {"lang": "en", "startDate": "2018-12-05", "endDate": "2018-12-05", "location": "Brussels, Belgium", "speaker": "Jolanda Verhoef", "title": "Kotlin Belgium User Group", "subject": "Introduction to Android programming with Kotlin.", "url": "https://www.meetup.com/Kotlin-User-Group-Belgium/events/256069950/", "description": "<p>Introduction to Android programming with Kotlin by Jolanda from Coolblue!\nGoogle officially supports Kotlin as a programming language for Android Development. So if you know Kotlin, you might as well become an Android Developer!</p>\n<p>During this evening we will dive into the world of Android. Jolanda will first explain how programming for Android devices differs from programming for servers. Then we will follow one of Google's Codelabs, which will walk you through creating your very first Android App.</p>"}, {"lang": "fr", "startDate": "2018-11-13", "endDate": "2018-11-13", "location": "Rennes, France", "speaker": "Louis CAD", "title": "AndroidRennes", "subject": "Escaping Callback Hell with coroutines", "url": "https://www.meetup.com/AndroidRennes/events/256142960/", "content": {"video": "https://www.youtube.com/watch?v=fcaYIK4Ug9w&feature=youtu.be"}, "description": "<p>Les coroutines, c'est stable depuis quelques jours dans Kotlin 1.3, mais ça fait depuis la version 1.1 que des gens se sont fait les dents dessus avec la version expérimentale, qui a fait des merveilles en production ! Dans Android, il y a un tas de callbacks et d'événements asynchrones, ce qui conduit facilement au plus bas de l'enfer : les callback hells. Un callback hell, c'est une pâte à base de vieux spaghettis collants, que vous devez manger à chaque fois que vous remettez des pâtes pour rajouter des fonctionnalités ou effectuer de la maintenance. Certains diététiciens préconisent de transformer ça en jolis streams de spaghettis en passant à la programmation réactive, mais cela demande beaucoup d'effort quand il s'agit d'arrondir les coins pour faire un cercle. Entre temps, les chercheurs de chez JetBrains et leurs disciples ont mis au point des pâtes qui se cuisinent beaucoup plus facilement dans tous les sens : les coroutines. Sans métaphore, les coroutines permettent d'avoir un code asynchrone et séquentiel en même temps. Dans cette session de live coding, vous verrez comment il est possible avec moins de code de faire plein de choses routinières, comme accéder à une base de données Room hors du main thread, filmer avec l'API Camera2 en 5 lignes de code (dont 4 lignes pour le try/catch), faire des appels à une API/webservice, et attendre n'importe quel callback sans jamais attaquer la lisibilité de votre code.</p>"}, {"lang": "nl", "startDate": "2018-12-13", "endDate": "2018-12-13", "location": "Rotterdam, Netherlands", "speaker": "Dennis Geurts, Tom Sabel", "title": "Luminis Rotterdam Brain Upgrade", "subject": "Kotlin en Android", "url": "https://www.meetup.com/LuminisBrainUpgrade/events/256370884/", "description": "<p>Découverte : La programmation orienté objet en Kotlin : 20 minutes en livecoding pour découvrir la syntaxe et les outils proposés.</p>\n<p>Confirmé : Tests unitaires, une bonne recette. Comment rendre vos tests unitaires plus lisible et concis avec\nKotlin.</p>"}, {"lang": "en", "startDate": "2018-09-12", "endDate": "2018-09-12", "location": "Kitchener, Canada", "speaker": "Dan Rusu, Kyle Platt", "title": "Kotlin Waterloo P2P", "subject": "Introduction to Kotlin", "url": "https://www.meetup.com/Kotlin-Waterloo-P2P/events/252746912/", "content": {"slides": "https://speakerdeck.com/determinant/intro-to-kotlin"}, "description": "<p>This is an introduction to the Kotlin programming language. We'll include a brief look at some awesome features of this modern language as well as the many benefits. Kotlin is a free and open source programming language designed by JetBrains. It can be used for Android, JVM server back-end, javascript, as well as native development such as IOS. Come and enjoy some refreshments while we discuss Kotlin, objectives, and plans for this group.</p>"}, {"lang": "ru", "startDate": "2018-08-23", "endDate": "2018-08-23", "location": "Novosibirsk, Russia", "speaker": "Ilya Matveyev", "title": "JUGNsk", "subject": "Kotlin вообще и Native в частности", "url": "https://www.meetup.com/JUGNsk/events/253327525/", "content": {"slides": "https://speakerdeck.com/jugnsk/jugnsk-meetup-number-3-il-ia-matvieiev-kotlin-voobshchie-i-native-v-chastnosti-1"}, "description": "<p>Наверняка многие слышали о таком языке для JVM, как Котлин. Однако далеко не все знают, что он также компилируется в JavaScript или в нативный код для различных платформ. В этом докладе мы постараемся пролить свет на поддержку мультиплатформенных проектов, а также расскажем о том, как мы компилируем Котлин в машинный код, какие сложности при этом встречаются и какие возможности дает это пользователю.</p>"}, {"lang": "ru", "startDate": "2018-08-23", "endDate": "2018-08-23", "location": "Almaty, Kazakhstan", "speaker": "Janibek Marshal", "title": "JDrinkUp Almaty", "subject": "Почему Android разработчики переходят на Kotlin", "url": "https://www.meetup.com/DrinkUp-Almaty/events/253866558/", "content": {"slides": "https://speakerdeck.com/johnmars/pochiemu-android-razrabotchiki-pieriekhodiat-na-kotlin"}, "description": null}, {"lang": "en", "startDate": "2018-10-04", "endDate": "2018-10-04", "location": "Kraków, Poland", "speaker": "Piotr Ślesarew", "title": "MobiConf 2018", "subject": "Magic sugars that can make your Kotlin codebase happier", "url": "https://2018.mobiconf.org/schedule/", "content": {"video": "https://www.youtube.com/watch?v=BGrZbMm1aHY"}, "description": "<p>Kotlin language brings tons of new concepts and features to your miserable programming life and it is really hard to use all of them in your daily duties. After almost two years of using Kotlin in production, the language itself can give me joy and satisfaction.</p>\n<p>How is it possible? Because of its many small sweet sugars 🍰. In this talk, I would like to share with you my favorite Kotlin candies that I discovered when I was in need of writing robust and concise components for Android applications.</p>"}, {"lang": "en", "startDate": "2018-10-04", "endDate": "2018-10-04", "location": "Kraków, Poland", "speaker": "Ivan Morgillo", "title": "MobiConf 2018", "subject": "Kotlin coroutines – A story of an old code base, dozens of reactive streams, a new language and a new\n            way for concurrency.", "url": "https://2018.mobiconf.org/schedule/", "content": {"video": "https://www.youtube.com/watch?v=tOjdn1NDULM"}, "description": "<p>In a world dominated by RX and Java based code bases, JetBrains introduced Kotlin and coroutines - a simpler way to do multithreading.</p>\n<p>This is the story of how I migrated an old project from a monolithic Java mess with improperly used RxJava to a cleaner architecture, based on Kotlin, coroutines and common sense.</p>"}, {"lang": "ja", "startDate": "2018-08-25", "endDate": "2018-08-25", "location": "Tokyo, Japan", "speaker": "Toshihiro Yagi", "title": "Kotlin Fest 2018", "subject": "Kotlin コルーチンを 理解しよう", "url": "https://kotlin.connpass.com/event/91666/", "content": {"slides": "https://speakerdeck.com/sys1yagi/kotlin-korutinwo-li-jie-siyou"}, "description": null}, {"lang": "ja", "startDate": "2018-08-25", "endDate": "2018-08-25", "location": "Tokyo, Japan", "speaker": "Akinori Yamada", "title": "Kotlin Fest 2018", "subject": "Kotlin で愛でる Microservices", "url": "https://kotlin.connpass.com/event/91666/", "content": {"slides": "https://speakerdeck.com/stormcat24/kotlin-fest"}}, {"lang": "en", "startDate": "2018-08-29", "endDate": "2018-08-29", "location": "Tallinn, Estonia", "speaker": "Anton Arhipov", "title": "Advanced Java Estonia", "subject": "Kotlin DSL in 60 minutes", "url": "https://www.meetup.com/Advanced-Java-Estonia/events/253565335/", "content": {"video": "https://www.youtube.com/watch?v=lLUo5daDgAc"}, "description": "<p>Learn how to create type-safe and statically typed DSLs in Kotlin. The session starts with an introduction to DSL related Kotlin language features. Next, we create a simple DSL in a live coding session and then continue adding expressiveness and language features. We cover a number of examples, like JSON or XML builder's, data binding, configuration & template engines</p>"}, {"lang": "en", "startDate": "2018-09-13", "endDate": "2018-09-13", "location": "Tel Aviv-Yafo, Israel", "speaker": "Ohad Shai", "title": "KotlinTLV", "subject": "Klean that Code, Boil those Boilerplates", "url": "https://www.meetup.com/KotlinTLV/events/254246117/", "content": {"slides": "https://speakerdeck.com/oshai/klean-that-code-boil-those-boilerplates"}, "description": null}, {"lang": "en", "startDate": "2018-09-13", "endDate": "2018-09-13", "location": "Tel Aviv-Yafo, Israel", "speaker": "Yair Palti", "title": "KotlinTLV", "subject": "Static & Singleton in Java vs Kotlin", "url": "https://www.meetup.com/KotlinTLV/events/254246117/", "content": {"slides": "https://speakerdeck.com/yairp/static-and-singleton-in-java-vs-kotlin"}, "description": null}, {"lang": "en", "startDate": "2018-10-20", "endDate": "2018-10-20", "location": "Lugano, Switzerland", "speaker": "Marharyta Nedzelska", "title": "Voxxed Days Ticino 2018", "subject": "Kotlin: lazy language for lazy people", "url": "https://cfpvdt18.confinabox.com/talk/HIC-9228", "content": {"video": "https://www.youtube.com/watch?v=xTYKuI4HSWc"}, "description": "<p>A few years ago you had to work hard to succeed in some fields. Nowadays you don’t need to work hard but to work smart. So this means that most of the time laziness (of course not extremely) is useful for our productivity. On the other hand, laziness is extremely important when you work with a large amount of data and reduced space or power. In this talk we will try to cover all aspects of laziness in Kotlin: starting from lazy initialization of properties using delegates, lazy collections, sequences and, finally, laziness with coroutines. The main thing we would like to talk about is how to use this laziness and be productive with it. To see one more benefit of laziness in Kotlin we’ll refactor a real application to use lazy calculations.</p>"}, {"lang": "en", "startDate": "2018-09-18", "endDate": "2018-09-18", "location": "Utrecht, Netherlands", "speaker": "Paulien van Alst", "title": "Utrecht Java User Group", "subject": "How to build a Kotlin enterprise application.", "url": "https://www.meetup.com/Utrecht-Java-User-Group/events/250843631/", "content": {"slides": "https://github.com/utrechtjug/slides/blob/master/180918_KotlinWorkshop.pdf"}, "description": "<p>Kotlin is the new JVM language where all the best practices of programming come together. Looking forward to discover a language that will support you in writing readable and understandable code in the fewest lines possible? Without any help of any extra libraries such as Lombok, Guava and even more, Kotlin will challenge you to write code that even the business analyst should be able to understand. With Kotlin you can finally focus on the business features you want to implement instead working on the language itself. In this workshop, you will build a simple webservice in Kotlin and hopefully see how easy it can be to write new business functionality.\n- Exercise 1 : (data) classes, collections and types\n- Exercise 2 : inheritance, interfaces and extension functions\n- Exercise 3 : how to integrate Kotlin with Spring</p>"}, {"lang": "ja", "startDate": "2018-09-11", "endDate": "2018-09-11", "location": "Tokyo, Japan", "speaker": "Taro Nagasava", "title": "Kotlin Fest 2018", "subject": "How to Test Server-side Kotlin", "url": "https://connpass.com/event/100752/", "content": {"slides": "https://speakerdeck.com/ntaro/how-to-test-server-side-kotlin"}}, {"lang": "en", "startDate": "2018-09-17", "endDate": "2018-09-17", "location": "Dublin, Ireland", "speaker": "Tomás Hanley", "title": "Dublin Kotlin User Group", "subject": "Asynchronous Kotlin Web Server with Ktor", "url": "https://www.meetup.com/Dublin-Kotlin-User-Group/", "content": {"slides": "https://slides.com/tomashanley/kotlin-intro-starting-the-koans-4-7-8/#/"}, "description": "<p>In this session, we’re going to explore how to create a standalone server application using Ktor. We'll work through a series of exercises to get familiar with Ktor, with the idea of build a web service for ordering food for our drone delivery app.</p>"}, {"lang": "en", "startDate": "2018-09-22", "endDate": "2018-09-22", "location": "Vienna, Austria", "speaker": "Lukas Lechner", "title": "droidcon Vienna 2018", "subject": "How 'Effective Java' influenced Kotlin", "url": "https://droidcon.at/schedule/#session-112", "content": {"slides": "https://speakerdeck.com/lukle/how-effective-java-influenced-kotlin"}, "description": "<p>One of the most popular Java books is 'Effective Java' from Joshua Bloch, which describes how to avoid common mistakes, how to deal with Java's weaknesses, and how best practices for the language look like. When Jetbrains started to create a 'better Java' with Kotlin, a lot of ideas about how to make a better language came from the information of 'Effective Java' and lots of design decisions are based on the book. In this talk the audience will learn how the book influenced the language design and the compiler of Kotlin and in what way the book is deeply ingrained into the language.</p>"}, {"lang": "en", "startDate": "2018-10-07", "endDate": "2018-10-07", "location": "Minsk, Belarus", "speaker": "Marcin Moskala", "title": "Mobile Optimazed 2018", "subject": "Kotlin Coroutines in action", "url": "https://moconf.by/#talk_android_moskala", "description": "<p>Kotlin Coroutines fascinate from its early beta. They are a new way to write asynchronous and non-blocking code. They can be thought of as light-weight threads without having to deal with all the problems that threads bring to the table.</p>\n<p>In this talk Marcin will show how to use Kotlin Coroutines and what makes them so special and so efficient. He will also discuss if they are an alternative to RxJava.</p>"}, {"lang": "ru", "startDate": "2018-09-06", "endDate": "2018-09-06", "location": "Minsk, Belarus", "speaker": "Sergey Kryukov", "title": "Belarus Kotlin User Group", "subject": "Введение в OPENRNDR", "url": "https://bkug.by/", "content": {"video": "https://www.youtube.com/watch?v=5UPO553U-w4"}, "description": "<p>Продолжаю тему “нецелевого” использования языка Kotlin. В этот раз поговорим об OPENRNDR — фреймворке для креативного программирования, как убеждают его авторы. Так ли это? Проверим на практике.</p>"}, {"lang": "ru", "startDate": "2018-09-06", "endDate": "2018-09-06", "location": "Minsk, Belarus", "speaker": "Roman Artemiev", "title": "Belarus Kotlin User Group", "subject": "Kotlin/JS", "url": "https://bkug.by/", "content": {"video": "https://www.youtube.com/watch?v=X4-GgdAG0ZM"}, "description": "<p>В докладе речь пойдет про Kotlin/JS, я расскажу что это такое и зачем нужно в контексте Kotlin MPP (Multiplatform Projects). Покопаемся под капотом у компилятора, познакомимся с полезными инструментами для разработки на Kotlin/JS. Немного затронем будущее этого направления языка, а также постараемся ответить на самые волнующие сообщество вопросы. Приходите, будет интересно!</p>"}, {"lang": "fr", "startDate": "2018-10-03", "endDate": "2018-10-03", "location": "Paris, France", "speaker": "Sergio Dos Santos, Benjamin Lacroix", "title": "Le Mois Du Kotlin", "subject": "Kotlin ? D’accord, mais aide moi à convaincre mon PO !", "url": "https://le-mois-du-kotlin.xebia.fr/#schedule", "content": {"video": "https://www.youtube.com/watch?v=LdHVbhcPxNc"}, "description": "<p>Kotlin fait petit à petit son chemin dans les entreprises, et pas seulement sur Android ! Quels sont les avantages du langage par rapport à Java, par rapport aux autres langages back-end et même par rapport à Javascript ? D'où vient Kotlin ? Faut-il migrer les applications et former les équipiers ? Peut-on réaliser des applications de qualité, qui dureront dans le temps ? Quels sont les outils à notre disposition ?\nSi vous vous posez toutes ces questions, ou si vous souhaitez seulement en savoir plus sur ce prochain langage d'importance, venez, cette conférence est faite pour vous !</p>"}, {"lang": "fr", "startDate": "2018-10-03", "endDate": "2018-10-03", "location": "Paris, France", "speaker": "Simone Civetta", "title": "Le Mois Du Kotlin", "subject": "Frameworks multi-plateformes partagés avec Kotlin / Native", "url": "https://le-mois-du-kotlin.xebia.fr/#schedule", "content": {"video": "https://www.youtube.com/watch?v=avGd1PJqKZE"}, "description": "<p>Bien que la création d'applications inter-plates-formes complètes puisse souvent s'avérer être une mauvaise idée, une logique spécifique à un client peut grandement bénéficier d'un code unique, permettant à la fois d'écrire et de tester le code. Depuis fin 2016, Kotlin/Native peut compiler du code Kotlin sous une forme binaire, qui peut ensuite être intégrée dans une application native. Dans cette présentation, vous apprendrez pourquoi il est logique et efficace d'exploiter ces fonctionnalités expérimentales et de créer un module multi-plateforme réutilisable sur Android et iOS.</p>"}, {"lang": "en", "startDate": "2018-07-19", "endDate": "2018-07-19", "location": "Denver, CO, USA", "speaker": "Nick Capurso", "title": "360|AnDev July 2018", "subject": "Kotlin Coroutines: An Intro to Practical Use on Android", "url": "https://360andev.com/sessions/kotlin-coroutines-an-intro-to-practical-use-on-android/", "description": "<p>Asynchronous programming has always been a challenging problem for Android developers. Any good solution has to gracefully handle errors, cancellation, chaining multiple actions together, handle thread swapping, and much more.</p>\n<p>Kotlin’s coroutines are yet another option for asynchronous programming. However, unlike other popular contenders, coroutines meet all the previously mentioned requirements out-of-the-box, have a gentler learning curve, and don’t require you to write an absurd amount of boilerplate.</p>\n<p>That said, learning any new asynchronous solution takes time and often comes with a period of trial-and-error until you have all the nuances figured out. Get a jumpstart on coroutines:</p>\n<p>(1) Lessen the learning curve by getting the subtleties of coroutines out of the way early\n(2) Learn how to work coroutines into an existing app: easy places to start transitioning, interop with existing libraries, and reusing existing threading constructs\n(3) Learn how to easily support error handling, cancellation, and task chaining\n(4) Learn how to unit test coroutines</p>\n<p>Get a head start on coroutines in your apps and easily write, test, and maintain asynchronous code like never before!</p>"}, {"lang": "en", "startDate": "2018-07-20", "endDate": "2018-07-20", "location": "Denver, CO, USA", "speaker": "Oluwasegun Famisa", "title": "360|AnDev July 2018", "subject": "Kotlin, Beyond the Basics", "url": "https://360andev.com/sessions/kotlin-beyond-the-basics/", "description": "<p>In this talk, we will look at how you should not do things with Kotlin. For example, we will talk about misusing scoping functions like “let”, “run”, “apply”, etc. and learn the right time to use which one while not overusing them. We will also talk about interoperability between Kotlin and Java. We will look at how not to do things when building APIs that may be consumed in Java – things like top-level constant declaration vs constants within companion objects, making use Jvm* annotations in Kotlin vs not using them.</p>\n<p>We will also talk about platform types and the potential harm they pose when calling Java code from Kotlin. We will also address another commonly overlooked topic – the fact that Kotlin encourages a new paradigm of programming where you’re not thinking in terms of steps (imperative) but rather, in terms of functions applied to parameters (functional programming) and we still find ourselves doing things the wrong way.</p>"}, {"lang": "en", "startDate": "2018-07-20", "endDate": "2018-07-20", "location": "Denver, CO, USA", "speaker": "Joshua Lamson", "title": "360|AnDev July 2018", "subject": "Custom Drawing with Canvas in Kotlin", "url": "https://360andev.com/sessions/custom-drawing-with-canvas-in-kotlin/", "description": "<p>When you’re creating a new View to display some complex data, it’s easy for the number of View objects you’re using to get out of control. Between elaborate shapes, shaders/colors, and text in specific places and orientations, using only Android Views and layouts can turn your layout into a dense, complicated mess. Luckily, there’s a better way to add all your customizations. What you need is a blank Canvas! (Literally, android.graphics.Canvas).</p>\n<p>In this session, we’ll delve into the details of using a Canvas to display anything you need in a truly custom way, explaining it all through simple examples written in Kotlin. You’ll leave this talk knowing how override the behavior of View, ViewGroup, and Drawable to draw custom shapes, paths, and text on the Canvas.</p>"}, {"lang": "en", "startDate": "2018-07-20", "endDate": "2018-07-20", "location": "Denver, CO, USA", "speaker": "Joshua Lamson", "title": "From Kotlin Vienna", "subject": "Custom Drawing with Canvas in Kotlin", "url": "https://360andev.com/sessions/custom-drawing-with-canvas-in-kotlin/", "description": "<p>When you’re creating a new View to display some complex data, it’s easy for the number of View objects you’re using to get out of control. Between elaborate shapes, shaders/colors, and text in specific places and orientations, using only Android Views and layouts can turn your layout into a dense, complicated mess. Luckily, there’s a better way to add all your customizations. What you need is a blank Canvas! (Literally, android.graphics.Canvas).</p>\n<p>In this session, we’ll delve into the details of using a Canvas to display anything you need in a truly custom way, explaining it all through simple examples written in Kotlin. You’ll leave this talk knowing how override the behavior of View, ViewGroup, and Drawable to draw custom shapes, paths, and text on the Canvas.</p>"}, {"lang": "en", "startDate": "2018-07-07", "endDate": "2018-07-07", "location": "Alexandria, Egypt", "speaker": "Shady Selim", "title": "GDG Alexandria", "subject": "Kotlin Updates in from the Google I/O", "url": "https://www.meetup.com/GDG-Alexandria/events/247743156/", "description": "<p>Will summarize all the Kotlin talks and updates that was mentioned in the Google I/O 2018</p>"}, {"lang": "en", "startDate": "2018-07-07", "endDate": "2018-07-07", "location": "Bhubaneswar, India", "speaker": "Sriyank Siddhartha", "title": "GDG Bhubaneswar", "subject": "The Power of Kotlin Language", "url": "https://www.meetup.com/GDG-Bhubaneswar/events/249694826/", "description": "<p>Leverage the power of Koltin with its amazing features and get a sneak peak of its application in Android.</p>"}, {"lang": "en", "startDate": "2018-07-09", "endDate": "2018-07-09", "location": "Bangalore, India", "speaker": "Chandra Sekhar Nayak", "title": "BangaloreJUG", "subject": "Introduction to Kotlin", "url": "https://www.meetup.com/BangaloreOpenJUG/events/250733205/", "content": {"slides": "https://speakerdeck.com/chansek/introduction-to-kotlin"}, "description": "<p>An introduction to Kotlin for Java developers. This is presented at BangaloreJUG meetup's June 2018 meet.</p>"}, {"lang": "en", "startDate": "2018-07-07", "endDate": "2018-07-07", "location": "Alexandria, Egypt", "speaker": "Wessam Elsharawy", "title": "GDG Alexandria", "subject": "(Flutter - Angular - Kotlin) in parallel", "url": "https://www.meetup.com/GDG-Alexandria/events/247743156/", "description": null}, {"lang": "en", "startDate": "2018-07-09", "endDate": "2018-07-09", "location": "Dublin, Ireland", "speaker": "Tomás Hanley", "title": "Dublin Kotlin Meetup", "subject": "Intro to Kotlin & starting the Kotlin Koans", "url": "https://www.meetup.com/Dublin-Kotlin-Meetup/events/251790075/", "description": "<p>We'll be starting with a presentation on Kotlin, what it is, why you should use it, and why we're passionate about adopting it!</p>"}, {"lang": "en", "startDate": "2018-07-10", "endDate": "2018-07-10", "location": "Omaha, NE", "speaker": "Parshav Chauhan", "title": "Google Developer Group Omaha", "subject": "Kotlin Λrrow", "url": "https://www.meetup.com/GDGOmaha/events/251531835/", "description": null}, {"lang": "it", "startDate": "2018-08-25", "endDate": "2018-08-25", "location": "Levante, Italy", "speaker": "Roberto Orgiu", "title": "GDG DevFest Levante", "subject": "Kotlin 101", "url": "http://devfestlevante.eu/", "description": "<p>Benvenuti nell'universo Android! Roberto Orgiu, GDE Android ci introdurrà Kotlin il nuovo linguaggi di programmazione di IntelliJ e promosso come linguaggio principale su Android insieme a Java</p>"}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Kevin Galligan", "title": ".droidconSF", "subject": "Kotlin Multiplatform In Production", "url": "https://sf.droidcon.com", "description": "<p>Kotlin Native, with the ability to produce iOS code, was announced at KotlinConf 2017. With rapid progress on the runtime and tools, and intense community interest, several major architectural libraries have been released. KotlinConf 2018 will definitely see significant releases both, in both libraries and tools, and likely an official v1 of Kotlin Native.</p>\n<p>2019 will be the year of significant application releases with a shared architectural base, powered by Kotlin multiplatform. This talk will be about the framework, how it compares (favorably) to other options, the current state of the ecosystem, and where developers eager to get involved in significant open source contributions can get started.</p>"}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Juliano Moraes", "title": ".droidconSF", "subject": "Netflix's componentization architecture with RxJava + Kotlin", "url": "https://www.sf.droidcon.com/sessions-1", "description": "<p>Recently we rewrote the Netflix's player UI using a new architecture that allows great reusability, testability and extendability.</p>\n<p>This talk is about our journey from a monolithic fragment to several independent and reusable components and how it is helping us to move fast with our AB tests.</p>"}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Aleksei Zakharov", "title": ".droidconSF", "subject": "Minimalist Dependency Injection in Kotlin", "url": "https://www.sf.droidcon.com/sessions-1", "description": null}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Brent Watson", "title": ".droidconSF", "subject": "Advanced Kotlin", "url": "https://www.sf.droidcon.com/sessions-1", "description": "<p>If you want to up your Kotlin game, come check out some advanced language features. Some of the things we'll cover are: delegates, covariance/contravariance, tailrec, sealed classes, kotlin's reflection API, coroutines, and more.</p>"}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Cecilia Castillo", "title": ".droidconSF", "subject": "If your code looks like it's Kotlin & quacks like it's Kotlin, then it probably is Swift.", "url": "https://www.sf.droidcon.com/sessions-1", "content": {"video": "https://www.youtube.com/watch?v=7OpnYIDlwGA"}, "description": null}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Israel Ferrer Camacho", "title": ".droidconSF", "subject": "From Effective Java to Effective Kotlin", "url": "https://www.sf.droidcon.com/sessions-1", "description": null}, {"lang": "en", "startDate": "2018-11-19", "endDate": "2018-11-19", "location": "San Francisco, CA, USA", "speaker": "Joaquim Verges", "title": ".droidconSF", "subject": "Quick and clean prototypes that scale with Helium: a reactive MVP framework in Kotlin", "url": "https://www.sf.droidcon.com/sessions-1", "content": {"video": "https://www.youtube.com/watch?v=Q-CDUjxYygs"}, "description": null}, {"lang": "en", "startDate": "2018-11-20", "endDate": "2018-11-20", "location": "Copenhagen, Denmark", "speaker": "Roman Elizarov", "title": "Goto Conference", "subject": "Fresh Async With Kotlin", "url": "http://gotocph.com", "description": "<p>Asynchronous programming is on the rise. Modern software systems are connected and constantly communicating. Programming languages are adding some form of asynchronous programming like async/await. However, Kotlin had taken a fresh approach to this problem with Kotlin Coroutines.</p>\n<p>In this talk, we’ll study various approaches to asynchronous programming, their evolution, differences and similarities. We’ll see the problem with the traditional async/await approach that is based on futures/promises and how the Kotlin’s solution that is based on concepts of coroutines and continuations is giving us safer and easier programming model.</p>"}, {"lang": "en", "startDate": "2018-11-23", "endDate": "2018-11-23", "location": "Copenhagen, Denmark", "speaker": "Roman Elizarov", "title": "Goto Conference", "subject": "Asynchronous Programming with Kotlin", "url": "http://gotocph.com", "description": "<p>This workshop covers asynchronous programming in Kotlin using coroutines. It starts with basics of asynchronous programming and its differences from blocking code and introduces concepts of suspending functions and coroutines. Dealing with the ecosystem of blocking code on JVM is covered in depth as well as best practices for managing cancellation of asynchronous operations. The workshop also covers more advanced topics of concurrent decomposition of work via futures, deep dive into coroutine contexts and includes an overview of Communication Sequential Process (CSP) approach and channels.</p>"}, {"lang": "en", "startDate": "2018-11-20", "endDate": "2018-11-20", "location": "Malmö, Sweden", "speaker": "Kevin Most", "title": "Øredev", "subject": "Idiomatic Interop with Kotlin", "url": "http://oredev.org/2018/sessions#sessions_DayLink-2_", "description": "<p>One of Kotlin's most valuable features is its 100% Java interop</p>\n<p>However, your clean Java code might not look so clean from Kotlin, and vice versa</p>\n<p>We will discuss strategies to write code in either language, to be consumed in either language, that is safe, elegant, and idiomatic</p>\n<p>We will also touch on Kotlin's interop story for other targets (common, JS, and native) and what you can do there</p>"}, {"lang": "en", "startDate": "2018-11-21", "endDate": "2018-11-21", "location": "Malmö, Sweden", "speaker": "Simon Harrer", "title": "Øredev", "subject": "Domain-driven Design with Kotlin", "url": "http://oredev.org/2018/sessions#sessions_DayLink-3_", "description": "<p>You will learn about domain-driven design and its tactical design.</p>\n<p>You will learn about implementing a tactical design in Kotlin using also lesser known language features.</p>\n<p>You will learn a little bit about the rules in dungeons and drago</p>"}, {"lang": "en", "startDate": "2018-11-23", "endDate": "2018-11-23", "location": "Kiev, Ukraine", "speaker": "Marharyta Nedzelska", "title": "Devoxx Ukraine 2018", "subject": "Domain-driven Design with Kotlin", "url": "https://dvua18.confinabox.com/speaker/marharyta_nedzelska", "description": "<p>Microservice architecture is now a huge trend. All big organizations with millions of users are doing microservices. This means they have lots of channels of communication between services and need to send and get much data. At some point, you can find yourself in a situation where your current approach doesn’t provide you with efficient communications, you pay more, wait for more, lose more etc. Maybe it’s time to look at gRPC… In this talk, we will cover the basics of gRPC, protocol buffers, and its usage. We will try to understand its pros and cons and where this approach could be used. We will also compare this approach with the alternatives. The most interesting about this talk is that we will have lots of practice. We will learn how to write .proto files, how to make effective communication between your microservices, and of course, write much code (in Kotlin)</p>"}, {"lang": "en", "startDate": "2018-12-01", "endDate": "2018-12-01", "location": "Sandton, South Africa", "speaker": "Pamela Hill", "title": "GDG DevFest South Africa", "subject": "Level up in Kotlin", "url": "https://devfest-southafrica.firebaseapp.com/schedule/2018-12-01?sessionId=147", "description": "<p>Kotlin has taken the Android world by storm since its official support in 2017. Many Android developers are coding or have at least an active interest in Kotlin. This talk aims to help Android developers level up their Kotlin skills, focussing on intermediate/expert language features such as coroutines, DSLs, and libraries/frameworks such as Koin for dependency injection, and Spek for testing.</p>"}, {"lang": "tr", "startDate": "2018-11-04", "endDate": "2018-11-04", "location": "Istanbul, Turkey", "speaker": "Hadi Tok", "title": "GDG DevFest Istanbul", "subject": "RxJava ve Kotlin Coroutines, Kullanim senaryolari", "url": "https://devfest.istanbul/schedule/2018-11-04?sessionId=115", "description": "<p>RxJava bir çok kullanımı olan güçlü bir araç. Asenkron işlem ve fonksiyonel programlamanın bir çok öğesini kullanıma sunuyor. Fakat Kotlin fonksiyonel programlama özelliklerini şimdiden, Asenkron işlemleri kolaylaştıran ve ucuzlaştıran Coroutine'leri 1.3 versiyonu ile sağlıyor. RxJava ve Kotlinin bu özelliklerinin karşılaştıracağım.</p>"}, {"lang": "en", "startDate": "2018-11-06", "endDate": "2018-11-06", "location": "Toronto, Canada", "speaker": "Enrique López Mañas", "title": "AndroidTO", "subject": "Kotlin/Native for Multiplatform Development", "url": "http://androidto.com/#kotlin", "description": "<p>Reliable multiplatform development has been the Holy Grail for Mobile Developers since its inception. Many frameworks did appear and disappear. Kotlin/Native has come strongly, and since it is still in Beta version there are some caveats about this. Is Kotlin/Native reliable for my app? Is it production-ready?</p>\n<p>Come to this talk to learn what Kotlin/Native can do for you.</p>"}, {"lang": "en", "startDate": "2018-11-06", "endDate": "2018-11-06", "location": "Toronto, Canada", "speaker": "Francisco Estévez García", "title": "AndroidTO 2018", "subject": "Simple dependency management in Kotlin", "url": "http://androidto.com/", "content": {"video": "https://www.youtube.com/watch?v=CR5h2Wq1yPE"}, "description": "<p>In this talk we will discover how we can use just Kotlin features to inject dependencies through our codebase. Using this novel approach we'll introduce the concept of Type Classes, a unit of abstraction and configuration used to architect apps and libraries.</p>"}, {"lang": "en", "startDate": "2018-11-16", "endDate": "2018-11-16", "location": "Jurmala, Latvia", "speaker": "Zan Markan", "title": "AndroidTO 2018", "subject": "The State of The Kotlin Ecosystem", "url": "https://devfest2018.gdg.lv/", "description": "<p>In early 2018 I ran a survey of the global Kotlin ecosystem. My goal was to learn how developers use and adopt Kotlin - either in work or side projects, or just for playing around, and what are some of the most popular resources for learning it. The survey was a great success, and gained over 2000 responses in total! The results are meant to become a resource for the Kotlin community. Something we can all look at for interesting insights that will also help drive adoption of Kotlin in our teams and organisations. To give you a taster, here’s a few questions I asked in the survey: How big is Android as a proportion of all Kotlin developers Are people happy naming libraries and tooling with K What are the favourite features of the language What kind of DSLs are people building with Kotlin and for what use-cases In my talk will answer all these questions, and more. But be warned, some answers might surprise you.</p>"}, {"lang": "en", "startDate": "2018-11-16", "endDate": "2018-11-16", "location": "Jurmala, Latvia", "speaker": "Svyatoslav Scherbina", "title": "AndroidTO 2018", "subject": "Using Kotlin to share code between iOS and Android", "url": "https://devfest2018.gdg.lv/", "description": "<p>This talk is devoted to using Kotlin to share code between Android and iOS. It also covers Kotlin features and evolution making this possible and convenient. Kotlin Multiplatform Programming is a technology for multiplatform programming in Kotlin. It supports combining both common and platform-specific code in a single codebase with proper tooling enabled. Kotlin/Native is a technology for compiling Kotlin code to native binaries. Kotlin code has seamless interoperability with native platform (e.g. iOS) in this case. The speaker will describe how Kotlin/Native works, what is supported and what is not.</p>"}, {"lang": "en", "startDate": "2018-11-16", "endDate": "2018-11-16", "location": "Jurmala, Latvia", "speaker": "Marcin Moskała", "title": "AndroidTO 2018", "subject": "Superpowers of Property Delegation", "url": "https://devfest2018.gdg.lv/", "description": "<p>Let's dive into possibilities that Kotlin delegation gives. Let’s discover property delegation and understand its superpowers.</p>"}, {"lang": "ru", "startDate": "2018-11-20", "endDate": "2018-11-20", "location": "St.Petersburg, Russia", "speaker": "Nikita Koval", "title": "Joker 2018", "subject": "Как устроены каналы в корутинах в Kotlin", "url": "https://jokerconf.com/2018/talks/2czsxh6yaqcmqc2a2asaqa/", "description": "<p>В отличие от классического многопоточного программирования с манипулированием разделяемой памятью, корутины общаются друг с другом при помощи каналов. Канал позволяет одной корутине отправить элемент, а другой — получить его. При этом данные операции могут быть синхронизированы, и отправитель может ждать получателя и наоборот.</p>\n<p>В этом докладе мы поговорим об устройстве каналов в различных языках и библиотеках, о разработанном в Kotlin алгоритме и узнаем, кто круче: Kotlin или Go.</p>"}, {"lang": "ru", "startDate": "2018-11-20", "endDate": "2018-11-20", "location": "St.Petersburg, Russia", "speaker": "Evgeny Mandrikov", "title": "Joker 2018", "subject": "Java 4..11, Kotlin, Code Coverage и их лучший друг — байткод: скандалы, интриги, расследования", "url": "https://jokerconf.com/2018/talks/10hiblizhceweosio0y66u/", "description": "<p>Знаете ли вы, что внутри ваших .class-файлов? А готовы поспорить? Давайте повеселимся, исследуя конструкции байт-кода, и изучим, как различные компиляторы (Java/Kotlin) и их версии, включая недавно выпущенный javac 11, преобразуют ваш исходный код.</p>\np>Наши исследования будут основаны на деталях реализации самого популярного инструмента для анализа покрытия Java-кода тестами — JaCoCo, чья недавно выпущенная версия находит в байт-коде и отфильтровывает вспомогательные конструкции, генерируемые компиляторами, которые в противном случае требуют зачастую сложных и ненужных ухищрений, чтобы добиться полного покрытия кода.</p>"}, {"lang": "ru", "startDate": "2018-11-20", "endDate": "2018-11-20", "location": "Moscow, Russia", "speaker": "Anton Keks", "title": "Mobius 2018", "subject": "Kotlin puzzlers, Vol. 2", "url": "https://mobiusconf.com/en/talks/cejpjlsjpgag2i4gaoaa0/", "description": "<p>Kotlin is a marvelous language that makes programming on the JVM fun again. During the design phase of the language, it was said that Kotlin specifically tried to avoid some of the most famous Java Puzzlers. However, having so many advanced features, it cannot avoid introducing puzzlers of its own. This talk will present some of the more interesting nuances of syntax or language features with the help of small puzzler programs letting the audience guess their behavior. The mystery will then be revealed with an explanation in a fun way.</p>\n<p>Having received an overwhelmingly good feedback from the previous version, Anton is ready with a set of completely new puzzlers to entertain you among all these really serious talks!</p>"}, {"lang": "ru", "startDate": "2018-11-20", "endDate": "2018-11-20", "location": "Moscow, Russia", "speaker": "Svyatoslav Scherbina", "title": "Mobius 2018", "subject": "Using Kotlin to share code between Android and iOS", "url": "https://mobiusconf.com/en/talks/2edqedhw7a60kikyqa6iwo/", "description": "<p>This talk's main topic is how you can use Kotlin to share code between Android and iOS. We will also cover Kotlin platform development trends that make this easy and possible.</p>\n<p>Kotlin Multiplatform Programming technology allows you to combine common and platform-specific code in a single codebase while also supporting tooling for this kind of development model. We'll see how this looks and discuss why it should be like this and not the other way around.</p>\n<p>Kotlin/Native technology allows you to compile Kotlin into native code while also giving you an option to interact seamlessly with native platform (iOS, for example). We'll discuss what, why and how does (and does not) work.</p>"}, {"lang": "en", "startDate": "2018-10-25", "endDate": "2018-10-25", "location": "London, UK", "speaker": "Marcin Koziński", "title": "droidcon London 2018", "subject": "Kotlinise your Gradle Build Scripts and Plugins", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "description": "<p>Are you using Gradle to build your Android app? Are you writing Gradle plug-ins? You'll be delighted to learn you can do it in Kotlin and it'll make your life better 🙂/p>\n<p>Gradle Kotlin DSL is this new thing that aims to fix some annoyances you might have with your build scripts. And if you're thinking \"Wait, what's Kotlin got to do with my build scripts? Ain't that just a JSON-ish Gradle specific text file?\", then don't worry. Marcin will explain that in fact no, the build script is just code (spoiler: not Java™️ Programming Language code, but close) and how Gradle Kotlin DSL makes it better./p>\n<p>He'll also take a pretty detailed look at how Gradle Kotlin DSL works for Android projects. Can you use it for your app's build script right now? Does it support the extra features (and complexity) that the Android Gradle plugin adds into the mix?/p>\n<p>If you're more (or also) interested in plugin development, writing them in Kotlin is not so new, but he'll quickly show how to do it anyway because it's great and you should try it!</p>"}, {"lang": "en", "startDate": "2018-10-25", "endDate": "2018-10-25", "location": "London, UK", "speaker": "Matthew Dolan", "title": "droidcon London 2018", "subject": "Why Effective Java Still Matters to Kotlin Developers", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "description": "<p>Effective Java by Joshua Bloch profoundly influenced the design of Kotlin yet by exploring a selection of \"items\" from the book you will see how it is still just as relevant to Kotlin developers today when we aim to write Effective Kotlin code. For example, consider how data classes implement equals, and you can see that it doesn't follow the rules suggested and as such is not always optimal.</p>"}, {"lang": "en", "startDate": "2018-10-26", "endDate": "2018-10-26", "location": "London, UK", "speaker": "Paco Estevez", "title": "droidcon London 2018", "subject": "Simple dependency management in Kotlin", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "content": {"video": "http://uk.droidcon.com/skillscasts/12907-simple-dependency-management-in-kotlin"}, "description": "<p>In this talk you will discover how we can use just Kotlin features to inject dependencies through our codebase. Using this novel approach you'll learn about the concept of Type Classes, a unit of abstraction and configuration used to architect apps and libraries.</p>"}, {"lang": "en", "startDate": "2018-10-26", "endDate": "2018-10-26", "location": "London, UK", "speaker": "Kevin Galligan", "title": "droidcon London 2018", "subject": "Kotlin Multiplatform Architecture", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "content": {"video": "https://skillsmatter.com/skillscasts/12710-kotlin-multiplatform-architecture"}, "description": "<p>Code sharing options for mobile have existed for years, but most tend to be relatively obscure (Rubymotion), difficult to use (C++), or limited in scope or developer interest (J2objc). Kotlin Multiplatform will emerge as an option that allows significant sharing of logic and architecture, while still allowing easy fully native integration, and have overwhelming developer community interest. This talk explores the current ecosystem, what popular libraries and tools are available, what’s coming soon, and how to get started building multiplatform for mobile.</p>\n<p>To talk review people. The status of Kotlin and multiplatform will change dramatically between now and October, so while the talk will be on this topic, it’s hard to predict exactly where you’ll be by then. Kevin has spent 2 years working on a J2objc solution to sharing architecture and has switched to Kotlin. He's recently released a functional demo of SQLite and SQLDelight running on iOS and is currently working on a formal SQLite shared library, which should be published later this month.</p>"}, {"lang": "en", "startDate": "2018-10-25", "endDate": "2018-10-25", "location": "London, UK", "speaker": "Marcin Koziński", "title": "droidcon London 2018", "subject": "Kotlinise your Gradle Build Scripts and Plugins", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "content": {"video": "https://skillsmatter.com/skillscasts/12245-kotlinise-your-gradle-build-scripts-and-plugins"}, "description": "<p>Are you using Gradle to build your Android app? Are you writing Gradle plug-ins? You'll be delighted to learn you can do it in Kotlin and it'll make your life better 🙂</p>\n<p>Gradle Kotlin DSL is this new thing that aims to fix some annoyances you might have with your build scripts. And if you're thinking \"Wait, what's Kotlin got to do with my build scripts? Ain't that just a JSON-ish Gradle specific text file?\", then don't worry. Marcin will explain that in fact no, the build script is just code (spoiler: not Java™️ Programming Language code, but close) and how Gradle Kotlin DSL makes it better.</p>\n<p>He'll also take a pretty detailed look at how Gradle Kotlin DSL works for Android projects. Can you use it for your app's build script right now? Does it support the extra features (and complexity) that the Android Gradle plugin adds into the mix?</p>\n<p>If you're more (or also) interested in plugin development, writing them in Kotlin is not so new, but he'll quickly show how to do it anyway because it's great and you should try it!</p>"}, {"lang": "en", "startDate": "2018-10-26", "endDate": "2018-10-26", "location": "London, UK", "speaker": "Jorge Ortiz Fuentes", "title": "droidcon London 2018", "subject": "Workshop: Let's Migrate to Gradle Kotlin DSL", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "content": {"video": "https://skillsmatter.com/skillscasts/12187-workshop-let-s-migrate-to-gradle-kotlin-dsl"}, "description": "<p>Gradle is an awesome and very powerful build tool. It is key to tune your build and even more relevant to achieve the promised karma of continuous integration. However, one of its biggest \"shortcomings\" is that in order to extract any drop of power juice, you need to know and use Groovy. Nothing against Groovy, but it is just another language and, very likely, one that you don't use very often. But worry no more! Now you can use the same language that you enjoy and use it when you write the code of your apps: Kotlin. During this workshop Jorge will start with a walk through some of the most relevant features of gradle. Then you will learn how to transform the gradle configuration of a project to use Kotlin DSL. You will finish by extending that configuration with a new functionality taking advantage of writing it in Kotlin. Join Jorge to kotlinize your gradle!</p>"}, {"lang": "en", "startDate": "2018-10-26", "endDate": "2018-10-26", "location": "London, UK", "speaker": "Hadi Hariri", "title": "droidcon London 2018", "subject": "Workshop: Creating DSLs in Kotlin", "url": "https://skillsmatter.com/conferences/10301-droidcon-london-2018#program", "content": {"video": "https://skillsmatter.com/skillscasts/12203-workshop-creating-dsls-in-kotlin"}, "description": "<p>One of Kotlin's powers is the ability to easily create Domain Specific Languages which can be used in your application. In this workshop you'll learn the basics of Kotlin functions and see how you can combine a series of features to create DSLs that can be used to represent a variety of things in your apps, ranging from configuration to domain logic.</p>"}, {"lang": "en", "startDate": "2018-11-06", "endDate": "2018-11-06", "location": "Dublin, Ireland", "speaker": "Daniel González Reina", "title": "Dublin Kotlin User Group", "subject": "Create a Kotlin-React App", "url": "https://www.meetup.com/Dublin-Kotlin-User-Group/events/256027670/", "description": "<p>In this meetup we'll learn how to create a web app using the Kotlin wrappers for React. We'll see how to take advantage of Kotlin features to write expressive code that will compile to a React application.</p>"}, {"lang": "en", "startDate": "2018-11-05", "endDate": "2018-11-05", "location": "Oslo, Norway", "speaker": "Marie Katrine Ekeberg", "title": "Oslo Kotlin Meetup", "subject": "Testing in Kotlin and YOU", "url": "https://www.meetup.com/meetup-group-nWeRbyMu/events/255357691/", "description": "<p>What options do you have for testing your code in Kotlin? Some people will probably just jump straight to JUnit as a testing framework, but did you know you that Spek offers an alternative approach with a domain specific language (DSL) for tests? Your choice of tools doesn't stop here. You have alternative assertion libraries, mocking frameworks and more that are different from what you may be used to in Java. The builder pattern is also even simpler in Kotlin, which make creating test data builders work like a charm. We will look at these topics and more! With examples ranging from small utility classes to integration tests with Spring.</p>"}, {"lang": "en", "startDate": "2018-11-07", "endDate": "2018-11-07", "location": "New York, NY, USA", "speaker": "Javier Moreno Aleman, Tammy Tyberg", "title": "New York Kotlin Meetup", "subject": "NYC Subway Sign with Kotlin and Raspberry Pi", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/255636916/", "description": "<p>A few months ago we were looking through a gift guide and saw one of those nice-looking, real-time Subway signs that you put on a coffee table or a bookshelf. We decided to get one, then saw the price (+$300) and thought, \"Wait a minute, we're pretty sure we can just build this for less money.\" So after grabbing one of the many Raspberry Pis lying around the office, and with Kotlin as the weapon of choice, we embarked on a new project: Your own personal subway sign for (way) under $300.</p>"}, {"lang": "en", "startDate": "2018-11-07", "endDate": "2018-11-07", "location": "New York, NY, USA", "speaker": "Ryan Cooke", "title": "New York Kotlin Meetup", "subject": "Building Backend Microservices in Kotlin", "url": "https://www.meetup.com/New-York-Kotlin-Meetup/events/255636916/", "description": "<p>Ryan will describe how Kotlin has gone from a hackathon experiment to the language of choice for backend service development at N26. He will present thoughtful strategies on how to build adoption based on learnings from false-starts introducing other languages to the stack. And with a bottoms-up approach, Kotlin eventually advanced into his firm's Android applications. N26 is now an active member in the Kotlin community in Europe and is focused on applying emerging features such as coroutines to their event driven systems.</p>"}]